{"id": 1, "text": "Citizens can register their complaints with police and then based on the evidence, facts and following investigation, police shall take the complaint forward.", "labels": [[0, 8, "Actor"], [22, 38, "Resource"], [44, 50, "Actor"], [69, 81, "Resource"], [83, 88, "Resource"], [93, 116, "Resource"], [118, 124, "Actor"], [136, 149, "Resource"]]}
{"id": 2, "text": "The Registration module acts as an interface between the police and citizens and it eases the approach, interaction and information exchange between police and complainants.", "labels": [[0, 23, "Actor"], [32, 76, "Resource"], [57, 63, "Actor"], [68, 76, "Actor"], [149, 155, "Actor"], [160, 172, "Resource"], [160, 172, "Actor"]]}
{"id": 3, "text": "Interfacing with the courts during the prosecution of cases is an integral part of the responsibilities of police personnel.", "labels": [[21, 27, "Actor"], [35, 59, "Resource"], [107, 123, "Actor"]]}
{"id": 4, "text": "After a complaint is initiated, police initiates the investigation process.", "labels": [[6, 17, "Resource"], [32, 38, "Actor"], [49, 74, "Resource"]]}
{"id": 5, "text": "The Search module of the CCTNS gives police personnel the ability to execute a basic or advanced search on cases.", "labels": [[0, 30, "Actor"], [0, 30, "Resource"], [37, 53, "Actor"], [77, 103, "Resource"]]}
{"id": 6, "text": "Using the search functionality, police personnel can search for a particular person, type of crime, modus operandi, property etc.", "labels": [[6, 30, "Resource"], [10, 30, "Actor"], [32, 48, "Actor"]]}
{"id": 7, "text": "It also gives the user the ability to customize the results view by criminal/accused or by cases.", "labels": [[18, 22, "Actor"], [48, 64, "Resource"]]}
{"id": 8, "text": "It makes reporting easy for police by enabling them to execute different types of queries such as monthly reporting, RTI related etc.", "labels": [[28, 34, "Actor"], [63, 89, "Resource"]]}
{"id": 9, "text": "The Citizen Interface module of the CCTNS acts as a conduit for the information exchange between citizens and police units/personnel.", "labels": [[0, 41, "Actor"], [50, 88, "Resource"], [97, 105, "Actor"], [110, 132, "Actor"]]}
{"id": 10, "text": "Citizens can use it as a tool to get information or acknowledgements from police.", "labels": [[0, 8, "Actor"], [23, 29, "Resource"], [74, 80, "Actor"]]}
{"id": 11, "text": "The Navigation module of the CCTNS provides role based landing pages which help in navigating through the CCTNS application.", "labels": [[0, 34, "Actor"], [0, 34, "Resource"], [44, 68, "Resource"], [102, 123, "Actor"]]}
{"id": 12, "text": "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency.", "labels": [[9, 20, "Resource"], [85, 101, "Actor"]]}
{"id": 13, "text": "The solution should send alerts (e.g., email, SMS) to the user if the user chooses to whenever any action has been taken on the alert.", "labels": [[0, 12, "Actor"], [25, 31, "Resource"], [58, 62, "Actor"], [70, 74, "Actor"], [124, 133, "Resource"]]}
{"id": 14, "text": "The solution should enable the user to track the submitted defect or enhancement request.", "labels": [[0, 12, "Actor"], [31, 35, "Actor"], [59, 88, "Resource"]]}
{"id": 15, "text": "The solution should enable the help-desk user to view the reports on the submitted defects or enhancement requests category-wise, status-wise, and agewise.", "labels": [[0, 12, "Actor"], [31, 45, "Actor"], [54, 65, "Resource"], [83, 114, "Resource"]]}
{"id": 16, "text": "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.", "labels": [[0, 20, "Resource"], [0, 20, "Actor"], [49, 54, "Actor"], [72, 87, "Actor"], [129, 148, "Resource"], [129, 148, "Actor"]]}
{"id": 17, "text": "The System must keep an unalterable audit trail capable of automatically capturing and storing information.", "labels": [[0, 10, "Actor"], [21, 47, "Resource"]]}
{"id": 18, "text": "An audit trail is a record of actions taken by either the user or the system triggers.", "labels": [[0, 14, "Resource"], [58, 62, "Actor"], [66, 76, "Actor"]]}
{"id": 19, "text": "The word “unalterable” is to mean that the audit trail data cannot be modified in any way or deleted by any user.", "labels": [[39, 59, "Resource"], [108, 112, "Actor"]]}
{"id": 20, "text": "Once the audit trail functionality has been activated, the System must track events without manual intervention, and store in the audit trail information about them.", "labels": [[5, 34, "Resource"], [55, 65, "Actor"], [77, 83, "Resource"], [126, 153, "Resource"]]}
{"id": 21, "text": "The System must maintain the audit trail for as long as required, which will be at least for the life of the case to which it refers.", "labels": [[0, 10, "Actor"], [25, 40, "Resource"]]}
{"id": 22, "text": "The System must ensure that audit trail data is available for inspection on request, so that a specific event can be identified and all related data made accessible, and that this can be achieved by authorised external personnel who have little or no familiarity with the system.", "labels": [[0, 10, "Actor"], [28, 44, "Resource"], [76, 83, "Resource"], [93, 109, "Resource"], [132, 148, "Resource"], [199, 228, "Actor"], [268, 278, "Actor"]]}
{"id": 23, "text": "The System must be able to export audit trails for specified cases (without affecting the audit trail stored by the System).", "labels": [[0, 10, "Actor"], [34, 66, "Resource"]]}
{"id": 24, "text": "This functionality can be used by external auditors who wish to examine or analyse system activity.", "labels": [[0, 18, "Actor"], [0, 18, "Resource"], [34, 51, "Actor"], [83, 98, "Resource"]]}
{"id": 25, "text": "The System must be able to capture and store violations (i.e. A user’s attempts to access a case to which he is denied access), and (where violations can validly be attempted) attempted violations, of access control mechanisms.", "labels": [[0, 10, "Actor"], [45, 55, "Resource"], [201, 226, "Resource"]]}
{"id": 26, "text": "The System must at a minimum be able to provide reports for actions on cases organised.", "labels": [[0, 10, "Actor"], [48, 67, "Resource"]]}
{"id": 27, "text": "The System should be able to provide reports for actions on cases organised by workstation and (where technically appropriate) by network address.", "labels": [[0, 10, "Actor"], [37, 56, "Resource"], [79, 90, "Actor"], [130, 145, "Actor"]]}
{"id": 28, "text": "The System must allow the user to limit access to cases to specified users or user groups.", "labels": [[0, 10, "Actor"], [22, 30, "Actor"], [50, 55, "Resource"], [59, 74, "Actor"], [78, 89, "Actor"]]}
{"id": 29, "text": "The system should provide for role-based control for the functionality within the system.", "labels": [[0, 10, "Actor"], [30, 70, "Resource"], [78, 88, "Actor"]]}
{"id": 30, "text": "The System must allow only admin-users to set up user profiles and allocate users to groups.", "labels": [[0, 10, "Actor"], [27, 38, "Actor"], [49, 62, "Resource"], [76, 81, "Actor"], [85, 91, "Actor"]]}
{"id": 31, "text": "The System should allow a user to stipulate which other users or groups can access cases.", "labels": [[0, 10, "Actor"], [26, 30, "Actor"], [50, 71, "Actor"], [83, 88, "Resource"]]}
{"id": 32, "text": "The System must allow changes to security attributes for groups or users (such as access rights, security level, privileges, password allocation and management) to be made only by super-user.", "labels": [[0, 10, "Actor"], [33, 52, "Resource"], [57, 72, "Actor"], [82, 95, "Resource"], [97, 111, "Resource"], [113, 123, "Resource"], [125, 159, "Resource"], [180, 190, "Actor"]]}
{"id": 33, "text": "If a user requests access to, or searches for, a case which he does not have the right to access, the System must provide following responses.", "labels": [[3, 18, "Resource"], [5, 9, "Actor"], [47, 53, "Resource"], [98, 108, "Actor"], [132, 141, "Resource"]]}
{"id": 34, "text": "If a user performs a quick or advanced search, the System must never include in the search result list any record which the user does not have the right to access.", "labels": [[5, 9, "Actor"], [19, 45, "Resource"], [47, 57, "Actor"], [80, 102, "Resource"], [120, 128, "Actor"]]}
{"id": 35, "text": "If the System allows users to make unauthorised attempts to access cases, it must log these in the audit trail.", "labels": [[3, 13, "Actor"], [21, 26, "Actor"], [67, 72, "Resource"], [95, 110, "Resource"]]}
{"id": 36, "text": "Any access to cases, and all other activities involving the cases and related documents or data should also need to be stored in the audit trail to ensure legal admissibility and to assist in data recovery.", "labels": [[14, 19, "Resource"], [35, 45, "Resource"], [70, 95, "Resource"], [129, 144, "Resource"]]}
{"id": 37, "text": "All error messages produced by the System must be meaningful, so that they can be appropriately acted upon by the users who are likely to see them.", "labels": [[0, 18, "Resource"], [31, 41, "Actor"], [114, 119, "Actor"]]}
{"id": 38, "text": "The System must employ a single set of user interface rules, or a small number of sets to provide a familiar and common look and feel for the application.", "labels": [[0, 10, "Actor"], [23, 59, "Resource"], [98, 133, "Resource"]]}
{"id": 39, "text": "The System must be able to display several entities (cases, suspects) simultaneously.", "labels": [[0, 10, "Actor"], [35, 51, "Resource"], [53, 58, "Resource"], [60, 68, "Resource"]]}
{"id": 40, "text": "The interfaces must be made customizable or user-configurable to the extent possible. (e.g., the displayed columns in the table, move, resize, modify the appearance).", "labels": [[0, 14, "Actor"], [0, 14, "Resource"], [93, 127, "Resource"], [154, 164, "Resource"]]}
{"id": 41, "text": "The System user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines.", "labels": [[0, 25, "Actor"], [0, 25, "Resource"], [47, 71, "Actor"], [144, 176, "Resource"]]}
{"id": 42, "text": "The System must provide End User and Administrator functions which are easy to use and intuitive throughout.", "labels": [[0, 10, "Actor"], [24, 60, "Resource"]]}
{"id": 43, "text": "The System must allow persistent defaults for data entry where desirable.", "labels": [[0, 10, "Actor"], [22, 56, "Resource"]]}
{"id": 44, "text": "Frequently-executed System transactions must be designed so that they can be completed with a small number of interactions (e.g. mouse clicks).", "labels": [[0, 39, "Actor"], [0, 39, "Resource"], [92, 122, "Resource"], [129, 141, "Resource"]]}
{"id": 45, "text": "Where the System employs a graphical user interface, it must allow users to customise it.", "labels": [[6, 16, "Actor"], [25, 51, "Resource"], [67, 72, "Actor"]]}
{"id": 46, "text": "The user interfaces should be designed to make them user-intuitive.", "labels": [[0, 19, "Actor"], [0, 19, "Resource"]]}
{"id": 47, "text": "The administrator will be in charge of assigning privileges of accounts.", "labels": [[0, 17, "Actor"], [49, 71, "Resource"]]}
{"id": 48, "text": "Suggested more than one individual can have administrator privilege to ensure advisability.", "labels": [[24, 34, "Actor"], [44, 67, "Resource"]]}
{"id": 49, "text": "Sales Personnel: Is generally the owner of the Web Store tasked with updating inventory and product line descriptions. Once added, sales personnel can add, delete and change descriptions, pictures, prices, and when ready flag items for customers to buy.", "labels": [[0, 15, "Actor"], [30, 56, "Actor"], [78, 117, "Resource"], [131, 146, "Actor"], [226, 231, "Resource"], [236, 245, "Actor"]]}
{"id": 50, "text": "Customer: A customer is an individual wishing to purchase inventory from GAMMA-J’s Web Store.", "labels": [[0, 8, "Actor"], [12, 20, "Actor"], [58, 67, "Resource"], [73, 92, "Actor"]]}
{"id": 51, "text": "The Web store will have a variety of clientele depending upon the inventory loaded on the Key.", "labels": [[0, 13, "Actor"], [62, 75, "Resource"], [86, 93, "Resource"]]}
{"id": 52, "text": "When creating a new account on Web Store it will default as a customer account.", "labels": [[14, 27, "Resource"], [31, 40, "Actor"], [60, 78, "Resource"]]}
{"id": 53, "text": "Later if the account needs to be upgraded the administrator can accomplish this via the administrator interface.", "labels": [[9, 20, "Resource"], [9, 20, "Actor"], [42, 59, "Actor"], [84, 111, "Actor"], [84, 111, "Resource"]]}
{"id": 54, "text": "Shall install online help for users via the web interface.", "labels": [[14, 25, "Resource"], [30, 35, "Actor"], [40, 57, "Actor"], [40, 57, "Resource"]]}
{"id": 55, "text": "Shall deliver Operations and Maintenance manual, Users Guide book, and Installation Instructions for the Administrator.", "labels": [[14, 47, "Resource"], [49, 65, "Resource"], [71, 96, "Resource"], [101, 118, "Actor"]]}
{"id": 56, "text": "Customers will be able to create accounts to store their customer profiles, configure contact information, view their purchase history, and confirm orders.", "labels": [[0, 9, "Actor"], [33, 41, "Resource"], [51, 74, "Resource"], [86, 105, "Resource"], [112, 134, "Resource"], [140, 154, "Resource"]]}
{"id": 57, "text": "Customers will be able to register, log in, and log out of their accounts.", "labels": [[0, 9, "Actor"], [59, 73, "Resource"]]}
{"id": 58, "text": "Furthermore, Customer profiles will also include payment information, such as the ability to store credit card information, and address information.", "labels": [[13, 30, "Resource"], [13, 30, "Actor"], [49, 68, "Resource"], [99, 122, "Resource"], [128, 147, "Resource"]]}
{"id": 59, "text": "Customers will be able to create accounts to store their profiles, contact information, purchase history, and confirm orders.", "labels": [[0, 9, "Actor"], [33, 41, "Resource"], [51, 65, "Resource"], [67, 86, "Resource"], [88, 104, "Resource"], [110, 124, "Resource"]]}
{"id": 60, "text": "Products will be stored in multi-tiered categories; a category can contain sub categories or products. The inventory management will allow for administrators to update the categories, the products placed in categories, and the specific product details.", "labels": [[0, 8, "Resource"], [0, 8, "Actor"], [52, 62, "Resource"], [103, 127, "Actor"], [103, 127, "Resource"], [143, 157, "Actor"], [168, 182, "Resource"], [184, 196, "Resource"], [223, 251, "Resource"]]}
{"id": 61, "text": "Customers will be able to add and store products for purchase within the shopping cart.", "labels": [[0, 9, "Actor"], [40, 48, "Resource"], [69, 86, "Resource"]]}
{"id": 62, "text": "Customers will also be able to add products into the shopping cart.", "labels": [[0, 9, "Actor"], [35, 43, "Resource"], [49, 66, "Resource"]]}
{"id": 63, "text": "The shopping cart will clearly display the number of items in the cart, along with the total cost.", "labels": [[0, 17, "Resource"], [0, 17, "Actor"], [53, 58, "Resource"], [62, 70, "Resource"]]}
{"id": 64, "text": "The customer will also be able to add to or remove products from the shopping cart prior to checkout and order confirmation.", "labels": [[0, 12, "Actor"], [51, 59, "Resource"], [65, 82, "Resource"]]}
{"id": 65, "text": "Order confirmation will allow the customer to review their order after checkout prior to confirmation.", "labels": [[0, 18, "Actor"], [30, 42, "Actor"], [53, 64, "Resource"]]}
{"id": 66, "text": "Customers will be able to confirm the order after checkout.", "labels": [[0, 9, "Actor"], [34, 43, "Resource"]]}
{"id": 67, "text": "If the order is incorrect, the customer will be able to revise and update their order.", "labels": [[3, 12, "Resource"], [27, 39, "Actor"], [74, 85, "Resource"]]}
{"id": 68, "text": "The customer will then receive a confirmation email with the specific order details.", "labels": [[0, 12, "Actor"], [31, 83, "Resource"]]}
{"id": 69, "text": "The interface will be presented to the customer in a web browser.", "labels": [[0, 13, "Actor"], [0, 13, "Resource"], [35, 47, "Actor"]]}
{"id": 70, "text": "The interface must remain consistent among various web browsers and be intuitive to the customer.", "labels": [[0, 13, "Actor"], [0, 13, "Resource"], [43, 63, "Resource"], [84, 96, "Actor"]]}
{"id": 71, "text": "Customers will be presented with an unambiguous interface to assist in browsing the categories and products.", "labels": [[0, 9, "Actor"], [33, 57, "Resource"]]}
{"id": 72, "text": "Customers will be able to search for products matching their search criteria.", "labels": [[0, 9, "Actor"], [55, 76, "Resource"]]}
{"id": 73, "text": "The interface will be compatible with all major web browsers such as Internet Explorer, Mozilla Navigator, Mozilla Firefox, Opera, and Safari.", "labels": [[0, 13, "Actor"], [0, 13, "Resource"], [38, 60, "Resource"]]}
{"id": 74, "text": "The system will feature an API to allow customers to build custom plug-ins to be able to meet their needs.", "labels": [[0, 10, "Actor"], [24, 30, "Resource"], [40, 49, "Actor"], [59, 74, "Resource"]]}
{"id": 75, "text": "The system will implement an Application Interface to allow for various plug-ins to interact with the system.", "labels": [[0, 10, "Actor"], [26, 50, "Resource"], [64, 80, "Resource"], [64, 80, "Actor"], [98, 108, "Actor"]]}
{"id": 76, "text": "The plug-in API will be well documented and specifications will be provided to plug-in developers.", "labels": [[0, 15, "Actor"], [0, 15, "Resource"], [79, 97, "Actor"]]}
{"id": 77, "text": "The WebOrder system shall send an e-mail confirmation to the customer that the items they ordered will be delivered to the shipping address along with tracking number.", "labels": [[0, 19, "Actor"], [31, 53, "Resource"], [57, 69, "Actor"], [75, 97, "Resource"], [119, 139, "Resource"], [151, 166, "Resource"]]}
{"id": 78, "text": "The WebOrder system shall send an e-mail to System Administrator regarding any technical queries from customers or sales people.", "labels": [[0, 19, "Actor"], [31, 40, "Resource"], [44, 64, "Actor"], [79, 96, "Resource"], [102, 127, "Actor"]]}
{"id": 79, "text": "Inventory administrators: users that can be delegated by any administrative level to work and on the applications assigned permission can varies from one user to another depending on its assigned tasks.", "labels": [[0, 24, "Actor"], [26, 31, "Actor"], [57, 81, "Actor"], [61, 81, "Resource"], [183, 201, "Resource"]]}
{"id": 80, "text": "Inventory administrators can be affected to any administrative or organizational level according to their assigned tasks", "labels": [[0, 24, "Actor"], [48, 86, "Resource"], [100, 120, "Resource"]]}
{"id": 81, "text": "Department administrator have control on his department inventory", "labels": [[0, 24, "Actor"], [41, 65, "Resource"]]}
{"id": 82, "text": "Faculty administrator have control on his faculty inventory", "labels": [[0, 21, "Actor"], [38, 59, "Resource"]]}
{"id": 83, "text": "University administrator and IT Administrators have the control on the entire inventory", "labels": [[0, 24, "Actor"], [29, 46, "Actor"], [67, 87, "Resource"]]}
{"id": 84, "text": "IT administrators can create different category of permission to help administrators to delegate a part of their tasks", "labels": [[0, 17, "Actor"], [70, 84, "Actor"], [107, 118, "Resource"]]}
{"id": 85, "text": "Any administrative level user or inventory user can edit an asset that belongs to its department", "labels": [[4, 29, "Actor"], [33, 47, "Actor"], [57, 96, "Resource"]]}
{"id": 86, "text": "Inter departments: request must be approved by a DA group member and faculty group member unless it came from a higher level group", "labels": [[0, 17, "Resource"], [19, 26, "Resource"], [49, 64, "Actor"], [69, 89, "Actor"], [110, 130, "Resource"]]}
{"id": 87, "text": "Inter faculties transfer: request can be made by any authorised user and approved by faculty group or higher level", "labels": [[0, 24, "Resource"], [53, 68, "Actor"], [85, 114, "Actor"]]}
{"id": 88, "text": "Transfer outside university should be approved by the university group", "labels": [[0, 27, "Resource"], [50, 70, "Actor"]]}
{"id": 89, "text": "Any DA group member or authorised inventory group member asset is owned by the department", "labels": [[0, 62, "Resource"], [4, 19, "Actor"], [23, 56, "Actor"], [75, 89, "Actor"]]}
{"id": 90, "text": "Any faculty member can add all related departments inventory", "labels": [[4, 18, "Actor"], [27, 60, "Resource"]]}
{"id": 91, "text": "Any university group member can add all assets in the inventory", "labels": [[4, 27, "Actor"], [36, 46, "Resource"]]}
{"id": 92, "text": "A bulk entry can be used to add many assets", "labels": [[0, 12, "Resource"], [32, 43, "Resource"]]}
{"id": 93, "text": "request can be made by any authorised user", "labels": [[0, 7, "Resource"], [23, 42, "Actor"]]}
{"id": 94, "text": "After creation a request still pending waiting to be approved by an administrative level user according to that have this authority", "labels": [[15, 24, "Resource"], [65, 93, "Actor"]]}
{"id": 95, "text": "An inventory user should check returned asset and update inventory", "labels": [[0, 17, "Actor"], [31, 45, "Resource"], [57, 66, "Resource"]]}
{"id": 96, "text": "IT group members can create a new space and modify floor structure when they receive an exception request from any administrative level", "labels": [[0, 16, "Actor"], [28, 39, "Resource"], [51, 66, "Resource"], [85, 105, "Resource"], [111, 135, "Actor"]]}
{"id": 97, "text": "Any administration level or authorised inventory group member can display all pending requests waiting for approval from this level and approve those requests", "labels": [[0, 61, "Actor"], [74, 94, "Resource"], [144, 158, "Resource"]]}
{"id": 98, "text": "Inventory is updated when user receive requested asset", "labels": [[0, 9, "Resource"], [0, 9, "Actor"], [26, 30, "Actor"], [39, 54, "Resource"]]}
{"id": 99, "text": "Any administrative level user can delegate another user to execute some or all his authorized actions. And this user acquires the role of inventory administrator", "labels": [[0, 29, "Actor"], [43, 55, "Actor"], [67, 101, "Resource"], [112, 116, "Actor"]]}
{"id": 100, "text": "It is mandatory that learning time is between 2 to 4 hours at maximum, because many task are delegated to working students.", "labels": [[79, 88, "Resource"], [106, 122, "Actor"]]}
{"id": 101, "text": "The THEMAS system shall control the heating and cooling units that are defined as part of the THEMAS system.", "labels": [[0, 17, "Actor"], [32, 61, "Resource"]]}
{"id": 102, "text": "The system shall read this file and the definitions shall be derived from the initialization data in the file.", "labels": [[0, 10, "Actor"], [22, 31, "Resource"], [36, 51, "Resource"], [36, 52, "Actor"], [74, 109, "Resource"]]}
{"id": 103, "text": "The THEMAS system shall use the information contained in the initialization data file to determine which heating and cooling units are part of the THEMAS system.", "labels": [[0, 17, "Actor"], [28, 43, "Resource"], [57, 85, "Resource"], [105, 130, "Resource"]]}
{"id": 104, "text": "There is one heating and cooling unit that corresponds to one thermostat in each of four quadrants on each of three floors of the office building.", "labels": [[9, 37, "Resource"], [9, 37, "Actor"], [58, 72, "Resource"], [58, 72, "Actor"]]}
{"id": 105, "text": "The MultiMahjongServer will automate the game initialisation functions (as opposed to the MultiMahjongClient doing them)", "labels": [[0, 22, "Actor"], [37, 70, "Resource"]]}
{"id": 106, "text": "The MultiMahjongServer will allow players on MultiMahjongClient programs to modify their own names and icons during gameplay (as opposed to only at the beginning).", "labels": [[0, 22, "Actor"], [34, 72, "Actor"], [83, 108, "Resource"]]}
{"id": 107, "text": "The MultiMahjongServer will have a graphical user interface with which the administrator of the server can get log information and change game settings.", "labels": [[0, 22, "Actor"], [33, 59, "Resource"], [71, 102, "Actor"], [111, 126, "Resource"], [138, 151, "Resource"]]}
{"id": 108, "text": "When the user begins the MultiMahjongClient program, they will be able to choose to create a new multi player game, to create a new single player game, to join an existing multi player game, or to quit the program.", "labels": [[5, 13, "Actor"], [21, 51, "Actor"], [91, 114, "Resource"], [126, 150, "Resource"], [160, 189, "Resource"]]}
{"id": 109, "text": "When a user creates a new single player game, they must enter their name, choose an icon from a predetermined list and set the score limit for winning a hand of Mahjong.", "labels": [[5, 11, "Actor"], [20, 44, "Resource"], [62, 72, "Resource"], [81, 88, "Resource"], [94, 114, "Resource"], [123, 138, "Resource"]]}
{"id": 110, "text": "When a user selects the option to join an existing game, the MultiMahjongClient will retrieve a list of any games that still require players from the MultiMahjongServer.", "labels": [[5, 11, "Actor"], [57, 79, "Actor"], [94, 113, "Resource"], [146, 168, "Actor"]]}
{"id": 111, "text": "The MultiMahjongClient must send this join information to the MultiMahjongServer.", "labels": [[0, 22, "Actor"], [33, 54, "Resource"], [58, 80, "Actor"]]}
{"id": 112, "text": "Any user who creates or joins a game will be able to upload their own JPEG or GIF image that they wish to have displayed above their name, if they do not wish to use a preset icon.", "labels": [[0, 8, "Actor"], [60, 87, "Resource"], [166, 179, "Resource"]]}
{"id": 113, "text": "The list of un-started games that the MultiMahjongClient fetches from the MultiMahjongServer will be displayed in such a way that users can see the following information about each game.", "labels": [[0, 28, "Resource"], [34, 56, "Actor"], [70, 92, "Actor"], [130, 135, "Actor"]]}
{"id": 114, "text": "Users who create a new game will be able to choose to play different variations of Mahjong rules other than those described.", "labels": [[0, 5, "Actor"], [59, 96, "Resource"]]}
{"id": 115, "text": "The MultiMahjongClient must only allow players to make moves according to the Chinese rules of Mahjong as described in the rulebook, \"How to Play Mah Jong\".", "labels": [[0, 22, "Actor"], [39, 46, "Actor"], [55, 60, "Resource"], [74, 102, "Resource"], [119, 155, "Resource"]]}
{"id": 116, "text": "The MultiMahjongClient will inform the user whose turn it is to pick up a tile.", "labels": [[0, 22, "Actor"], [35, 43, "Actor"], [72, 78, "Resource"]]}
{"id": 117, "text": "The MultiMahjongClient will retrieve other players' changes in the game situation from the MultiMahjongServer.", "labels": [[0, 22, "Actor"], [37, 59, "Resource"], [87, 109, "Actor"]]}
{"id": 118, "text": "If the configurations of: the current discard, the tiles in a user's hand, and the player whose turn it is, would allow the user to Chow/Pung/Kong/Mahjong under the Chinese rules of Mahjong, the MultiMahjongClient will inform the user that they can do so.", "labels": [[3, 21, "Resource"], [26, 45, "Resource"], [47, 73, "Resource"], [161, 189, "Resource"], [191, 213, "Actor"], [226, 234, "Actor"]]}
{"id": 119, "text": "User's will be able to pick up a tile from the wall if it is their turn.", "labels": [[0, 6, "Actor"], [31, 51, "Resource"]]}
{"id": 120, "text": "User's will be able to Undo their last move if playing in single player mode.", "labels": [[0, 6, "Actor"], [28, 43, "Resource"], [58, 76, "Resource"]]}
{"id": 121, "text": "User's will be able to Save their game if playing in single player mode.", "labels": [[0, 6, "Actor"], [28, 38, "Resource"], [53, 71, "Resource"]]}
{"id": 122, "text": "User's will be able to change their icons/pictures and names during the game.", "labels": [[0, 6, "Actor"], [30, 60, "Resource"]]}
{"id": 123, "text": "The CO will not have access to the data containing the faces of any tiles in the wall or any concealed tiles in any other players' hands.", "labels": [[0, 6, "Actor"], [31, 136, "Resource"]]}
{"id": 124, "text": "The software will provide the UAV operator the necessary tools for computer related communications, mission tasking, mission planning, mission execution, data receipt, data processing, limited data exploitation, and data dissemination.", "labels": [[0, 12, "Actor"], [26, 42, "Actor"], [43, 234, "Resource"]]}
{"id": 125, "text": "The TCS shall have the functionality to allow the operator to generate a UAV mission plan.", "labels": [[0, 7, "Actor"], [19, 36, "Resource"], [46, 58, "Actor"], [71, 89, "Resource"]]}
{"id": 126, "text": "The TCS shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.", "labels": [[0, 7, "Actor"], [19, 36, "Resource"], [60, 77, "Resource"], [83, 124, "Resource"], [83, 124, "Actor"]]}
{"id": 127, "text": "The TCS shall allow authorized operators to install software upgrades via CD-ROM as well as other media storage devices.", "labels": [[0, 7, "Actor"], [20, 40, "Actor"], [52, 69, "Resource"], [74, 80, "Resource"], [92, 119, "Resource"]]}
{"id": 128, "text": "The TCS shall provide an interface between the TCS and an external hard copy printer.", "labels": [[0, 7, "Actor"], [22, 34, "Resource"], [43, 50, "Actor"], [55, 84, "Resource"], [55, 84, "Actor"]]}
{"id": 129, "text": "The TCS shall have the functionality to connect to the power supply equipment provided in the TCS operating environment.", "labels": [[0, 7, "Actor"], [19, 36, "Resource"], [51, 77, "Resource"], [90, 119, "Actor"], [90, 119, "Resource"]]}
{"id": 130, "text": "The TCS will provide an interface between the TCS and a video cassette recorder.", "labels": [[0, 7, "Actor"], [21, 33, "Resource"], [42, 49, "Actor"], [54, 79, "Resource"], [54, 79, "Actor"]]}
{"id": 131, "text": "The TCS shall allow the Operator to fully control the VCR via the TCS Display input device.", "labels": [[0, 7, "Actor"], [20, 32, "Actor"], [50, 57, "Resource"], [62, 90, "Actor"], [62, 90, "Resource"]]}
{"id": 132, "text": "When performing a given task during mission execution, the operator shall be given appropriate warning messages from other concurrently-executing subsystem tasks.", "labels": [[16, 28, "Resource"], [55, 67, "Actor"], [83, 111, "Resource"], [117, 161, "Resource"], [117, 161, "Actor"]]}
{"id": 133, "text": "Client authentication ensures that an authorised client/operator is operating the equipment.", "labels": [[0, 21, "Actor"], [0, 21, "Resource"], [35, 64, "Actor"], [78, 91, "Resource"]]}
{"id": 134, "text": "Basically the communication system must assist the operators, users and other interested parties in performing their tasks by provision of services.", "labels": [[10, 34, "Actor"], [47, 96, "Actor"], [111, 122, "Resource"], [139, 147, "Resource"]]}
{"id": 135, "text": "Local or remote monitoring of the status and changes of states (indications) for operational devices.", "labels": [[30, 62, "Resource"], [81, 100, "Resource"], [81, 100, "Actor"]]}
{"id": 136, "text": "Control function allows an operator or an automatic function to operate equipment like switchgear or transformer, a protection, etc.", "labels": [[0, 16, "Actor"], [0, 16, "Resource"], [24, 60, "Actor"], [39, 60, "Resource"], [72, 81, "Resource"], [87, 97, "Resource"], [101, 112, "Resource"], [114, 126, "Resource"]]}
{"id": 137, "text": "Control is subject to miscellaneous filters that check that there will be no damage if the control is issued.", "labels": [[0, 7, "Actor"], [0, 7, "Resource"], [22, 43, "Resource"], [22, 43, "Actor"]]}
{"id": 138, "text": "System security management allow control and supervision of the security of the system against unauthorised access or loss of activity.", "labels": [[0, 26, "Actor"], [0, 26, "Resource"], [33, 86, "Resource"], [94, 114, "Resource"], [118, 134, "Resource"]]}
{"id": 139, "text": "The communication system shall include functionality to transfer stored data to central storage and processing after restoration of the communication.", "labels": [[0, 24, "Actor"], [39, 52, "Resource"], [65, 76, "Resource"], [80, 95, "Resource"]]}
{"id": 140, "text": "The APAF system shall process the engineering and ancillary information necessary for calibration and science validation into IDFS data sets.", "labels": [[0, 15, "Actor"], [30, 81, "Resource"], [126, 140, "Resource"]]}
{"id": 141, "text": "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I’s.", "labels": [[0, 8, "Actor"], [0, 29, "Resource"], [13, 29, "Actor"], [34, 71, "Resource"], [34, 83, "Actor"], [88, 115, "Actor"], [137, 156, "Actor"]]}
{"id": 142, "text": "SwRI shall provide IDFS data processing algorithms to IRF.", "labels": [[0, 4, "Actor"], [19, 50, "Resource"], [54, 57, "Actor"]]}
{"id": 143, "text": "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s.", "labels": [[0, 25, "Actor"], [0, 25, "Resource"], [39, 43, "Actor"], [71, 90, "Actor"]]}
{"id": 144, "text": "The File/Delete menu item shall provide an interface for deleting a selected file.", "labels": [[0, 25, "Actor"], [0, 25, "Resource"], [40, 52, "Resource"], [66, 81, "Resource"]]}
{"id": 145, "text": "The Configure/Editors menu item shall provide an interface for the user to enter editor configuration information.", "labels": [[0, 26, "Actor"], [0, 31, "Resource"], [46, 58, "Resource"], [63, 71, "Actor"], [81, 113, "Resource"]]}
{"id": 146, "text": "The View/Select Text menu item shall provide an interface for selecting pretty-printed text or text strings associated with SDT displays.", "labels": [[0, 30, "Actor"], [0, 30, "Resource"], [45, 57, "Resource"], [124, 136, "Resource"]]}
{"id": 147, "text": "The user shall be able to initiate processes from an interface provided by the HATS-GUI.", "labels": [[0, 8, "Actor"], [50, 62, "Resource"], [75, 87, "Actor"]]}
{"id": 148, "text": "The HATS-GUI shall interact with the HOST OS to find files in directories.", "labels": [[0, 12, "Actor"], [33, 44, "Actor"], [53, 58, "Resource"]]}
{"id": 149, "text": "The HATS-GUI shall allow the user to select the shapes for types of displayed nodes in a displayed graph.", "labels": [[0, 12, "Actor"], [25, 33, "Actor"], [59, 83, "Resource"], [87, 104, "Resource"]]}
{"id": 150, "text": "The user shall be able to save an SDT generated during transformation program execution.", "labels": [[0, 8, "Actor"], [31, 37, "Resource"]]}
{"id": 151, "text": "The HATS-GUI shall interface with HATS-SML (version 2.0) in order to parse transformation language programs.", "labels": [[0, 12, "Actor"], [34, 42, "Actor"], [34, 56, "Resource"]]}
{"id": 152, "text": "The GUI shall allow the user to create, modify, copy, or delete applications or files regardless of the current status of HATS-SML.", "labels": [[0, 7, "Actor"], [20, 28, "Actor"], [64, 85, "Resource"]]}
{"id": 153, "text": "The HATS-GUI shall provide any other details related to the failure that are available from the Host OS.", "labels": [[0, 12, "Actor"], [27, 86, "Resource"], [92, 103, "Actor"]]}
{"id": 154, "text": "The HATS-GUI shall suggest a file name for the user whenever it prompts the user to enter a file name.", "labels": [[0, 12, "Actor"], [27, 38, "Resource"], [43, 51, "Actor"], [72, 80, "Actor"]]}
{"id": 155, "text": "When a user selects the File/Edit menu item, the HATS-GUI shall request that the operating system start a process and load that process with the editor specified by the application configuration.", "labels": [[5, 11, "Actor"], [20, 43, "Resource"], [45, 57, "Actor"], [77, 97, "Actor"], [141, 151, "Resource"], [165, 194, "Resource"]]}
{"id": 156, "text": "When a user selects the File/Delete menu item, the HATS-GUI shall prompt the user to confirm the deletion operation.", "labels": [[5, 11, "Actor"], [20, 45, "Resource"], [47, 59, "Actor"], [73, 81, "Actor"], [93, 115, "Resource"]]}
{"id": 157, "text": "When a user selects the View/Text menu option, the HATS-GUI shall prompt a user to select a pretty-printed text file in the current application.", "labels": [[5, 11, "Actor"], [20, 45, "Resource"], [47, 59, "Actor"], [73, 79, "Actor"]]}
{"id": 158, "text": "The user shall be able to select an arbitrary set of displayed nodes in a displayed graph.", "labels": [[0, 8, "Actor"], [33, 68, "Resource"], [72, 89, "Resource"]]}
{"id": 159, "text": "The user shall be able to resize windows dynamically.", "labels": [[0, 8, "Actor"], [33, 40, "Resource"]]}
{"id": 160, "text": "The user shall be able to control the display by choosing the color and shapes of displayed nodes based on node type.", "labels": [[0, 8, "Actor"], [62, 97, "Resource"], [107, 116, "Resource"]]}
{"id": 161, "text": "The HATS-GUI shall provide for repeating a search.", "labels": [[0, 12, "Actor"], [41, 49, "Resource"]]}
{"id": 162, "text": "The user shall be prompted to enter a text string describing a string pattern.", "labels": [[0, 8, "Actor"], [36, 77, "Resource"]]}
{"id": 163, "text": "The HATS-GUI shall not halt as a result of any error messages received from HATS-SML.", "labels": [[0, 12, "Actor"], [31, 61, "Resource"], [76, 84, "Actor"]]}
{"id": 164, "text": "The scheduler will allocate jobs based on the job parameters, which are job specifications submitted by the user with the job.", "labels": [[0, 13, "Actor"], [28, 32, "Resource"], [42, 60, "Resource"], [72, 90, "Resource"], [104, 112, "Actor"]]}
{"id": 165, "text": "This feature may be available to both the user and the administrator, to cancel a job or under specific circumstances, change a job parameter.", "labels": [[0, 12, "Actor"], [0, 12, "Resource"], [38, 46, "Actor"], [51, 68, "Actor"], [80, 85, "Resource"], [95, 117, "Resource"], [126, 141, "Resource"]]}
{"id": 166, "text": "This feature will allow the user or administrator to view details about the job that have been submitted, and the progress of the execution of the job.", "labels": [[0, 12, "Actor"], [0, 12, "Resource"], [24, 49, "Actor"], [58, 104, "Resource"], [110, 150, "Resource"]]}
{"id": 167, "text": "This is the function that is responsible for determining the possibility of satisfying the user, given his budget and deadline.", "labels": [[8, 20, "Actor"], [57, 95, "Resource"], [87, 95, "Actor"], [103, 126, "Resource"]]}
{"id": 168, "text": "The minimal requirements are that the cluster user would be able to interact with the system through the Linux command prompt, or through the interface provided by the Sun Grid Engine cluster management system.", "labels": [[0, 24, "Actor"], [34, 50, "Actor"], [82, 92, "Actor"], [101, 125, "Resource"], [138, 209, "Resource"], [164, 209, "Actor"]]}
{"id": 169, "text": "At the main title screen, the user will be able to view a general help screen to reveal basic instructions on game play.", "labels": [[3, 24, "Resource"], [26, 34, "Actor"], [56, 77, "Resource"], [88, 119, "Resource"]]}
{"id": 170, "text": "The information and interface will be effective so that Bobby will easily recognize what to do to start the game immediately and Alice will have no problems navigating through the help section to understand the rules and gameplay.", "labels": [[0, 29, "Resource"], [56, 61, "Actor"], [129, 134, "Actor"], [207, 229, "Resource"]]}
{"id": 171, "text": "Claire will be assured that the students will know what to do from this main screen.", "labels": [[0, 6, "Actor"], [28, 40, "Actor"], [67, 83, "Resource"]]}
{"id": 172, "text": "The user will be given a problem and then must click the correct solution.", "labels": [[0, 8, "Actor"], [23, 32, "Resource"], [53, 73, "Resource"]]}
{"id": 173, "text": "The user can click on the corresponding button to begin the game or follow the link to the Denominators' web page.", "labels": [[0, 8, "Actor"], [22, 46, "Resource"], [87, 113, "Resource"]]}
{"id": 174, "text": "The BE shall receive incoming data packets from the Correlator to Backend network interface.", "labels": [[0, 6, "Actor"], [21, 42, "Resource"], [48, 91, "Actor"], [48, 91, "Resource"]]}
{"id": 175, "text": "The BE shall verify the successful receipt of incoming data from the Correlator.", "labels": [[0, 6, "Actor"], [20, 59, "Resource"], [65, 79, "Actor"]]}
{"id": 176, "text": "The BE shall respond to incoming correlator mode changes, user optional processing sequence and/or parameter changes, and other external inputs that affect the data processing pipeline.", "labels": [[0, 6, "Actor"], [24, 56, "Resource"], [58, 91, "Resource"], [99, 116, "Resource"], [122, 184, "Resource"]]}
{"id": 177, "text": "The BE shall send output data to the e2e System.", "labels": [[0, 6, "Actor"], [18, 29, "Resource"], [33, 47, "Actor"]]}
{"id": 178, "text": "All users of the system shall login using some form of unique identification.", "labels": [[0, 23, "Actor"], [42, 76, "Resource"]]}
{"id": 179, "text": "The administrator shall have the ability to create and add a new user to the system.", "labels": [[0, 17, "Actor"], [59, 69, "Resource"], [73, 83, "Actor"]]}
{"id": 180, "text": "Enable agents to broadcast a message to all the agents within the same local network.", "labels": [[7, 13, "Actor"], [27, 36, "Resource"], [40, 84, "Actor"], [62, 84, "Resource"]]}
{"id": 181, "text": "Enable agents to multicast a message to all the agents within the same multicast address.", "labels": [[7, 13, "Actor"], [27, 36, "Resource"], [40, 88, "Actor"], [62, 88, "Resource"]]}
{"id": 182, "text": "Enable agents to unicast a message to other agents within organization.", "labels": [[7, 13, "Actor"], [25, 34, "Resource"], [38, 70, "Actor"]]}
{"id": 183, "text": "Allow agents to choose to encrypt or not to encrypt message.", "labels": [[6, 12, "Actor"], [52, 59, "Resource"]]}
{"id": 184, "text": "In many network, only system administrator is allowed to send broadcast message.", "labels": [[22, 42, "Actor"], [62, 79, "Resource"]]}
{"id": 185, "text": "This agent should maintain a list of agents who are allowed to get the keys.", "labels": [[0, 10, "Actor"], [27, 44, "Resource"], [67, 75, "Resource"]]}
{"id": 186, "text": "AgentMom shall support the ability to send unicast message.", "labels": [[0, 8, "Actor"], [43, 58, "Resource"]]}
{"id": 187, "text": "AgentMom shall support the ability to receive multicast message from multiple groups.", "labels": [[0, 8, "Actor"], [46, 63, "Resource"], [69, 84, "Actor"]]}
{"id": 188, "text": "If the user has the appropriate privilege (i.e., the user is the administrator user) the tool requests a confirmatory response from the user to start the diagnostic processing.", "labels": [[3, 11, "Actor"], [16, 41, "Resource"], [85, 93, "Actor"], [85, 93, "Resource"], [103, 126, "Resource"], [132, 140, "Actor"], [150, 175, "Resource"]]}
{"id": 189, "text": "The tool returns the current user’s privileges to those of the general user.", "labels": [[0, 8, "Actor"], [0, 8, "Resource"], [17, 46, "Resource"], [50, 75, "Actor"]]}
{"id": 190, "text": "If the user has the appropriate privilege, the tool requests confirmation to stop diagnostic processing.", "labels": [[3, 11, "Actor"], [16, 41, "Resource"], [43, 51, "Actor"], [43, 51, "Resource"], [82, 103, "Resource"]]}
{"id": 191, "text": "the process by which the tool establishes the identity and privileges of the user by obtaining an identifier and password from the user and checking it against a database of predefined users.", "labels": [[0, 11, "Actor"], [21, 29, "Actor"], [21, 29, "Resource"], [42, 69, "Resource"], [73, 81, "Actor"], [95, 121, "Resource"], [127, 135, "Actor"], [160, 190, "Resource"]]}
{"id": 192, "text": "The system must allow a member of the network to send requests to a particular or all the other members about possible delivery of a driver’s smart card to a similar person.", "labels": [[0, 10, "Actor"], [22, 45, "Actor"], [54, 62, "Resource"], [66, 103, "Actor"], [131, 152, "Resource"], [156, 172, "Actor"]]}
{"id": 193, "text": "The system must allow a member of the network to send a bulk request on all or a large part of its driver’s smart card holders to a particular or all members of the network.", "labels": [[0, 10, "Actor"], [22, 45, "Actor"], [54, 68, "Resource"], [72, 126, "Actor"], [130, 172, "Actor"]]}
{"id": 194, "text": "The system must allow a member to do statistics on messages issued and received from/to his system.", "labels": [[0, 10, "Actor"], [22, 30, "Actor"], [51, 59, "Resource"], [88, 98, "Actor"]]}
{"id": 195, "text": "The system must provide automatic reply to the sender of the request through the use of a standard interface to the Members systems.", "labels": [[0, 10, "Actor"], [24, 39, "Resource"], [43, 53, "Actor"], [88, 108, "Resource"], [88, 131, "Actor"]]}
{"id": 196, "text": "The system must track the workflow between senders and related replies.", "labels": [[0, 10, "Actor"], [22, 34, "Resource"], [43, 50, "Actor"], [55, 70, "Actor"]]}
{"id": 197, "text": "The system must provide the management of user rights and permissions.", "labels": [[0, 10, "Actor"], [42, 69, "Resource"]]}
{"id": 198, "text": "The system must be able to include new members in the network through simple administrative tasks.", "labels": [[0, 10, "Actor"], [70, 97, "Resource"]]}
{"id": 199, "text": "The system must guide users through an interface based on end user concepts.", "labels": [[0, 10, "Actor"], [22, 27, "Actor"], [36, 48, "Resource"], [58, 75, "Resource"]]}
{"id": 200, "text": "The color translator allows old scheme to new scheme paint number translation, given a paint number, collection and a target collection.", "labels": [[0, 20, "Actor"], [0, 20, "Resource"], [28, 77, "Resource"], [85, 99, "Resource"], [101, 111, "Resource"], [116, 135, "Resource"]]}
{"id": 201, "text": "The closest color tool allows the user to locate an arbitrary number of close colors to given a paint number, collection in a target collection.", "labels": [[0, 22, "Actor"], [0, 22, "Resource"], [30, 38, "Actor"], [49, 84, "Resource"], [94, 108, "Resource"], [110, 143, "Resource"]]}
{"id": 202, "text": "The color search engine tool will allow locating an arbitrary number of colors in any or all collections based on initial input of a paint name, number, or color value in a industry standard common format.", "labels": [[0, 28, "Actor"], [0, 28, "Resource"], [49, 104, "Resource"], [131, 143, "Resource"], [145, 151, "Resource"], [156, 167, "Resource"], [171, 204, "Resource"]]}
{"id": 203, "text": "The user color matcher only associates this information with a single client based on a persistent client session.", "labels": [[0, 22, "Actor"], [0, 22, "Resource"], [39, 55, "Resource"], [61, 76, "Resource"], [61, 76, "Actor"], [86, 113, "Resource"]]}
{"id": 204, "text": "The administrative interface allows administrative users to update, add, and delete paint information.", "labels": [[0, 28, "Actor"], [0, 28, "Resource"], [36, 56, "Actor"], [84, 101, "Resource"]]}
{"id": 205, "text": "The color sample matcher will allow the user to graphically select with a hardware pointing device the color or blended color group they wish to use in a color search.", "labels": [[0, 24, "Actor"], [0, 24, "Resource"], [36, 44, "Actor"], [72, 98, "Resource"], [99, 141, "Resource"], [152, 166, "Resource"]]}
{"id": 206, "text": "Purchasing Manager is responsible for the arrangement and maintenance of trading agreements with suppliers, including Catalogue data.", "labels": [[0, 18, "Actor"], [0, 18, "Resource"], [73, 91, "Resource"], [97, 106, "Actor"], [118, 132, "Resource"]]}
{"id": 207, "text": "Originator also known as requisitioner, has the original demand for each Item of goods and/or services.", "labels": [[0, 10, "Actor"], [25, 38, "Actor"], [44, 63, "Resource"], [68, 102, "Resource"]]}
{"id": 208, "text": "Customer Service is responsible for resolving issues arising from Purchase Order fulfilment.", "labels": [[0, 16, "Actor"], [46, 52, "Resource"]]}
{"id": 209, "text": "Sales Point is responsible for all communication with the Buyer up to and including the acceptance of a Purchase Order.", "labels": [[0, 11, "Resource"], [0, 11, "Actor"], [58, 63, "Actor"], [104, 118, "Resource"]]}
{"id": 210, "text": "Fulfilment Notification is sent by the Despatch Point (Seller) to inform the Delivery Point (Buyer) that goods have been despatched or delivered or that a service has been performed.", "labels": [[0, 23, "Resource"], [35, 53, "Actor"], [73, 91, "Actor"], [105, 110, "Resource"], [153, 162, "Resource"]]}
{"id": 211, "text": "RFQ is sent by the Originator (Buyer) to the Sales Point (Seller) to request the Seller to supply terms and conditions under which the it is willing to supply goods or services.", "labels": [[0, 3, "Resource"], [15, 29, "Actor"], [41, 56, "Actor"], [77, 87, "Actor"], [98, 118, "Resource"], [159, 176, "Resource"]]}
{"id": 212, "text": "Quotation is sent by the Sales Point (Seller) to Originator (Buyer) to inform the Buyer of the terms and conditions under which the Seller is willing or able to supply goods or services.", "labels": [[0, 9, "Resource"], [21, 36, "Actor"], [49, 59, "Actor"], [78, 87, "Actor"], [91, 115, "Resource"], [128, 138, "Actor"], [168, 185, "Resource"]]}
{"id": 213, "text": "Purchase Order is sent by the Order Point (Buyer) to inform the Sales Point (Seller) that the Buyer wishes to purchase goods or services.", "labels": [[0, 14, "Resource"], [26, 41, "Actor"], [60, 75, "Actor"], [90, 99, "Actor"], [119, 136, "Resource"]]}
{"id": 214, "text": "PO (Purchase Order) Response is sent by the Sales Point (Seller) to inform the Order Point (Buyer) of the intention to supply goods or perform services in response to a Purchase Order.", "labels": [[0, 28, "Resource"], [40, 55, "Actor"], [75, 90, "Actor"], [126, 131, "Resource"], [143, 151, "Resource"]]}
{"id": 215, "text": "Scientific users will use the system to manage input data, run simulations, visualize results, and manage output data.", "labels": [[0, 16, "Actor"], [26, 36, "Actor"], [47, 57, "Resource"], [63, 74, "Resource"], [86, 93, "Resource"], [106, 117, "Resource"]]}
{"id": 216, "text": "Portal Administrator will be responsible for managing user accounts, managing user runs if needed, and general portal settings and monitoring.", "labels": [[0, 20, "Actor"], [54, 67, "Resource"], [78, 87, "Resource"], [111, 126, "Resource"]]}
{"id": 217, "text": "Data users are researchers who need to use simulation output but who do not have the ability to initiate simulations.", "labels": [[0, 10, "Actor"], [15, 26, "Actor"], [43, 60, "Resource"], [105, 116, "Resource"]]}
{"id": 218, "text": "Analysis is the scenario where the user wants to perform post processing on the data, such as the model performance evaluation studies on the output.", "labels": [[12, 24, "Resource"], [31, 39, "Actor"], [76, 84, "Resource"], [94, 126, "Resource"], [138, 148, "Resource"]]}
{"id": 219, "text": "Scenario where the user wants to pull download the output data for further analysis etc.", "labels": [[0, 8, "Resource"], [15, 23, "Actor"], [47, 62, "Resource"], [67, 83, "Resource"]]}
{"id": 220, "text": "Scenario where the user wants to publish output data for the community, i.e. directly publish the data on dataportal.", "labels": [[0, 8, "Resource"], [15, 23, "Actor"], [41, 52, "Resource"], [94, 102, "Resource"], [106, 116, "Resource"]]}
{"id": 221, "text": "All GridBGC users shall be required to have valid NCAR Gatekeeper accounts to use the system.", "labels": [[0, 17, "Actor"], [44, 74, "Resource"], [82, 93, "Actor"]]}
{"id": 222, "text": "The system shall retrieve all user information from the Gatekeeper account system.", "labels": [[0, 10, "Actor"], [26, 46, "Resource"], [52, 81, "Actor"]]}
{"id": 223, "text": "Administrator has additional permissions to administer the operation of the system.", "labels": [[0, 13, "Actor"], [18, 40, "Resource"], [72, 82, "Actor"]]}
{"id": 224, "text": "The user shall be prompted at the beginning of the session for their credentials, once logged in they will not be prompted for additional or different credentials.", "labels": [[0, 8, "Actor"], [47, 58, "Resource"], [63, 80, "Resource"], [127, 162, "Resource"]]}
{"id": 225, "text": "Users can select to share specific objects with other users.", "labels": [[0, 5, "Actor"], [26, 42, "Resource"], [48, 59, "Actor"]]}
{"id": 226, "text": "The system shall display a list of all the objects the user currently has in the system.", "labels": [[0, 10, "Actor"], [35, 50, "Resource"], [51, 59, "Actor"], [77, 87, "Actor"]]}
{"id": 227, "text": "The system shall display a list of all the output tiles to the user.", "labels": [[0, 10, "Actor"], [25, 55, "Resource"], [59, 67, "Actor"]]}
{"id": 228, "text": "The system shall allow the user to select individual parameters as needed.", "labels": [[0, 10, "Actor"], [23, 31, "Actor"], [42, 63, "Resource"]]}
{"id": 229, "text": "The system shall allow the user to view the details of a specific object.", "labels": [[0, 10, "Actor"], [23, 31, "Actor"], [40, 72, "Resource"]]}
{"id": 230, "text": "The system shall allow the user to change the project details for unlocked projects.", "labels": [[0, 10, "Actor"], [23, 31, "Actor"], [42, 61, "Resource"], [66, 83, "Resource"]]}
{"id": 231, "text": "The system shall allow the user to ability to invalidate a locked project.", "labels": [[0, 10, "Actor"], [23, 31, "Actor"], [57, 73, "Resource"]]}
{"id": 232, "text": "The system shall require the users enable cookies to use the system.", "labels": [[0, 10, "Actor"], [25, 34, "Actor"], [42, 49, "Resource"], [57, 67, "Actor"]]}
{"id": 233, "text": "Auditor, Person appointed to manage County business by a majority vote of District Judges that have jurisdiction in the County.", "labels": [[0, 7, "Actor"], [9, 15, "Actor"], [36, 51, "Resource"], [55, 89, "Resource"], [100, 112, "Resource"], [116, 126, "Actor"]]}
{"id": 234, "text": "Commissioners Court,The governing body of the County.", "labels": [[0, 19, "Actor"], [20, 38, "Resource"], [42, 52, "Actor"]]}
{"id": 235, "text": "Court Case Management System, External system used by the Criminal Justice community to manage case information from initial arrest through final disposition.", "labels": [[0, 28, "Actor"], [30, 45, "Actor"], [54, 84, "Actor"], [95, 111, "Resource"], [140, 157, "Resource"]]}
{"id": 236, "text": "Court Coordinator, Person responsible for managing the schedule of a County or District Court.", "labels": [[0, 17, "Actor"], [51, 93, "Resource"], [67, 93, "Actor"]]}
{"id": 237, "text": "County Court Judge, Person elected and/or appointed to preside over a trial court with misdemeanor criminal jurisdiction.", "labels": [[0, 18, "Actor"], [68, 120, "Resource"]]}
{"id": 238, "text": "Defendant, Person arrested and/or charged with a criminal offense but not yet convicted.", "labels": [[0, 9, "Actor"], [47, 65, "Resource"]]}
{"id": 239, "text": "Defense Attorney, Person qualified and appointed to represent a Defendant in an adversarial judicial proceeding", "labels": [[0, 16, "Actor"], [64, 73, "Actor"], [77, 111, "Resource"]]}
{"id": 240, "text": "Detention Facility Officer, Person responsible for processing a Defendant into custody.", "labels": [[0, 26, "Actor"], [79, 86, "Resource"]]}
{"id": 241, "text": "District Attorney, Person responsible for representing the State of Texas in an adversarial judicial proceeding", "labels": [[0, 17, "Actor"], [77, 111, "Resource"]]}
{"id": 242, "text": "District Court Judge, Person elected and/or appointed to preside over a trial court with felony criminal jurisdiction.", "labels": [[0, 20, "Actor"], [70, 83, "Resource"], [89, 117, "Resource"]]}
{"id": 243, "text": "Local Selection Committee, Committee appointed by the Presiding Judge of the Administrative Judicial Region to adopt standards for the qualification of attorneys to be appointed to represent indigent defendants in capital cases in which the death penalty is sought.", "labels": [[0, 25, "Actor"], [117, 161, "Resource"], [191, 227, "Resource"]]}
{"id": 244, "text": "Magistrate, Person responsible for informing the Defendant of their right to an appointed counsel and determination of indigent status.", "labels": [[0, 10, "Actor"], [45, 58, "Actor"], [62, 73, "Resource"], [77, 97, "Resource"], [119, 134, "Resource"]]}
{"id": 245, "text": "Presiding Administrative Judge, Person appointed by the Governor to preside over the administrative judicial region.", "labels": [[0, 30, "Actor"], [52, 64, "Actor"], [81, 115, "Resource"]]}
{"id": 246, "text": "Task Force on Indigent Defense, Standing committee of the Texas Judicial Council responsible for establishing standards for Indigent Defense Services.", "labels": [[0, 30, "Actor"], [54, 80, "Resource"], [110, 149, "Resource"]]}
{"id": 247, "text": "Detention Facility Officer captures Defendant, Incident, and Financial Information.", "labels": [[0, 26, "Actor"], [36, 45, "Actor"], [36, 82, "Resource"], [47, 55, "Actor"]]}
{"id": 248, "text": "Office of Attorney Appointments receives/reviews the Request for Appointed Counsel.", "labels": [[0, 31, "Actor"], [49, 82, "Resource"]]}
{"id": 249, "text": "An instant messenger is an application, which allows instant text communication between two or more people through a network such as the Internet.", "labels": [[0, 20, "Resource"], [0, 20, "Actor"], [24, 38, "Resource"], [53, 79, "Resource"]]}
{"id": 250, "text": "With the use of an existing Passport account the user can login to the messenger.", "labels": [[16, 44, "Resource"], [45, 53, "Actor"], [67, 80, "Actor"]]}
{"id": 251, "text": "The application provides a list where the end-user can choose the new status.", "labels": [[0, 15, "Actor"], [0, 15, "Resource"], [25, 50, "Resource"], [38, 50, "Actor"], [62, 76, "Resource"]]}
{"id": 252, "text": "Ability to request the TV program / channel to which the end-users online buddy is watching at the moment.", "labels": [[19, 43, "Resource"]]}
{"id": 253, "text": "Display a list of emoticons to choose from when the user wants to include an emoticon in the message he is writing.", "labels": [[8, 27, "Resource"], [48, 56, "Actor"], [74, 85, "Resource"], [89, 100, "Resource"]]}
{"id": 254, "text": "The RLCS Application will also allow for remote access through a firewall via outside telecommunications networks by authorized users.", "labels": [[0, 20, "Actor"], [63, 73, "Resource"], [78, 113, "Resource"], [117, 133, "Actor"]]}
{"id": 255, "text": "The RLCS Application will allow an operator to view system status and issue commands to change device status as well as configure the system and generate reports.", "labels": [[0, 20, "Actor"], [32, 43, "Actor"], [52, 84, "Resource"], [95, 108, "Resource"], [154, 161, "Resource"]]}
{"id": 256, "text": "The RLCS will provide access to system status data, to external systems through a firewall.", "labels": [[0, 8, "Actor"], [32, 50, "Resource"], [55, 71, "Actor"], [80, 90, "Resource"]]}
{"id": 257, "text": "The RLCS software shall send to and receive data from the field device I/O cards through I/O driver software.", "labels": [[0, 17, "Actor"], [54, 80, "Resource"], [89, 108, "Resource"], [89, 108, "Actor"]]}
{"id": 258, "text": "The system shall have a Graphical User Interface (GUI) that allows the operator to view system status, issue commands to change device status, configure the system, export log data, and generate reports.", "labels": [[0, 10, "Actor"], [22, 54, "Resource"], [24, 54, "Actor"], [67, 79, "Actor"], [88, 101, "Resource"], [109, 117, "Resource"], [128, 141, "Resource"], [172, 180, "Resource"], [195, 202, "Resource"]]}
{"id": 259, "text": "When an operator is making changes on the system, the GUI configuration screen shall display to the user which device, controller, or workstation in the RLCS network will be affected by the changes.", "labels": [[5, 16, "Actor"], [27, 34, "Resource"], [50, 78, "Actor"], [50, 78, "Resource"], [96, 104, "Actor"], [111, 117, "Resource"], [119, 129, "Resource"], [134, 145, "Resource"], [186, 197, "Resource"]]}
{"id": 260, "text": "The system shall control all system field elements to device sensor level for those device sensors that may be controlled.", "labels": [[0, 10, "Actor"], [25, 50, "Resource"], [78, 98, "Resource"]]}
{"id": 261, "text": "The system operator shall be able to override any device and continue with a system operational command sequence.", "labels": [[0, 19, "Actor"], [46, 56, "Resource"], [75, 112, "Resource"]]}
{"id": 262, "text": "The RLCS shall support remote system administration and maintenance of the system.", "labels": [[0, 8, "Actor"], [23, 51, "Resource"], [71, 81, "Actor"]]}
{"id": 263, "text": "Ability to reset user passwords when needed", "labels": [[17, 31, "Resource"]]}
{"id": 264, "text": "Ability to insert a new privacy policy to the repository", "labels": [[18, 38, "Resource"]]}
{"id": 265, "text": "Ability to delete a privacy policy from the repository", "labels": [[18, 34, "Resource"]]}
{"id": 266, "text": "Ability to create/add a new domain of privacy policies (e.g, Healthcare, financial, e-commerce, federal agency, etc.)", "labels": [[22, 54, "Resource"]]}
{"id": 267, "text": "Project manager sets restrictions on access to certain kinds of information for guests", "labels": [[0, 15, "Actor"], [21, 33, "Resource"], [47, 75, "Resource"], [80, 86, "Actor"]]}
{"id": 268, "text": "Ability to export data from a project to an XML file so multiple project managers can use that data", "labels": [[18, 22, "Resource"], [41, 52, "Resource"], [56, 81, "Actor"], [90, 99, "Resource"]]}
{"id": 269, "text": "Ability to save the current version of the repository so that we can do evolution analysis", "labels": [[16, 35, "Resource"], [72, 90, "Resource"]]}
{"id": 270, "text": "Ability to select a privacy policy that has been assigned to them by the project manager.", "labels": [[18, 34, "Resource"], [69, 88, "Actor"]]}
{"id": 271, "text": "Ability to add, delete and update goals", "labels": [[34, 39, "Resource"]]}
{"id": 272, "text": "Ability to add, delete and update scenarios", "labels": [[34, 43, "Resource"]]}
{"id": 273, "text": "Ability to view the details of any goal or a scenario in the repository such as ID, description, source, keyword, taxonomy, actor, occurrence, relevant policy etc.", "labels": [[31, 53, "Resource"], [80, 82, "Resource"], [84, 95, "Resource"], [97, 103, "Resource"], [105, 112, "Resource"], [114, 122, "Resource"], [124, 129, "Resource"], [131, 141, "Resource"], [143, 158, "Resource"]]}
{"id": 274, "text": "Ability to update personal profile such as name, ID, contact information, usergroups and passwords", "labels": [[18, 34, "Resource"], [43, 47, "Resource"], [49, 51, "Resource"], [53, 72, "Resource"], [74, 84, "Resource"], [89, 98, "Resource"]]}
{"id": 275, "text": "Ability to add, delete and update requirements", "labels": [[34, 46, "Resource"]]}
{"id": 276, "text": "Ability to add, delete and update access control policies such as subject, object, action.", "labels": [[34, 57, "Resource"], [66, 73, "Resource"], [75, 81, "Resource"], [83, 89, "Resource"]]}
{"id": 277, "text": "Ability to view access control policies", "labels": [[23, 39, "Resource"]]}
{"id": 278, "text": "Ability to view kinds of information in the repository with restrictions set by the project manager.", "labels": [[16, 36, "Resource"], [60, 72, "Resource"], [80, 99, "Actor"]]}
{"id": 279, "text": "The system shall allow all users to have different access levels to the projects.", "labels": [[0, 10, "Actor"], [23, 32, "Actor"], [36, 64, "Resource"]]}
{"id": 280, "text": "Each user will have different projects to work on as well as different access levels that will allow them certain privileges within the project.", "labels": [[0, 9, "Actor"], [20, 38, "Resource"], [61, 84, "Resource"], [106, 124, "Resource"]]}
{"id": 281, "text": "The system will allow analysts to enter a new goal into the system as new goals are identified.", "labels": [[0, 10, "Actor"], [22, 30, "Actor"], [40, 50, "Resource"], [56, 66, "Actor"], [70, 79, "Resource"]]}
{"id": 282, "text": "The system shall provide templates for goals, scenarios, P3P statments, EPAL rules and access control policies.", "labels": [[0, 10, "Actor"], [39, 44, "Resource"], [46, 55, "Resource"], [57, 70, "Resource"], [72, 82, "Resource"], [87, 110, "Resource"]]}
{"id": 283, "text": "The system will allow the administrator, project manager and analysts to classify goals in the following categories.", "labels": [[0, 10, "Actor"], [22, 39, "Actor"], [41, 56, "Actor"], [61, 69, "Actor"], [82, 87, "Resource"], [91, 115, "Resource"]]}
{"id": 284, "text": "The system shall allow the analysts to request a new classification type of goals and also allow the project manager to create that classification type.", "labels": [[0, 10, "Actor"], [23, 35, "Actor"], [47, 81, "Resource"], [97, 116, "Actor"], [127, 151, "Resource"]]}
{"id": 285, "text": "The system will allow analysts and guest to choose a policy and a goal and then the system will allow analysts and guests to view the total occurrences of that particular goal in the chosen policy.", "labels": [[0, 10, "Actor"], [22, 30, "Actor"], [35, 40, "Actor"], [51, 59, "Resource"], [64, 70, "Resource"], [80, 90, "Actor"], [102, 110, "Actor"], [115, 121, "Actor"], [130, 196, "Resource"]]}
{"id": 286, "text": "The system will allow analysts and guests to choose a policy and then the system will allow analysts and guests to view the the number of different goals that occur in that policy.", "labels": [[0, 10, "Actor"], [22, 30, "Actor"], [35, 41, "Actor"], [52, 60, "Resource"], [70, 80, "Actor"], [92, 100, "Actor"], [105, 111, "Actor"], [120, 153, "Resource"], [168, 179, "Resource"]]}
{"id": 287, "text": "The system shall allow analysts to view scenarios associated with individual scenarios.", "labels": [[0, 10, "Actor"], [23, 31, "Actor"], [40, 49, "Resource"], [66, 86, "Resource"]]}
{"id": 288, "text": "The system shall allow analysts to add a scenario to the system.", "labels": [[0, 10, "Actor"], [23, 31, "Actor"], [39, 49, "Resource"], [53, 63, "Actor"]]}
{"id": 289, "text": "The system shall provide the ability to delete a scenario from a project without deleting it from the system", "labels": [[0, 10, "Actor"], [47, 57, "Resource"], [63, 72, "Resource"], [98, 108, "Actor"]]}
{"id": 290, "text": "The system shall allow analysts to add new objects (names, types and other attributes).", "labels": [[0, 10, "Actor"], [23, 31, "Actor"], [39, 50, "Resource"], [52, 57, "Resource"], [59, 64, "Resource"], [69, 85, "Resource"]]}
{"id": 291, "text": "The system shall allow analysts to graphically view the allowable flows for specific types within an organization and across multiple organizations given a set of access control policies.", "labels": [[0, 10, "Actor"], [23, 31, "Actor"], [52, 90, "Resource"], [98, 113, "Resource"], [98, 113, "Actor"], [125, 147, "Resource"], [125, 147, "Actor"], [154, 186, "Resource"]]}
{"id": 292, "text": "The system shall provide a way to capture the mined goalsinformation from the user’s privacy preferences into a database corresponding to the user’s privacy preferences.", "labels": [[0, 10, "Actor"], [42, 68, "Resource"], [74, 104, "Resource"], [110, 120, "Resource"], [138, 168, "Resource"]]}
{"id": 293, "text": "The system shall generate an access log for every add, delete and edit action in the system.", "labels": [[0, 10, "Actor"], [26, 39, "Resource"], [71, 77, "Resource"], [81, 91, "Actor"]]}
{"id": 294, "text": "The Clarus system shall collect, quality control, and disseminate environmental data.", "labels": [[0, 17, "Actor"], [66, 84, "Resource"]]}
{"id": 295, "text": "The Clarus system shall be able to access in-situ environmental observations from data collectors.", "labels": [[0, 17, "Actor"], [42, 76, "Resource"], [82, 97, "Actor"]]}
{"id": 296, "text": "The Clarus system shall be able to access remotely sensed environmental observations from data collectors.", "labels": [[0, 17, "Actor"], [42, 84, "Resource"], [90, 105, "Actor"]]}
{"id": 297, "text": "The Clarus system shall calculate derived environmental data from observations.", "labels": [[0, 17, "Actor"], [34, 60, "Resource"], [66, 78, "Actor"]]}
{"id": 298, "text": "The Clarus system shall be able to receive roadway weather measurements derived from VII data.", "labels": [[0, 17, "Actor"], [43, 71, "Resource"], [85, 93, "Resource"]]}
{"id": 299, "text": "The Clarus system shall allow access to new surface transportation related observed environmental data.", "labels": [[0, 17, "Actor"], [40, 102, "Resource"]]}
{"id": 300, "text": "The Clarus system shall accept environmental data derived from images.", "labels": [[0, 17, "Actor"], [31, 49, "Resource"], [63, 69, "Resource"]]}
{"id": 301, "text": "The Clarus system shall accept surface condition data derived from surface images.", "labels": [[0, 17, "Actor"], [31, 53, "Resource"], [67, 81, "Resource"]]}
{"id": 302, "text": "The Clarus system shall accept atmospheric condition data derived from atmospheric images.", "labels": [[0, 17, "Actor"], [31, 57, "Resource"], [71, 89, "Resource"]]}
{"id": 303, "text": "The Clarus system shall accept weather hazard reports containing the hazard type, location, and timeframe.", "labels": [[0, 17, "Actor"], [31, 53, "Resource"], [65, 80, "Resource"], [82, 90, "Resource"], [96, 105, "Resource"]]}
{"id": 304, "text": "The Clarus system shall acquire and disseminate National Weather Service (NWS) watches, warnings, and advisories.", "labels": [[0, 17, "Actor"], [48, 112, "Resource"]]}
{"id": 305, "text": "The Clarus system shall be able to retrieve environmental data directly from environmental sensor stations.", "labels": [[0, 17, "Actor"], [44, 106, "Resource"]]}
{"id": 306, "text": "The Clarus system shall minimize the time for data acquisition.", "labels": [[0, 17, "Actor"], [46, 62, "Resource"]]}
{"id": 307, "text": "The Clarus system shall process data as they are received.", "labels": [[0, 17, "Actor"], [32, 36, "Resource"]]}
{"id": 308, "text": "The Clarus system shall collect pavement-related observations.", "labels": [[0, 17, "Actor"], [32, 61, "Resource"]]}
{"id": 309, "text": "The Clarus system shall accept environmental data from railway systems or in situ ESS along tracks.", "labels": [[0, 17, "Actor"], [31, 98, "Resource"], [55, 70, "Actor"], [77, 98, "Actor"]]}
{"id": 310, "text": "The Clarus system shall accept environmental data from railroad vehicles.", "labels": [[0, 17, "Actor"], [31, 72, "Resource"], [55, 72, "Actor"]]}
{"id": 311, "text": "The Clarus system shall accept environmental data from (roadway) vehicles.", "labels": [[0, 17, "Actor"], [31, 73, "Resource"], [65, 73, "Actor"]]}
{"id": 312, "text": "The Clarus system shall accept environmental data from maintenance and construction vehicles.", "labels": [[0, 17, "Actor"], [31, 92, "Resource"], [55, 92, "Actor"]]}
{"id": 313, "text": "The Clarus system shall accept environmental data from service patrol vehicles.", "labels": [[0, 17, "Actor"], [31, 78, "Resource"], [55, 78, "Actor"]]}
{"id": 314, "text": "The Clarus system shall accept environmental data from transit vehicles.", "labels": [[0, 17, "Actor"], [31, 71, "Resource"], [55, 71, "Actor"]]}
{"id": 315, "text": "The Clarus system shall accept environmental data from emergency vehicles.", "labels": [[0, 17, "Actor"], [31, 73, "Resource"], [55, 73, "Actor"]]}
{"id": 316, "text": "The Clarus system shall be able to receive weather data from weather service providers.", "labels": [[0, 17, "Actor"], [43, 86, "Resource"], [61, 86, "Actor"]]}
{"id": 317, "text": "The Clarus system shall implement continuous quality control processes.", "labels": [[0, 17, "Actor"], [34, 70, "Resource"]]}
{"id": 318, "text": "The Clarus system shall provide environmental data quality flags.", "labels": [[0, 17, "Actor"], [32, 64, "Resource"]]}
{"id": 319, "text": "The Clarus system shall provide notification of data quality conditions to data collectors.", "labels": [[0, 17, "Actor"], [32, 71, "Resource"], [75, 90, "Actor"]]}
{"id": 320, "text": "The Clarus system shall detect out of range values.", "labels": [[0, 17, "Actor"], [31, 50, "Resource"]]}
{"id": 321, "text": "The Clarus system shall not modify original observations.", "labels": [[0, 17, "Actor"], [35, 56, "Resource"]]}
{"id": 322, "text": "The Clarus system shall apply appropriate quality checks based on the completeness of received sensor station metadata.", "labels": [[0, 17, "Actor"], [30, 56, "Resource"], [95, 118, "Resource"]]}
{"id": 323, "text": "The Clarus system shall allow human intervention to override automatically applied quality assessment.", "labels": [[0, 17, "Actor"], [30, 48, "Resource"], [61, 101, "Resource"]]}
{"id": 324, "text": "The Clarus system shall record the methods applied when deriving quality control information.", "labels": [[0, 17, "Actor"], [31, 50, "Resource"], [65, 92, "Resource"]]}
{"id": 325, "text": "The Clarus system shall be able to implement quality control rules for each environmental parameter.", "labels": [[0, 17, "Actor"], [45, 99, "Resource"]]}
{"id": 326, "text": "The Clarus system shall be able to implement quality control rules for specific environmental situations.", "labels": [[0, 17, "Actor"], [45, 104, "Resource"]]}
{"id": 327, "text": "The Clarus system shall be able to implement quality control rules specific to observation locations.", "labels": [[0, 17, "Actor"], [45, 100, "Resource"]]}
{"id": 328, "text": "The Clarus system shall be able to base its quality control process on values from multiple observations.", "labels": [[0, 17, "Actor"], [40, 67, "Resource"], [83, 104, "Resource"]]}
{"id": 329, "text": "The Clarus system shall be able to base its quality control process on historical environmental data.", "labels": [[0, 17, "Actor"], [40, 68, "Resource"], [71, 100, "Resource"]]}
{"id": 330, "text": "The Clarus system shall be able to use multiple algorithms for its quality control process.", "labels": [[0, 17, "Actor"], [39, 58, "Resource"], [63, 90, "Resource"]]}
{"id": 331, "text": "The Clarus system shall be able to detect data submission errors.", "labels": [[0, 17, "Actor"], [42, 64, "Resource"]]}
{"id": 332, "text": "The Clarus system shall be able to provide sensor equipment data in response to a request.", "labels": [[0, 17, "Actor"], [43, 64, "Resource"], [80, 89, "Resource"]]}
{"id": 333, "text": "The Clarus system shall minimize the time for data dissemination.", "labels": [[0, 17, "Actor"], [33, 64, "Resource"]]}
{"id": 334, "text": "The Clarus system shall be able to disseminate data based on spatial queries.", "labels": [[0, 17, "Actor"], [47, 51, "Resource"], [61, 76, "Resource"]]}
{"id": 335, "text": "The Clarus system shall maintain a dynamic library of data for at least seven days.", "labels": [[0, 17, "Actor"], [33, 58, "Resource"]]}
{"id": 336, "text": "The Clarus program shall alert users to system modifications.", "labels": [[0, 18, "Actor"], [31, 36, "Actor"], [40, 60, "Resource"]]}
{"id": 337, "text": "The Clarus system shall not require approval to request environmental data.", "labels": [[0, 17, "Actor"], [36, 44, "Resource"], [56, 74, "Resource"]]}
{"id": 338, "text": "The Clarus system shall enable system administrators to manage security groups.", "labels": [[0, 17, "Actor"], [31, 52, "Actor"], [63, 78, "Resource"]]}
{"id": 339, "text": "The Clarus system shall be able to restrict environmental data publication based on source.", "labels": [[0, 17, "Actor"], [44, 74, "Resource"], [84, 90, "Resource"]]}
{"id": 340, "text": "The Clarus system shall record statistics about its operation.", "labels": [[0, 17, "Actor"], [31, 61, "Resource"]]}
{"id": 341, "text": "The Clarus system shall log data transactions.", "labels": [[0, 17, "Actor"], [28, 45, "Resource"]]}
{"id": 342, "text": "The Clarus system baseline data types shall be defined by the NTCIP ESS 1204 standard for data collection.", "labels": [[0, 37, "Actor"], [27, 37, "Resource"], [58, 85, "Resource"], [90, 105, "Resource"]]}
{"id": 343, "text": "The Clarus system data definitions shall be consistent with the ITE TM 1.03 standard, Functional Level Traffic Management Data Dictionary (TMDD).", "labels": [[0, 34, "Actor"], [18, 34, "Resource"], [60, 84, "Resource"], [86, 144, "Resource"]]}
{"id": 344, "text": "The Clarus system shall acquire, process, and disseminate atmospheric data.", "labels": [[0, 17, "Actor"], [58, 74, "Resource"]]}
{"id": 345, "text": "The Clarus system shall acquire, process, and disseminate surface data.", "labels": [[0, 17, "Actor"], [58, 70, "Resource"]]}
{"id": 346, "text": "The Clarus system shall acquire, process, and disseminate hydrologic data.", "labels": [[0, 17, "Actor"], [58, 73, "Resource"]]}
{"id": 347, "text": "The Clarus system shall acquire, process, and disseminate atmospheric metadata.", "labels": [[0, 17, "Actor"], [58, 78, "Resource"]]}
{"id": 348, "text": "The Clarus system shall acquire, process, and disseminate surface metadata.", "labels": [[0, 17, "Actor"], [58, 74, "Resource"]]}
{"id": 349, "text": "The Clarus system shall acquire, process, and disseminate hydrologic metadata.", "labels": [[0, 17, "Actor"], [58, 77, "Resource"]]}
{"id": 350, "text": "The Clarus system shall accept only observations that include location, timeframe, and source metadata.", "labels": [[0, 17, "Actor"], [36, 102, "Resource"]]}
{"id": 351, "text": "The Clarus system shall accept only observations of known measurement types and units.", "labels": [[0, 17, "Actor"], [36, 85, "Resource"]]}
{"id": 352, "text": "The Clarus system shall acquire, process, and disseminate environmental sensor station metadata.", "labels": [[0, 17, "Actor"], [58, 95, "Resource"]]}
{"id": 353, "text": "The Clarus system shall be able to acquire, process, and disseminate environmental data from across North America.", "labels": [[0, 17, "Actor"], [69, 113, "Resource"]]}
{"id": 354, "text": "The Clarus system shall accept data through a Clarus standard interface.", "labels": [[0, 17, "Actor"], [31, 35, "Resource"], [44, 71, "Resource"], [44, 71, "Actor"]]}
{"id": 355, "text": "The Clarus system shall be able to communicate with environmental sensor stations using the NTCIP ESS 1204 standard for data collection.", "labels": [[0, 17, "Actor"], [51, 81, "Resource"], [88, 115, "Resource"], [120, 135, "Resource"]]}
{"id": 356, "text": "The Clarus system shall be able to communicate with RWIS databases through their native interfaces.", "labels": [[0, 17, "Actor"], [52, 66, "Resource"], [52, 66, "Actor"], [75, 98, "Resource"], [75, 98, "Actor"]]}
{"id": 357, "text": "The Clarus system shall be able to communicate with an individual ESS through its native interface.", "labels": [[0, 17, "Actor"], [52, 69, "Resource"], [52, 69, "Actor"], [78, 98, "Resource"], [78, 98, "Actor"]]}
{"id": 358, "text": "The Clarus system shall be able to collect environmental data that are manually entered.", "labels": [[0, 17, "Actor"], [43, 87, "Resource"]]}
{"id": 359, "text": "The Clarus system shall transfer data as efficiently as possible.", "labels": [[0, 17, "Actor"], [33, 37, "Resource"]]}
{"id": 360, "text": "The Clarus system shall employ industry standards to minimize implementation impact to users and providers.", "labels": [[0, 17, "Actor"], [31, 49, "Resource"], [62, 106, "Resource"], [87, 92, "Actor"], [97, 106, "Actor"]]}
{"id": 361, "text": "The Clarus system shall allow service providers to select specific desired data sets.", "labels": [[0, 17, "Actor"], [30, 47, "Actor"], [58, 84, "Resource"]]}
{"id": 362, "text": "The Clarus system shall respond to queries for environmental data from the available data.", "labels": [[0, 17, "Actor"], [35, 65, "Resource"], [71, 89, "Resource"]]}
{"id": 363, "text": "The Clarus system shall enable environmental data queries by timestamp.", "labels": [[0, 17, "Actor"], [31, 70, "Resource"]]}
{"id": 364, "text": "The Clarus system shall enable environmental data queries by location reference.", "labels": [[0, 17, "Actor"], [31, 79, "Resource"]]}
{"id": 365, "text": "The Clarus system shall enable environmental data queries by quality.", "labels": [[0, 17, "Actor"], [31, 68, "Resource"]]}
{"id": 366, "text": "The Clarus system shall enable environmental data queries by source.", "labels": [[0, 17, "Actor"], [31, 67, "Resource"]]}
{"id": 367, "text": "The Clarus system shall provide a user interface for system administration.", "labels": [[0, 17, "Actor"], [32, 48, "Resource"], [53, 74, "Actor"]]}
{"id": 368, "text": "The Clarus system shall manage system user privileges according to the Clarus data sharing agreements.", "labels": [[0, 17, "Actor"], [31, 53, "Resource"], [67, 101, "Resource"]]}
{"id": 369, "text": "The Clarus system shall allow users to create a data subscription request.", "labels": [[0, 17, "Actor"], [30, 35, "Actor"], [46, 73, "Resource"]]}
{"id": 370, "text": "The Clarus system shall be able to be hosted at one or more physical locations.", "labels": [[0, 17, "Actor"], [48, 78, "Resource"]]}
{"id": 371, "text": "The Clarus system shall use hardware that implements industry accepted standard interfaces.", "labels": [[0, 17, "Actor"], [28, 90, "Resource"]]}
{"id": 372, "text": "The Clarus system shall use software that implements industry accepted standard interfaces.", "labels": [[0, 17, "Actor"], [28, 90, "Resource"]]}
{"id": 373, "text": "The Clarus system shall be able to operate on redundant hardware.", "labels": [[0, 17, "Actor"], [46, 64, "Resource"], [46, 64, "Actor"]]}
{"id": 374, "text": "The Clarus system shall disseminate data in response to a scheduled request.", "labels": [[0, 17, "Actor"], [36, 40, "Resource"], [56, 75, "Resource"]]}
{"id": 375, "text": "The Clarus system shall disseminate data in response to polling.", "labels": [[0, 17, "Actor"], [36, 40, "Resource"]]}
{"id": 376, "text": "The Clarus system shall disseminate data in response to a change notification request.", "labels": [[0, 17, "Actor"], [36, 40, "Resource"], [56, 85, "Resource"]]}
{"id": 377, "text": "The Clarus system shall be able to notify subscribers when data sets become available.", "labels": [[0, 17, "Actor"], [42, 53, "Actor"], [59, 68, "Resource"]]}
{"id": 378, "text": "The Clarus system shall disseminate data using standard Internet protocols.", "labels": [[0, 17, "Actor"], [36, 40, "Resource"], [47, 74, "Resource"]]}
{"id": 379, "text": "The Clarus system shall be able to publish environmental data at three times the volume rate that it collects it.", "labels": [[0, 17, "Actor"], [43, 61, "Resource"], [77, 92, "Resource"]]}
{"id": 380, "text": "The Clarus system shall be able to prioritize data handling for time-critical data.", "labels": [[0, 17, "Actor"], [46, 59, "Resource"], [64, 82, "Resource"]]}
{"id": 381, "text": "The Clarus system shall support 470 million current observations.", "labels": [[0, 17, "Actor"], [32, 64, "Resource"]]}
{"id": 382, "text": "The Clarus system shall be able to collect data from sources within 5 minutes of them becoming available.", "labels": [[0, 17, "Actor"], [43, 47, "Resource"], [53, 60, "Resource"]]}
{"id": 383, "text": "The Clarus system shall be able to receive all reported environmental data during a fifteen minute time interval.", "labels": [[0, 17, "Actor"], [43, 74, "Resource"]]}
{"id": 384, "text": "The Clarus system shall be able to complete an automated quality control check of environmental data within ten seconds of data receipt.", "labels": [[0, 17, "Actor"], [44, 100, "Resource"], [123, 135, "Resource"]]}
{"id": 385, "text": "The Clarus system shall be able to publish new data within twenty minutes of data receipt.", "labels": [[0, 17, "Actor"], [43, 51, "Resource"], [77, 89, "Resource"]]}
{"id": 386, "text": "The Clarus system shall respond to a request for information within one minute.", "labels": [[0, 17, "Actor"], [35, 60, "Resource"]]}
{"id": 387, "text": "The Clarus system shall be able to handle three hundred simultaneous requests for environmental element data.", "labels": [[0, 17, "Actor"], [42, 77, "Resource"], [82, 108, "Resource"]]}
{"id": 388, "text": "The Clarus system shall be able to support six hundred concurrent users.", "labels": [[0, 17, "Actor"], [43, 71, "Resource"]]}
{"id": 389, "text": "The Clarus system shall be able to support six thousand registered users.", "labels": [[0, 17, "Actor"], [43, 72, "Resource"]]}
{"id": 390, "text": "The Clarus system shall accept data only from approved sources.", "labels": [[0, 17, "Actor"], [31, 35, "Resource"], [46, 62, "Resource"]]}
{"id": 391, "text": "The Clarus program shall establish data sharing agreements with all participating sources of environmental data.", "labels": [[0, 18, "Actor"], [35, 58, "Resource"], [64, 111, "Resource"]]}
{"id": 392, "text": "The Clarus program shall maintain continuous 24x7 operations.", "labels": [[0, 18, "Actor"], [34, 60, "Resource"]]}
{"id": 393, "text": "The Clarus program shall provide an environment that has uninterruptible power for the Clarus system.", "labels": [[0, 18, "Actor"], [33, 78, "Resource"], [83, 100, "Actor"]]}
{"id": 394, "text": "The Clarus program shall provide an environment that has redundant communication for the Clarus system.", "labels": [[0, 18, "Actor"], [33, 80, "Resource"], [85, 102, "Actor"]]}
{"id": 395, "text": "The Clarus program shall provide network management tools.", "labels": [[0, 18, "Actor"], [33, 57, "Resource"]]}
{"id": 396, "text": "The Clarus program shall provide setup support.", "labels": [[0, 18, "Actor"], [33, 46, "Resource"]]}
{"id": 397, "text": "The Clarus program shall provide for customer service.", "labels": [[0, 18, "Actor"], [37, 53, "Resource"]]}
{"id": 398, "text": "The Clarus program shall provide a trained support staff.", "labels": [[0, 18, "Actor"], [33, 56, "Resource"]]}
{"id": 399, "text": "The Clarus program shall define data quality assurance methods and criteria.", "labels": [[0, 18, "Actor"], [32, 75, "Resource"]]}
{"id": 400, "text": "The Clarus program shall define quality control rules for environmental observations.", "labels": [[0, 18, "Actor"], [32, 84, "Resource"]]}
{"id": 401, "text": "The Clarus program shall define data retention standards.", "labels": [[0, 18, "Actor"], [32, 56, "Resource"]]}
{"id": 402, "text": "The Clarus program shall provide documentation of Clarus standards.", "labels": [[0, 18, "Actor"], [33, 66, "Resource"]]}
{"id": 403, "text": "The Clarus program standards shall accommodate contributions of new sensor technologies to the Clarus system.", "labels": [[0, 28, "Actor"], [47, 87, "Resource"], [91, 108, "Actor"]]}
{"id": 404, "text": "The Clarus program standards shall support multiple methods of data delivery to users.", "labels": [[0, 28, "Actor"], [43, 76, "Resource"], [80, 85, "Actor"]]}
{"id": 405, "text": "The Clarus program shall maintain a comprehensive Clarus system test environment.", "labels": [[0, 18, "Actor"], [34, 80, "Resource"]]}
{"id": 406, "text": "We want to give the user the ability to visualise and investigate their data in a three dimensional environment.", "labels": [[16, 24, "Actor"], [66, 111, "Resource"]]}
{"id": 407, "text": "The user should have the ability to see (at a glance) the differences of various selected attributes of their data.", "labels": [[0, 8, "Actor"], [54, 114, "Resource"]]}
{"id": 408, "text": "The product should allow multiple points to clicked so that multiple names can be displayed.", "labels": [[0, 11, "Actor"], [25, 40, "Resource"], [60, 74, "Resource"]]}
{"id": 409, "text": "The product should allow the grid to be oriented by the user. Rotation, zoom and move functions should be employed.", "labels": [[0, 11, "Actor"], [25, 33, "Resource"], [52, 60, "Actor"], [62, 95, "Resource"]]}
{"id": 410, "text": "The application should be coloured so that the screen shots can be printed out clearly (i.e., black on white background).", "labels": [[0, 15, "Actor"], [43, 59, "Resource"], [94, 119, "Resource"]]}
{"id": 411, "text": "The application should be intuitive and not require any specialist training.", "labels": [[0, 15, "Actor"], [52, 75, "Resource"]]}
{"id": 412, "text": "The VMU will create the vouchers and sell it to clients through distributors.", "labels": [[0, 7, "Actor"], [20, 32, "Resource"], [48, 55, "Actor"], [64, 76, "Actor"]]}
{"id": 413, "text": "The distributor will submit the sales details back to the VMU.", "labels": [[0, 15, "Actor"], [28, 45, "Resource"], [54, 61, "Actor"]]}
{"id": 414, "text": "Each voucher should have two portions with three tear off voucher slips each for Client and Partner.", "labels": [[0, 12, "Actor"], [25, 71, "Resource"], [81, 87, "Actor"], [92, 99, "Actor"]]}
{"id": 415, "text": "The client and/or the partner will choose the service provider and will get treatment.", "labels": [[0, 29, "Actor"], [42, 62, "Resource"], [42, 62, "Actor"], [76, 85, "Resource"]]}
{"id": 416, "text": "First visit is called as Consultation and if the patient is not cured then they can go for first follow up and second follow up,", "labels": [[25, 37, "Resource"], [45, 56, "Actor"]]}
{"id": 417, "text": "Each visit details (including Diagnosis, Lab Test and Drugs) of the patient is called a claim,", "labels": [[11, 18, "Resource"], [30, 39, "Resource"], [41, 59, "Resource"], [64, 75, "Actor"], [88, 93, "Resource"]]}
{"id": 418, "text": "The VSP will submit the claim to VMIU field office to enter those into the database", "labels": [[0, 7, "Actor"], [20, 29, "Resource"], [33, 50, "Actor"], [71, 83, "Resource"]]}
{"id": 419, "text": "The filed office will validate the claim form manually and through system,", "labels": [[0, 16, "Actor"], [31, 40, "Resource"], [67, 73, "Actor"]]}
{"id": 420, "text": "If any of mandatory information is missed or any false information is existing then the field office will reject the claim back to VSP and the system will keep those claim in a quarantine area.", "labels": [[3, 31, "Resource"], [49, 66, "Resource"], [84, 100, "Actor"], [131, 134, "Actor"], [139, 149, "Actor"], [175, 192, "Resource"]]}
{"id": 421, "text": "The quarantined forms will be sent back to the VSP for verification, if the VSP returns the claim with satisfactory details, the claims will be entered on to the system, in the following month’s batch.", "labels": [[0, 21, "Resource"], [43, 50, "Actor"], [72, 79, "Actor"], [88, 123, "Resource"], [125, 135, "Actor"], [158, 168, "Actor"]]}
{"id": 422, "text": "Based on the payment terms agreed by VSP, the field office will generate BiMonth or Monthly financial and medical report and send it to MSIU Admin team to arrange the payments for the VSP.", "labels": [[9, 40, "Resource"], [37, 40, "Actor"], [42, 58, "Actor"], [73, 120, "Resource"], [136, 151, "Actor"], [163, 175, "Resource"], [180, 187, "Actor"]]}
{"id": 423, "text": "To understand the satisfaction of client the MSIU Admin team will get client feedback from some of the clients and send those documents to field office to enter those into database.", "labels": [[41, 60, "Actor"], [70, 85, "Resource"], [91, 110, "Actor"], [120, 135, "Resource"], [139, 151, "Actor"], [172, 180, "Resource"]]}
{"id": 424, "text": "The teachers and assistants shall only be allowed to enter or edit child comments and child arrival or departure times.", "labels": [[0, 12, "Actor"], [17, 27, "Actor"], [67, 81, "Resource"], [86, 118, "Resource"]]}
{"id": 425, "text": "The administrators shall be allowed to enter or edit all data.", "labels": [[0, 18, "Actor"], [53, 61, "Resource"]]}
{"id": 426, "text": "Only the administrators shall be allowed to view or print reports.", "labels": [[5, 23, "Actor"], [58, 65, "Resource"]]}
{"id": 427, "text": "Only the administrators shall be allowed to view or print invoices.", "labels": [[5, 23, "Actor"], [58, 66, "Resource"]]}
{"id": 428, "text": "All employees shall be allowed to use the Daily Reminders.", "labels": [[4, 13, "Actor"], [38, 57, "Resource"]]}
{"id": 429, "text": "Users shall only be allowed to set daily reminders for themselves.", "labels": [[0, 5, "Actor"], [35, 50, "Resource"]]}
{"id": 430, "text": "When the user logs onto the system on the date of their reminder, they shall receive a popup window displaying their reminder message.", "labels": [[5, 13, "Actor"], [24, 34, "Actor"], [38, 64, "Resource"], [85, 133, "Resource"]]}
{"id": 431, "text": "Systems supporting OM must have the capability to capture demographic data about persons involved in an OM investigation.", "labels": [[0, 21, "Actor"], [58, 120, "Resource"]]}
{"id": 432, "text": "Systems supporting OM should be able to provide the aggregate data necessary for health event monitoring to systems that support response tracking", "labels": [[0, 21, "Actor"], [48, 146, "Resource"], [108, 146, "Actor"]]}
{"id": 433, "text": "Systems supporting OM must be able to exchange aggregated data.", "labels": [[0, 21, "Actor"], [47, 62, "Resource"]]}
{"id": 434, "text": "Systems supporting OM must be able to create and send messages for laboratory test requests.", "labels": [[0, 21, "Actor"], [54, 91, "Resource"]]}
{"id": 435, "text": "Systems supporting OM should have the ability to produce individual reports for each emergency team member or investigator.", "labels": [[0, 21, "Actor"], [57, 75, "Resource"], [80, 122, "Actor"]]}
{"id": 436, "text": "Systems supporting OM should have the ability to compare characteristics of exposed and non-exposed (i.e., controls) persons.", "labels": [[0, 21, "Actor"], [57, 124, "Resource"]]}
{"id": 437, "text": "Systems supporting OM should have the ability to produce lists of action items (e.g., to do lists).", "labels": [[0, 21, "Actor"], [57, 78, "Resource"], [86, 97, "Resource"]]}
{"id": 438, "text": "Systems supporting OM must have the ability to print questionnaires for multiple uses, including taking to the field, use during phone interviews, etc.", "labels": [[0, 21, "Actor"], [53, 85, "Resource"]]}
{"id": 439, "text": "Systems supporting OM must be able to aggregate data. Examples of aggregated data to be supported are: number of cases, number of contacts per case, and number of vaccinations and/or treatments administered.", "labels": [[0, 21, "Actor"], [38, 52, "Resource"], [54, 81, "Resource"], [103, 118, "Resource"], [120, 147, "Resource"], [153, 175, "Resource"], [183, 206, "Resource"]]}
{"id": 440, "text": "Systems supporting OM must provide the ability to control the configuration of and revisions to investigation-specific questionnaires.", "labels": [[0, 21, "Actor"], [58, 75, "Resource"], [83, 133, "Resource"]]}
{"id": 441, "text": "Systems supporting OM must provide the ability to publish investigationspecific questionnaires and implementation guides.", "labels": [[0, 21, "Actor"], [57, 94, "Resource"], [99, 120, "Resource"]]}
{"id": 442, "text": "Case investigation should be supported by reusable questionnaire libraries that use common terminology (where available) to maximize the efficiency of data exchange.", "labels": [[0, 18, "Actor"], [0, 18, "Resource"], [42, 74, "Resource"], [42, 74, "Actor"], [84, 102, "Resource"], [133, 164, "Resource"]]}
{"id": 443, "text": "Systems supporting OM should provide a manual or automatic means of updating the status of case records as the case definition changes.", "labels": [[0, 21, "Actor"], [37, 103, "Resource"]]}
{"id": 444, "text": "Systems supporting OM should track the changes made to the status of case records as a result of changes in the case definition.", "labels": [[0, 21, "Actor"], [35, 81, "Resource"]]}
{"id": 445, "text": "The user shall be able to view the data stored in the Physical Inventory tables through the Pontis graphical user interface (GUI).", "labels": [[0, 8, "Actor"], [31, 79, "Resource"], [88, 123, "Actor"], [88, 129, "Resource"]]}
{"id": 446, "text": "The user shall be able to switch between predefined structure lists.", "labels": [[0, 8, "Actor"], [41, 67, "Resource"]]}
{"id": 447, "text": "The user shall be able to view the data stored in the Project Planning tables through the GUI.", "labels": [[0, 8, "Actor"], [31, 39, "Resource"], [50, 77, "Resource"], [86, 93, "Actor"], [86, 93, "Resource"]]}
{"id": 448, "text": "The user shall be able to switch between predefined project lists.", "labels": [[0, 8, "Actor"], [41, 65, "Resource"]]}
{"id": 449, "text": "The user shall be able to filter and select projects by structure ID, project ID, program, action type, project status, review status, treatment, program year, and project end date.", "labels": [[0, 8, "Actor"], [44, 52, "Resource"], [56, 68, "Resource"], [70, 80, "Resource"], [82, 89, "Resource"], [91, 102, "Resource"], [104, 118, "Resource"], [120, 133, "Resource"], [135, 144, "Resource"], [146, 158, "Resource"], [164, 180, "Resource"]]}
{"id": 450, "text": "The user shall be able to find projects by project ID, project name, project status, structure ID, and program.", "labels": [[0, 8, "Actor"], [31, 39, "Resource"], [43, 53, "Resource"], [55, 67, "Resource"], [69, 83, "Resource"], [85, 97, "Resource"], [103, 110, "Resource"]]}
{"id": 451, "text": "The user shall be able to create a new inspection.", "labels": [[0, 8, "Actor"], [33, 49, "Resource"]]}
{"id": 452, "text": "The user shall be able to create a new inspection by copying a previous inspection.", "labels": [[0, 8, "Actor"], [33, 49, "Resource"], [61, 82, "Resource"]]}
{"id": 453, "text": "The system shall be capable of creating cost and deterioration elicitation records for Pontis users.", "labels": [[0, 10, "Actor"], [40, 82, "Resource"], [87, 99, "Actor"]]}
{"id": 454, "text": "The system shall be capable of updating the transition probabilities for preservation actions based on expert elicitations.", "labels": [[0, 10, "Actor"], [40, 93, "Resource"], [103, 122, "Resource"]]}
{"id": 455, "text": "The system shall be capable of updating preservation action costs based on expert elicitations.", "labels": [[0, 10, "Actor"], [40, 65, "Resource"], [75, 94, "Resource"]]}
{"id": 456, "text": "The system shall be capable of updating transition probabilities for donothing actions based on historical inspection data.", "labels": [[0, 10, "Actor"], [40, 86, "Resource"], [96, 122, "Resource"]]}
{"id": 457, "text": "The user shall be able to create new programs by manually entering program information.", "labels": [[0, 8, "Actor"], [33, 45, "Resource"], [67, 86, "Resource"]]}
{"id": 458, "text": "The user shall be able to edit or delete existing programs.", "labels": [[0, 8, "Actor"], [41, 58, "Resource"]]}
{"id": 459, "text": "The user shall be able to create new projects by manually entering the project information.", "labels": [[0, 8, "Actor"], [33, 45, "Resource"], [67, 90, "Resource"]]}
{"id": 460, "text": "The user shall be able to edit or delete existing projects.", "labels": [[0, 8, "Actor"], [41, 58, "Resource"]]}
{"id": 461, "text": "The user shall be able assign Pontis-generated work recommendations, inspector work candidates, and user-specified work items to a project, or remove work items from a project.", "labels": [[0, 8, "Actor"], [30, 67, "Resource"], [79, 94, "Resource"], [100, 125, "Resource"], [129, 138, "Resource"], [150, 160, "Resource"], [166, 175, "Resource"]]}
{"id": 462, "text": "The user shall be able to split a project into multiple projects and combine multiple projects into a master project.", "labels": [[0, 8, "Actor"], [32, 41, "Resource"], [47, 64, "Resource"], [77, 94, "Resource"], [100, 116, "Resource"]]}
{"id": 463, "text": "The administrator shall be able to create and edit new application roles.", "labels": [[0, 17, "Actor"], [51, 72, "Resource"]]}
{"id": 464, "text": "The administrator shall be able to assign users to application roles.", "labels": [[0, 17, "Actor"], [42, 47, "Actor"], [51, 68, "Resource"]]}
{"id": 465, "text": "The system shall provide user interface for managing application roles.", "labels": [[0, 10, "Actor"], [25, 39, "Resource"], [53, 70, "Resource"]]}
{"id": 466, "text": "The administrator shall be able to assign application permissions to each user roles.", "labels": [[0, 17, "Actor"], [42, 65, "Resource"], [69, 84, "Resource"]]}
{"id": 467, "text": "The administrator shall be able to add new users to the system.", "labels": [[0, 17, "Actor"], [39, 48, "Resource"], [52, 62, "Actor"]]}
{"id": 468, "text": "The user shall be able to modify his or her basic account profile.", "labels": [[0, 8, "Actor"], [33, 65, "Resource"]]}
{"id": 469, "text": "The administrator shall be able to create bridge-level access filters.", "labels": [[0, 17, "Actor"], [42, 69, "Resource"]]}
{"id": 470, "text": "The administrator shall be able to assign bridge-level filters for each user.", "labels": [[0, 17, "Actor"], [42, 62, "Resource"], [67, 76, "Actor"]]}
{"id": 471, "text": "The administrator shall be able to remove users from the system or disable access as appropriate.", "labels": [[0, 17, "Actor"], [53, 63, "Actor"], [75, 81, "Resource"]]}
{"id": 472, "text": "The system shall be capable of validating user name and password during log-in process.", "labels": [[0, 10, "Actor"], [42, 51, "Resource"], [56, 64, "Resource"], [72, 86, "Resource"]]}
{"id": 473, "text": "The system shall be capable of authorizing access to Pontis functionalities depending on the user’s privileges during log-in process.", "labels": [[0, 10, "Actor"], [53, 75, "Resource"], [89, 110, "Resource"], [118, 132, "Resource"]]}
{"id": 474, "text": "The system shall be capable of tracking login and logout activity.", "labels": [[0, 10, "Actor"], [40, 65, "Resource"]]}
{"id": 475, "text": "The system shall be capable of running concurrent sessions for a user.", "labels": [[0, 10, "Actor"], [39, 58, "Resource"], [63, 69, "Actor"]]}
{"id": 476, "text": "The System requires the user to select the nature of a player in the current game.", "labels": [[0, 10, "Actor"], [20, 28, "Actor"], [39, 61, "Resource"], [65, 81, "Resource"]]}
{"id": 477, "text": "The system must have the capability to save the current state of the game being played.", "labels": [[0, 10, "Actor"], [44, 73, "Resource"]]}
{"id": 478, "text": "The user locates a solution to a problem with the help function.", "labels": [[0, 8, "Actor"], [17, 40, "Resource"], [46, 63, "Actor"], [46, 63, "Resource"]]}
{"id": 479, "text": "The system has an embedded help file that contains basic solutions and hints for problematic situations", "labels": [[0, 10, "Actor"], [15, 36, "Resource"], [51, 103, "Resource"]]}
{"id": 480, "text": "Provide a centralized archive for user’s information.", "labels": [[8, 29, "Resource"], [34, 52, "Resource"]]}
{"id": 481, "text": "Provide hierarchical model for managing the archived information.", "labels": [[40, 64, "Resource"]]}
{"id": 482, "text": "Allow the user to add, remove, modify or back up (to removable storage devices) arbitrary pieces of information without disrupting the hierarchy.", "labels": [[6, 14, "Actor"], [80, 111, "Resource"], [131, 144, "Resource"]]}
{"id": 483, "text": "Assist the user in building up his information hierarchy by automating such tasks as data capturing and categorizing.", "labels": [[7, 15, "Actor"], [31, 56, "Resource"], [71, 116, "Resource"]]}
{"id": 484, "text": "User SHOULD be able to modify, add, delete or group these Entities by navigating to a virtual folder (e.g. /People/).", "labels": [[0, 4, "Actor"], [52, 66, "Resource"], [84, 100, "Resource"]]}
{"id": 485, "text": "User SHOULD be able to specify when he is to start a research project; i.e. when the web sites he visits subsequently are to be permanently stored.", "labels": [[0, 4, "Actor"], [51, 69, "Resource"], [81, 94, "Resource"]]}
{"id": 486, "text": "All EIRENE mobile equipment shall comply with all environmental, EMC and physical specifications defined in the GSM standard", "labels": [[0, 27, "Resource"], [0, 27, "Actor"], [46, 63, "Resource"], [65, 124, "Resource"]]}
{"id": 487, "text": "The Operational radio user shall be protected against all electrical hazards arising from the mobile equipment", "labels": [[0, 26, "Actor"], [54, 110, "Resource"]]}
{"id": 488, "text": "System operator responsible for maintaining executable code, requiring full access to all aspects of the system.", "labels": [[0, 15, "Actor"], [44, 59, "Resource"], [71, 82, "Resource"], [86, 111, "Actor"]]}
{"id": 489, "text": "Data operations manager responsible for data archiving and maintenance, requiring read/write/modify privileges to all data in the system.", "labels": [[0, 23, "Actor"], [40, 70, "Resource"], [82, 110, "Resource"], [114, 136, "Resource"], [126, 136, "Actor"]]}
{"id": 490, "text": "Watershed uploaders have responsibility to upload local data requiring write access to space allocated to their specific watershed.", "labels": [[0, 19, "Actor"], [50, 60, "Resource"], [71, 102, "Resource"], [106, 130, "Resource"]]}
{"id": 491, "text": "Public users: Eventual release of the database system to the general public will add university and agency researchers who would appear similar in training to the primary users, but also would add clients with the entire range of training and interests.", "labels": [[0, 12, "Actor"], [14, 30, "Resource"], [85, 118, "Actor"], [159, 176, "Actor"], [214, 252, "Resource"]]}
{"id": 492, "text": "View entire universe of watersheds from top-level screen for selection", "labels": [[5, 70, "Resource"]]}
{"id": 493, "text": "View watershed descriptive data", "labels": [[5, 31, "Resource"]]}
{"id": 494, "text": "Browse, query, and download individual sampling station data and metadata", "labels": [[28, 73, "Resource"]]}
{"id": 495, "text": "Visualize time-series data", "labels": [[10, 26, "Resource"]]}
{"id": 496, "text": "Generate tabular reports of selected data", "labels": [[9, 24, "Resource"]]}
{"id": 497, "text": "Visualize, query, and download spatial data", "labels": [[31, 43, "Resource"]]}
{"id": 498, "text": "Browse, visualize, and download agricultural modeling data and results", "labels": [[32, 70, "Resource"]]}
{"id": 499, "text": "The data system shall show no visible deterioration in response time as the number of persons increases.", "labels": [[0, 15, "Actor"], [30, 68, "Resource"], [72, 93, "Resource"]]}
{"id": 500, "text": "The Data Management portion of the system shall permit user access from the corporate Intranet and, if a user is authorized for outside access through the corporate firewall, from an Internet connection at the user’s home.", "labels": [[0, 41, "Actor"], [55, 66, "Resource"], [72, 94, "Resource"], [103, 109, "Actor"], [128, 142, "Resource"], [151, 173, "Resource"], [180, 221, "Resource"]]}
{"id": 501, "text": "The Data Research and Reporting portion of the system shall provide public access to reviewed and approved data sets.", "labels": [[0, 53, "Actor"], [68, 81, "Resource"], [107, 116, "Resource"]]}
{"id": 502, "text": "The system shall display all the products that can be configured.", "labels": [[0, 10, "Actor"], [25, 64, "Resource"]]}
{"id": 503, "text": "The system shall allow user to select the product to configure.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 49, "Resource"]]}
{"id": 504, "text": "The system shall display all the available components of the product to configure", "labels": [[0, 10, "Actor"], [25, 68, "Resource"]]}
{"id": 505, "text": "The system shall enable user to add one or more component to the configuration.", "labels": [[0, 10, "Actor"], [24, 28, "Actor"], [36, 57, "Resource"], [61, 78, "Resource"]]}
{"id": 506, "text": "The system shall notify the user about any conflict in the current configuration.", "labels": [[0, 10, "Actor"], [24, 32, "Actor"], [39, 80, "Resource"]]}
{"id": 507, "text": "The system shall allow user to update the configuration to resolve conflict in the current configuration.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 55, "Resource"], [67, 104, "Resource"]]}
{"id": 508, "text": "The system shall allow user to confirm the completion of current configuration", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [39, 78, "Resource"]]}
{"id": 509, "text": "The system shall display detailed information of the selected products.", "labels": [[0, 10, "Actor"], [25, 70, "Resource"]]}
{"id": 510, "text": "The system shall provide browsing options to see product details.", "labels": [[0, 10, "Actor"], [25, 41, "Resource"], [49, 64, "Resource"]]}
{"id": 511, "text": "The system shall display detailed product categorization to the user.", "labels": [[0, 10, "Actor"], [25, 56, "Resource"], [60, 68, "Actor"]]}
{"id": 512, "text": "The system shall enable user to enter the search text on the screen.", "labels": [[0, 10, "Actor"], [24, 28, "Actor"], [38, 53, "Resource"], [57, 67, "Resource"]]}
{"id": 513, "text": "The system shall enable user to select multiple options on the screen to search.", "labels": [[0, 10, "Actor"], [24, 28, "Actor"], [39, 55, "Resource"], [59, 69, "Resource"]]}
{"id": 514, "text": "The system shall display all the matching products based on the search", "labels": [[0, 10, "Actor"], [25, 50, "Resource"], [60, 70, "Resource"]]}
{"id": 515, "text": "The system shall display only 10 matching result on the current screen.", "labels": [[0, 10, "Actor"], [30, 48, "Resource"], [52, 70, "Resource"]]}
{"id": 516, "text": "The system shall enable user to navigate between the search results.", "labels": [[0, 10, "Actor"], [24, 28, "Actor"], [49, 67, "Resource"]]}
{"id": 517, "text": "The system shall notify the user when no matching product is found on the search.", "labels": [[0, 10, "Actor"], [24, 32, "Actor"], [41, 57, "Resource"], [70, 80, "Resource"]]}
{"id": 518, "text": "The system shall allow user to create profile and set his credential.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 45, "Resource"], [54, 68, "Resource"]]}
{"id": 519, "text": "The system shall authenticate user credentials to view the profile.", "labels": [[0, 10, "Actor"], [30, 46, "Resource"], [55, 66, "Resource"]]}
{"id": 520, "text": "The system shall allow user to update the profile information.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 61, "Resource"]]}
{"id": 521, "text": "The system shall display both the active and completed order history in the customer profile.", "labels": [[0, 10, "Actor"], [30, 68, "Resource"], [72, 92, "Resource"]]}
{"id": 522, "text": "The system shall allow user to select the order from the order history.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 47, "Resource"], [53, 70, "Resource"]]}
{"id": 523, "text": "The system shall display the detailed information about the selected order.", "labels": [[0, 10, "Actor"], [25, 49, "Resource"], [56, 74, "Resource"]]}
{"id": 524, "text": "The system shall display the most frequently searched items by the user in the profile.", "labels": [[0, 10, "Actor"], [25, 59, "Resource"], [63, 71, "Actor"], [63, 86, "Resource"]]}
{"id": 525, "text": "The system shall allow user to register for newsletters and surveys in the profile.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [44, 67, "Resource"], [71, 82, "Resource"]]}
{"id": 526, "text": "The system shall provide online help, FAQ’s customer support, and sitemap options for customer support.", "labels": [[0, 10, "Actor"], [25, 36, "Resource"], [38, 60, "Resource"], [66, 81, "Resource"]]}
{"id": 527, "text": "The system shall allow user to select the support type he wants.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 63, "Resource"]]}
{"id": 528, "text": "The system shall allow user to enter the customer and product information for the support.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [37, 73, "Resource"]]}
{"id": 529, "text": "The system shall display the customer support contact numbers on the screen.", "labels": [[0, 10, "Actor"], [25, 61, "Resource"]]}
{"id": 530, "text": "The system shall allow user to enter the contact number for support personnel to call.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [37, 77, "Resource"]]}
{"id": 531, "text": "The system shall display the online help upon request.", "labels": [[0, 10, "Actor"], [25, 40, "Resource"], [46, 53, "Resource"]]}
{"id": 532, "text": "The system shall display the FAQ’s upon request.", "labels": [[0, 10, "Actor"], [25, 34, "Resource"], [40, 47, "Resource"]]}
{"id": 533, "text": "The system shall maintain customer email information as a required part of customer profile.", "labels": [[0, 10, "Actor"], [26, 52, "Resource"], [56, 91, "Resource"]]}
{"id": 534, "text": "The system shall send an order confirmation to the user through email.", "labels": [[0, 10, "Actor"], [22, 43, "Resource"], [47, 55, "Actor"], [64, 69, "Resource"]]}
{"id": 535, "text": "The system shall display detailed invoice for current order once it is confirmed.", "labels": [[0, 10, "Actor"], [25, 41, "Resource"], [46, 59, "Resource"]]}
{"id": 536, "text": "The system shall optionally allow user to print the invoice.", "labels": [[0, 10, "Actor"], [34, 38, "Actor"], [48, 59, "Resource"]]}
{"id": 537, "text": "The system shall provide shopping cart during online purchase.", "labels": [[0, 10, "Actor"], [25, 38, "Resource"], [46, 61, "Resource"]]}
{"id": 538, "text": "The system shall allow user to add/remove products in the shopping cart.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [42, 50, "Resource"], [54, 71, "Resource"]]}
{"id": 539, "text": "The system shall display different shipping options provided by shipping department.", "labels": [[0, 10, "Actor"], [25, 51, "Resource"], [64, 83, "Resource"]]}
{"id": 540, "text": "The system shall enable user to select the shipping method during payment process.", "labels": [[0, 10, "Actor"], [24, 28, "Actor"], [39, 58, "Resource"], [66, 81, "Resource"]]}
{"id": 541, "text": "The system shall display the shipping charges.", "labels": [[0, 10, "Actor"], [25, 45, "Resource"]]}
{"id": 542, "text": "The system shall display tentative duration for shipping.", "labels": [[0, 10, "Actor"], [25, 34, "Resource"], [48, 56, "Resource"]]}
{"id": 543, "text": "The system shall allow user to enter the order information for tracking.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [37, 58, "Resource"]]}
{"id": 544, "text": "The system shall display the current tracking information about the order.", "labels": [[0, 10, "Actor"], [25, 57, "Resource"], [64, 73, "Resource"]]}
{"id": 545, "text": "The system shall calculate tax for the order.", "labels": [[0, 10, "Actor"], [27, 30, "Resource"], [35, 44, "Resource"]]}
{"id": 546, "text": "The system shall display tax information for the order.", "labels": [[0, 10, "Actor"], [25, 40, "Resource"], [45, 54, "Resource"]]}
{"id": 547, "text": "The system shall display available payment methods for payment.", "labels": [[0, 10, "Actor"], [25, 50, "Resource"], [55, 62, "Resource"]]}
{"id": 548, "text": "The system shall allow user to select the payment method for order.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 56, "Resource"], [61, 66, "Resource"]]}
{"id": 549, "text": "The system shall display the orders that are eligible to change.", "labels": [[0, 10, "Actor"], [25, 63, "Resource"]]}
{"id": 550, "text": "The system shall allow user to select the order to be changed.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 61, "Resource"]]}
{"id": 551, "text": "The system shall allow user to cancel the order", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 47, "Resource"]]}
{"id": 552, "text": "The system shall allow user to change shipping, payment method.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 62, "Resource"]]}
{"id": 553, "text": "The system shall notify the user about any changes made to the order.", "labels": [[0, 10, "Actor"], [24, 32, "Actor"], [39, 68, "Resource"]]}
{"id": 554, "text": "The system shall display the reviews and ratings of each product, when it is selected.", "labels": [[0, 10, "Actor"], [25, 64, "Resource"]]}
{"id": 555, "text": "The system shall enable the user to enter their reviews and ratings.", "labels": [[0, 10, "Actor"], [24, 32, "Actor"], [42, 67, "Resource"]]}
{"id": 556, "text": "The system shall display all the available financing options.", "labels": [[0, 10, "Actor"], [25, 60, "Resource"]]}
{"id": 557, "text": "The system shall allow user to select the financing option.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 58, "Resource"]]}
{"id": 558, "text": "The system shall notify the use about the financing request.", "labels": [[0, 10, "Actor"], [24, 31, "Actor"], [38, 59, "Resource"]]}
{"id": 559, "text": "The system shall allow user to view detailed sitemap.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [36, 52, "Resource"]]}
{"id": 560, "text": "The system shall display all the available promotions to the user.", "labels": [[0, 10, "Actor"], [25, 53, "Resource"], [57, 65, "Actor"]]}
{"id": 561, "text": "The system shall allow user to select available promotion.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [38, 57, "Resource"]]}
{"id": 562, "text": "The system shall allow user to confirm the purchase.", "labels": [[0, 10, "Actor"], [23, 27, "Actor"], [39, 51, "Resource"]]}
{"id": 563, "text": "The system shall enable user to enter the payment information.", "labels": [[0, 10, "Actor"], [24, 28, "Actor"], [38, 61, "Resource"]]}
{"id": 564, "text": "The system shall provide a uniform look and feel between all the web pages.", "labels": [[0, 10, "Actor"], [25, 48, "Resource"], [57, 74, "Resource"]]}
{"id": 565, "text": "The system shall provide a digital image for each product in the product catalog.", "labels": [[0, 10, "Actor"], [25, 57, "Resource"], [61, 80, "Resource"]]}
{"id": 566, "text": "The system shall provide use of icons and toolbars.", "labels": [[0, 10, "Actor"], [25, 50, "Resource"]]}
{"id": 567, "text": "The system shall provide handicap access.", "labels": [[0, 10, "Actor"], [25, 40, "Resource"]]}
{"id": 568, "text": "The system shall provide multi language support.", "labels": [[0, 10, "Actor"], [25, 47, "Resource"]]}
{"id": 569, "text": "The system shall provide storage of all databases on redundant computers with automatic switchover.", "labels": [[0, 10, "Actor"], [25, 98, "Resource"]]}
{"id": 570, "text": "The system shall provide for replication of databases to off-site storage locations.", "labels": [[0, 10, "Actor"], [29, 83, "Resource"]]}
{"id": 571, "text": "The system shall provide RAID V Disk Stripping on all database storage disks.", "labels": [[0, 10, "Actor"], [25, 46, "Resource"], [50, 76, "Resource"]]}
{"id": 572, "text": "The system shall provide a contractual agreement with an internet service provider for T3 access with 99.9999% availability.", "labels": [[0, 10, "Actor"], [25, 48, "Resource"], [54, 96, "Resource"]]}
{"id": 573, "text": "The system shall provide a contractual agreement with an internet service provider who can provide 99.999% availability through their network facilities onto the internet.", "labels": [[0, 10, "Actor"], [25, 48, "Resource"], [54, 82, "Actor"], [54, 119, "Resource"], [128, 152, "Resource"], [158, 170, "Resource"]]}
{"id": 574, "text": "The product shall be based on web and has to be run from a web server.", "labels": [[0, 11, "Actor"], [30, 33, "Resource"], [57, 69, "Resource"], [57, 69, "Actor"]]}
{"id": 575, "text": "The product shall take initial load time depending on internet connection strength which also depends on the media from which the product is run.", "labels": [[0, 11, "Actor"], [24, 40, "Resource"], [54, 82, "Resource"], [105, 114, "Resource"]]}
{"id": 576, "text": "The performance shall depend upon hardware components of the client/customer.", "labels": [[0, 15, "Actor"], [34, 76, "Resource"], [34, 76, "Actor"]]}
{"id": 577, "text": "The system shall use secure sockets in all transactions that include any confidential customer information.", "labels": [[0, 10, "Actor"], [21, 35, "Resource"], [39, 55, "Resource"], [69, 106, "Resource"]]}
{"id": 578, "text": "The system shall automatically log out all customers after a period of inactivity.", "labels": [[0, 10, "Actor"], [39, 52, "Resource"], [39, 52, "Actor"], [59, 81, "Resource"]]}
{"id": 579, "text": "The system shall confirm all transactions with the customer’s web browser.", "labels": [[0, 10, "Actor"], [25, 41, "Resource"], [47, 73, "Resource"], [47, 73, "Actor"]]}
{"id": 580, "text": "The system shall not leave any cookies on the customer’s computer containing the user’s password.", "labels": [[0, 10, "Actor"], [27, 38, "Resource"], [42, 65, "Resource"], [77, 96, "Resource"]]}
{"id": 581, "text": "The system shall not leave any cookies on the customer’s computer containing any of the user’s confidential information.", "labels": [[0, 10, "Actor"], [27, 38, "Resource"], [42, 65, "Resource"], [77, 119, "Resource"]]}
{"id": 582, "text": "The system shall allow a user to make public emergency point-to-point voice calls.", "labels": [[0, 10, "Actor"], [23, 30, "Actor"], [38, 81, "Resource"]]}
{"id": 583, "text": "Broadcast voice calls provide one-way voice communications from a single user to multiple users in a pre-defined local area, all of whom are members of the same call group.", "labels": [[0, 21, "Resource"], [0, 21, "Actor"], [30, 58, "Resource"], [64, 77, "Resource"], [64, 77, "Actor"], [81, 95, "Resource"], [81, 95, "Actor"], [99, 123, "Resource"], [141, 171, "Resource"], [141, 171, "Actor"]]}
{"id": 584, "text": "The composition of call groups shall be able to be modified within the network. A single user shall be able to be a member of one or more call groups.", "labels": [[0, 30, "Actor"], [0, 30, "Resource"], [67, 78, "Resource"], [80, 93, "Actor"], [114, 149, "Resource"], [114, 149, "Actor"]]}
{"id": 585, "text": "It shall be possible for an incoming call or data message for one user to be forwarded to another user using functionality provided by the network.", "labels": [[25, 57, "Actor"], [25, 57, "Resource"], [62, 70, "Actor"], [90, 102, "Actor"], [109, 122, "Resource"], [135, 146, "Actor"], [135, 146, "Resource"]]}
{"id": 586, "text": "ETCS shall provide the driver with information to allow him to drive the train safely.", "labels": [[0, 4, "Actor"], [19, 29, "Actor"], [35, 46, "Resource"], [69, 78, "Resource"]]}
{"id": 587, "text": "ETCS shall be able to supervise train and shunting movements.", "labels": [[0, 4, "Actor"], [32, 60, "Resource"]]}
{"id": 588, "text": "ETCS is required to be functional to a maximum train speed of 500 km/h.", "labels": [[0, 4, "Actor"], [23, 33, "Resource"], [37, 70, "Resource"]]}
{"id": 589, "text": "It shall be possible to implement one or more of the ETCS application levels on a line.", "labels": [[34, 76, "Resource"], [80, 86, "Resource"]]}
{"id": 590, "text": "ETCS shall be compatible with existing national systems listed in the CCS TSI such that it does not interfere with the national systems and is not interfered with by the national systems.", "labels": [[0, 4, "Actor"], [30, 77, "Resource"], [30, 77, "Actor"], [115, 135, "Resource"], [115, 135, "Actor"], [166, 186, "Resource"], [166, 186, "Actor"]]}
{"id": 591, "text": "The ETCS on-board shall be capable of receiving National values from the trackside to adapt to National requirements.", "labels": [[0, 17, "Actor"], [48, 63, "Resource"], [69, 82, "Resource"], [95, 116, "Resource"]]}
{"id": 592, "text": "National values shall be applicable to a defined area.", "labels": [[0, 15, "Resource"], [0, 15, "Actor"], [39, 53, "Resource"]]}
{"id": 593, "text": "Once received onboard the national values shall remain valid even if the onboard equipment is switched off.", "labels": [[22, 41, "Resource"], [69, 90, "Actor"], [69, 90, "Resource"]]}
{"id": 594, "text": "The DUAP System shall collect probe vehicle data.", "labels": [[0, 15, "Actor"], [30, 48, "Resource"]]}
{"id": 595, "text": "The DUAP Input Services shall be able to collect probe vehicle data from the Chrysler Fast Feedback (telematics demonstration) fleet using the Chrysler telematics interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 67, "Resource"], [73, 132, "Actor"], [73, 132, "Resource"], [139, 172, "Actor"], [139, 172, "Resource"]]}
{"id": 596, "text": "The DUAP Input Services shall be able to collect probe vehicle data from Southeast Michigan Snow and Ice Management (SEMSIM) using the SEMSIM interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 67, "Resource"], [73, 124, "Actor"], [73, 124, "Resource"], [131, 151, "Actor"], [131, 151, "Resource"]]}
{"id": 597, "text": "The DUAP Input Services shall be able to collect probe vehicle data from Suburban Mobility Authority for Regional Transportation (SMART) Transit using the SMART Transit interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 67, "Resource"], [73, 144, "Actor"], [73, 144, "Resource"], [151, 178, "Actor"], [151, 178, "Resource"]]}
{"id": 598, "text": "The DUAP Input Services shall be able to collect probe vehicle data from The Rapid Transit using the “The Rapid Transit” interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 67, "Resource"], [73, 90, "Actor"], [73, 90, "Resource"], [97, 130, "Actor"], [97, 130, "Resource"]]}
{"id": 599, "text": "The DUAP Input Services shall be able to collect probe vehicle data from Ann Arbor Transit using the Ann Arbor Transit interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 67, "Resource"], [73, 90, "Actor"], [73, 90, "Resource"], [97, 128, "Actor"], [97, 128, "Resource"]]}
{"id": 600, "text": "The DUAP Input Services shall be able to collect probe vehicle data from Detroit Department of Transportation (DDOT) Transit using the DDOT interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 67, "Resource"], [73, 124, "Actor"], [73, 124, "Resource"], [131, 149, "Actor"], [131, 149, "Resource"]]}
{"id": 601, "text": "The DUAP Input Services shall be able to collect probe vehicle data from the MDOT fleet using the MDOT probe vehicle data interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 67, "Resource"], [73, 87, "Actor"], [73, 87, "Resource"], [94, 131, "Actor"], [94, 131, "Resource"]]}
{"id": 602, "text": "The DUAP Input Services shall be able to collect probe vehicle data from truck fleets using the truck fleets’ interfaces.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 67, "Resource"], [73, 85, "Resource"], [73, 85, "Actor"], [92, 120, "Resource"], [92, 120, "Actor"]]}
{"id": 603, "text": "The DUAP Input Services shall be able to collect probe vehicle data from the car rental fleets using the car rental fleets’ interfaces.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 67, "Resource"], [73, 94, "Resource"], [73, 94, "Actor"], [101, 134, "Resource"], [101, 134, "Actor"]]}
{"id": 604, "text": "The DUAP System shall be able to collect weather data.", "labels": [[0, 15, "Actor"], [41, 53, "Resource"]]}
{"id": 605, "text": "The DUAP Input Services shall be able to collect weather data from the Road Commission for Oakland County (RCOC) Road Weather Information Systems (RWIS) using the RCOC RWIS interface.", "labels": [[0, 23, "Actor"], [49, 61, "Resource"], [67, 152, "Actor"], [67, 152, "Resource"], [159, 182, "Actor"], [159, 182, "Resource"]]}
{"id": 606, "text": "The DUAP Input Services shall be able to collect weather data from the MDOT RWIS using the MDOT RWIS interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 61, "Resource"], [67, 80, "Actor"], [67, 80, "Resource"], [87, 110, "Actor"], [87, 110, "Resource"]]}
{"id": 607, "text": "The DUAP Input Services shall be able to collect weather data from Michigan Department of Natural Resources (MDNR) weather information systems using the MDNR interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 61, "Resource"], [67, 142, "Resource"], [67, 142, "Actor"], [149, 167, "Actor"], [149, 167, "Resource"]]}
{"id": 608, "text": "The DUAP Input Services shall be able to collect weather data from MDOT Aeronautics Automated Weather Observing System (AWOS) using the AWOS interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 61, "Resource"], [67, 125, "Actor"], [67, 125, "Resource"], [132, 150, "Actor"], [132, 150, "Resource"]]}
{"id": 609, "text": "The DUAP Input Services shall be able to collect Clarus weather data as enumerated in APPENDIX D -Weather Data Elements from Clarus.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 68, "Resource"], [86, 119, "Resource"], [125, 131, "Actor"]]}
{"id": 610, "text": "The DUAP System shall be able to collect Origin/Destination (O/D) data.", "labels": [[0, 15, "Actor"], [41, 70, "Resource"]]}
{"id": 611, "text": "The DUAP System shall collect roadway traffic data.", "labels": [[0, 15, "Actor"], [30, 50, "Resource"]]}
{"id": 612, "text": "The DUAP Input Services shall be able to collect roadway traffic data from the MITS Center using the MITS traffic data interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 69, "Resource"], [75, 90, "Actor"], [75, 90, "Resource"], [97, 128, "Actor"], [97, 128, "Resource"]]}
{"id": 613, "text": "The DUAP Input Services shall be able to collect roadway traffic data from the Western Michigan Traffic Management System (WMTMS) using the WMTMS interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 69, "Resource"], [75, 129, "Actor"], [75, 129, "Resource"], [136, 155, "Actor"], [136, 155, "Resource"]]}
{"id": 614, "text": "The DUAP Input Services shall be able to collect roadway traffic data from the RCOC system using the RCOC system interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 69, "Resource"], [75, 90, "Actor"], [75, 90, "Resource"], [97, 122, "Actor"], [97, 122, "Resource"]]}
{"id": 615, "text": "The DUAP Input Services shall be able to collect roadway traffic data from the Road Commission of Macomb County (RCMC) system using the RCMC system interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 69, "Resource"], [75, 125, "Actor"], [75, 125, "Resource"], [132, 157, "Actor"], [132, 157, "Resource"]]}
{"id": 616, "text": "The DUAP Input Services shall be able to collect roadway traffic data from NAVTEQ Corporation’s Traffic.com using the Traffic.com interface.", "labels": [[0, 23, "Actor"], [0, 24, "Resource"], [49, 69, "Resource"], [75, 107, "Actor"], [75, 107, "Resource"], [114, 139, "Actor"], [114, 139, "Resource"]]}
{"id": 617, "text": "The DUAP Input Services shall be able to collect traffic data from the Detroit TMC system using the Detroit TMC interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 61, "Resource"], [67, 89, "Actor"], [67, 89, "Resource"], [96, 121, "Actor"], [96, 121, "Resource"]]}
{"id": 618, "text": "The DUAP Input Services shall be able to collect traffic data from the Statewide TMC system using the Statewide TMC interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 61, "Resource"], [67, 91, "Actor"], [67, 91, "Resource"], [98, 125, "Actor"], [98, 125, "Resource"]]}
{"id": 619, "text": "The DUAP System shall be able to collect traveler information.", "labels": [[0, 15, "Actor"], [41, 61, "Resource"]]}
{"id": 620, "text": "The DUAP System shall be able to collect road condition data.", "labels": [[0, 15, "Actor"], [41, 60, "Resource"]]}
{"id": 621, "text": "The DUAP Input Services shall be able to collect road condition data from Traffic Management Systems (TMS) using the TMS interface.", "labels": [[0, 23, "Resource"], [0, 23, "Actor"], [49, 68, "Resource"], [74, 106, "Resource"], [74, 106, "Actor"], [113, 130, "Actor"], [113, 130, "Resource"]]}
{"id": 622, "text": "The DUAP System shall be able to collect work zone (lane closure) data.", "labels": [[0, 15, "Actor"], [41, 70, "Resource"]]}
{"id": 623, "text": "The DUAP System shall log Input Services data transactions.", "labels": [[0, 15, "Actor"], [26, 58, "Resource"]]}
{"id": 624, "text": "The DUAP System shall be able to organize the sequence of execution of computational modules.", "labels": [[0, 15, "Actor"], [42, 92, "Resource"]]}
{"id": 625, "text": "The DUAP System shall cache (both raw and derived) probe vehicle data.", "labels": [[0, 15, "Actor"], [51, 69, "Resource"]]}
{"id": 626, "text": "The DUAP System shall cache data only if the data record associates the data with its source, a georeferenced location, and a timestamp.", "labels": [[0, 15, "Actor"], [28, 32, "Resource"], [41, 56, "Resource"], [68, 76, "Resource"], [82, 92, "Resource"], [94, 118, "Resource"], [124, 135, "Resource"]]}
{"id": 627, "text": "The DUAP System shall log Dynamic Data Services data transactions.", "labels": [[0, 15, "Actor"], [26, 65, "Resource"]]}
{"id": 628, "text": "The DUAP System shall derive traffic data from probe vehicle data.", "labels": [[0, 15, "Actor"], [29, 41, "Resource"], [47, 65, "Resource"]]}
{"id": 629, "text": "The DUAP Computational Services shall be able to derive speed from probe vehicle data.", "labels": [[0, 31, "Resource"], [0, 31, "Actor"], [56, 61, "Resource"], [67, 85, "Resource"]]}
{"id": 630, "text": "The DUAP Computational Services shall be able to derive congestion level based on volume to capacity from probe vehicle data.", "labels": [[0, 31, "Resource"], [0, 31, "Actor"], [56, 88, "Resource"], [106, 124, "Resource"]]}
{"id": 631, "text": "The DUAP Output Services shall be able to publish roadway traffic information in Traffic Management Data Dictionary (TMDD) format.", "labels": [[0, 24, "Resource"], [0, 24, "Actor"], [50, 77, "Resource"], [81, 129, "Resource"]]}
{"id": 632, "text": "The DUAP Output Services shall be able to publish traffic data in the SimTraffic traffic analysis tool SimTraffic interface format.", "labels": [[0, 24, "Resource"], [0, 24, "Actor"], [50, 62, "Resource"], [66, 102, "Resource"], [103, 130, "Resource"]]}
{"id": 633, "text": "The DUAP Presentation Services shall include a user interface for browsing traffic information.", "labels": [[0, 30, "Resource"], [0, 30, "Actor"], [45, 61, "Resource"], [75, 94, "Resource"]]}
{"id": 634, "text": "The DUAP System shall be capable of adding new data sources.", "labels": [[0, 15, "Actor"], [43, 59, "Resource"]]}
{"id": 635, "text": "The DUAP System shall be capable of adding new computational algorithms.", "labels": [[0, 15, "Actor"], [43, 71, "Resource"]]}
{"id": 636, "text": "The DUAP System shall be capable of adding new output formats of published data.", "labels": [[0, 15, "Actor"], [43, 79, "Resource"]]}
{"id": 637, "text": "The DUAP System shall be capable of adding new presentations of published data.", "labels": [[0, 15, "Actor"], [43, 78, "Resource"]]}
{"id": 638, "text": "The System shall provide the capability to operate in an Open Mode, within which authorized customers shall be allowed read-only access to requested Data Products. This is the nominal system mode.", "labels": [[0, 10, "Actor"], [54, 66, "Resource"], [119, 135, "Resource"], [139, 162, "Resource"], [172, 195, "Resource"]]}
{"id": 639, "text": "The System shall provide the capability to operate in a Degraded System Mode, within which the system generates a subset of products based upon priority and availability of system resources.", "labels": [[0, 10, "Actor"], [54, 76, "Resource"], [112, 189, "Resource"]]}
{"id": 640, "text": "The System shall provide the capability to notify customers upon the NPOESS Ground System entering and leaving a Degraded Operations Mode.", "labels": [[0, 10, "Actor"], [50, 59, "Actor"], [65, 89, "Actor"], [111, 137, "Resource"]]}
{"id": 641, "text": "The System shall provide the capability to operate in a Restricted Access Mode, within which only users meeting certain criteria will be authorized access to the data.", "labels": [[0, 10, "Actor"], [54, 78, "Resource"], [112, 128, "Resource"], [158, 166, "Resource"]]}
{"id": 642, "text": "The System shall provide the capability to send an electronic notification to authorized users when they receive restricted access data.", "labels": [[0, 10, "Actor"], [48, 74, "Resource"], [78, 94, "Actor"], [113, 135, "Resource"]]}
{"id": 643, "text": "The System shall be capable of defining Data Products for Ingest.", "labels": [[0, 10, "Actor"], [40, 64, "Resource"]]}
{"id": 644, "text": "The System shall be capable of maintaining records of at least 30 days (configurable) worth of Ingest history.", "labels": [[0, 10, "Actor"], [43, 109, "Resource"]]}
{"id": 645, "text": "The System shall provide the capability to control the execution of Scientific Algorithms.", "labels": [[0, 10, "Actor"], [51, 89, "Resource"]]}
{"id": 646, "text": "The System shall be capable of generating Data Products.", "labels": [[0, 10, "Actor"], [42, 55, "Resource"]]}
{"id": 647, "text": "The System shall provide the capability for an authorized user to adjust Product Generation priorities.", "labels": [[0, 10, "Actor"], [73, 102, "Resource"]]}
{"id": 648, "text": "The System shall be capable of rendering Platte Carre projections.", "labels": [[0, 10, "Actor"], [41, 65, "Resource"]]}
{"id": 649, "text": "The System shall be capable of rendering Mercator projections.", "labels": [[0, 10, "Actor"], [41, 61, "Resource"]]}
{"id": 650, "text": "The System shall be capable of rendering Polar Stereographic projections.", "labels": [[0, 10, "Actor"], [41, 72, "Resource"]]}
{"id": 651, "text": "The System shall be capable of aggregating Data Products up to and including one orbit.", "labels": [[0, 10, "Actor"], [43, 56, "Resource"], [77, 86, "Resource"]]}
{"id": 652, "text": "The System shall be capable of producing time-averaged Data Products.", "labels": [[0, 10, "Actor"], [41, 68, "Resource"]]}
{"id": 653, "text": "The System shall be capable of generating NOAA-Unique and Tailored Data Products with Government-specified grid spacing.", "labels": [[0, 10, "Actor"], [42, 80, "Resource"], [86, 119, "Resource"]]}
{"id": 654, "text": "Allows resources to be reviewed before a decision is made whether they should be retained.", "labels": [[7, 16, "Resource"], [39, 49, "Resource"]]}
{"id": 655, "text": "Supports workflow of digital objects in this order:", "labels": [[9, 36, "Resource"]]}
{"id": 656, "text": "Receive and track content from producers", "labels": [[12, 25, "Resource"], [31, 40, "Actor"]]}
{"id": 657, "text": "Normalize content –  the conversion into a common format for final ingestion into the repository", "labels": [[0, 17, "Resource"], [21, 35, "Resource"], [41, 56, "Resource"], [61, 76, "Resource"], [82, 96, "Resource"]]}
{"id": 658, "text": "Validate content based on submitter, expected format, file quality, duplication (e.g., existence of object in repository), and completeness.", "labels": [[9, 16, "Resource"], [37, 52, "Resource"], [54, 66, "Resource"], [68, 79, "Resource"], [87, 120, "Resource"], [127, 139, "Resource"]]}
{"id": 659, "text": "Review content as a method of the selection process", "labels": [[7, 14, "Resource"], [18, 51, "Resource"]]}
{"id": 660, "text": "Accept or reject content or file format.", "labels": [[17, 39, "Resource"]]}
{"id": 661, "text": "A minimal set of identifying information/metadata concerning rejection decisions must be recorded.", "labels": [[0, 80, "Resource"]]}
{"id": 662, "text": "A minimal set of identifying information/metadata concerning rejected submissions should provide a mechanism to eliminate the need to review some resubmissions. Certain reasons for rejection should prevent a possible resubmission.", "labels": [[0, 81, "Actor"], [0, 81, "Resource"], [97, 108, "Resource"], [122, 130, "Resource"], [141, 159, "Resource"], [161, 176, "Resource"], [206, 229, "Resource"]]}
{"id": 663, "text": "Allows notification of producers and donors about rejected content.", "labels": [[7, 19, "Resource"], [23, 43, "Actor"], [59, 66, "Resource"]]}
{"id": 664, "text": "Accepts content from physical media (DVDs, external drives, etc.) or via electronic transfer (FTP) from producers.", "labels": [[8, 15, "Resource"], [21, 35, "Resource"], [37, 41, "Resource"], [43, 58, "Resource"], [73, 98, "Resource"], [104, 113, "Actor"]]}
{"id": 665, "text": "Prompts a request for resubmission to the Content Originator if an error of transmission or receipt occurs", "labels": [[8, 17, "Resource"], [38, 60, "Actor"], [64, 99, "Resource"]]}
{"id": 666, "text": "Error message feature is configurable for all types of errors.", "labels": [[0, 21, "Actor"], [0, 21, "Resource"], [42, 61, "Resource"]]}
{"id": 667, "text": "System generates an error log.", "labels": [[0, 6, "Actor"], [17, 29, "Resource"]]}
{"id": 668, "text": "Allows retention of metadata for files rejected but not replaced.", "labels": [[20, 38, "Resource"]]}
{"id": 669, "text": "Transmission problems allow rejection of entire packages.", "labels": [[0, 21, "Resource"], [0, 21, "Actor"], [41, 56, "Resource"]]}
{"id": 670, "text": "Other problems will allow rejection of entire package or part of a package, depending on content.", "labels": [[0, 14, "Resource"], [0, 14, "Actor"], [39, 74, "Resource"], [89, 96, "Resource"]]}
{"id": 671, "text": "Maintains log of messages sent concerning resubmissions.", "labels": [[10, 25, "Resource"], [42, 55, "Resource"]]}
{"id": 672, "text": "Accommodates a resubmitted SIP in case of errors resulting from the SIP submission.", "labels": [[13, 30, "Resource"], [42, 82, "Resource"]]}
{"id": 673, "text": "Has the option of sending a configurable automatic system confirmation receipt of SIP to producer based on type of resource, file, producer, etc.", "labels": [[4, 14, "Resource"], [26, 85, "Resource"], [89, 97, "Actor"], [107, 144, "Resource"]]}
{"id": 674, "text": "Stores and tracks versions of a document/file/image.  Links /connections between versions are created and maintained.", "labels": [[18, 51, "Resource"], [54, 89, "Resource"]]}
{"id": 675, "text": "Performs virus checking on SIP.", "labels": [[9, 23, "Resource"]]}
{"id": 676, "text": "Validates automatically the successful transfer of the SIP to a staging area using Cyclic Redundancy Check (CRCs) or checksums associated with each data file.", "labels": [[51, 58, "Resource"], [62, 76, "Resource"], [83, 126, "Resource"], [143, 157, "Resource"]]}
{"id": 677, "text": "Verifies the validity of the submission based on submitter, expected format, file quality, duplication (e.g., existence of object in repository), and completeness.", "labels": [[9, 39, "Resource"], [60, 75, "Resource"], [77, 89, "Resource"], [91, 102, "Resource"], [110, 143, "Resource"], [150, 162, "Resource"]]}
{"id": 678, "text": "Allows NLM staff to display and perform manual/visual quality control assurance on staged SIPs via a user-friendly GUI interface.", "labels": [[7, 16, "Actor"], [40, 79, "Resource"], [83, 94, "Resource"], [99, 128, "Actor"], [99, 128, "Resource"]]}
{"id": 679, "text": "Allows metadata to be stored in a database in a manner that conforms to repository reformatting and linked to their corresponding objects via an identifier.", "labels": [[7, 15, "Resource"], [7, 15, "Actor"], [32, 42, "Resource"], [110, 137, "Resource"], [142, 155, "Resource"]]}
{"id": 680, "text": "Transfers the Descriptive Information to Data Management.", "labels": [[10, 37, "Resource"], [40, 56, "Resource"], [41, 56, "Actor"]]}
{"id": 681, "text": "Sends confirmation notification when transfer to archival storage is completed.", "labels": [[6, 31, "Resource"], [49, 65, "Resource"]]}
{"id": 682, "text": "Stores the identification information in the Data Management database to support search and retrieval of AIPs in Archive Storage.", "labels": [[8, 37, "Resource"], [41, 69, "Actor"], [41, 69, "Resource"], [81, 109, "Resource"], [113, 128, "Actor"], [113, 128, "Resource"]]}
{"id": 683, "text": "Receives AIPs from Ingest.", "labels": [[9, 13, "Resource"], [19, 25, "Actor"], [19, 25, "Resource"]]}
{"id": 684, "text": "Moves and adds AIPs to storage within the repository", "labels": [[15, 19, "Resource"], [38, 52, "Actor"], [38, 52, "Resource"]]}
{"id": 685, "text": "Generates confirmation, statistical and error reports for the AIP process.", "labels": [[10, 53, "Resource"], [58, 73, "Actor"], [58, 73, "Resource"]]}
{"id": 686, "text": "Keeps an audit trail of all actions.", "labels": [[6, 20, "Resource"], [6, 20, "Resource"], [6, 20, "Resource"], [6, 20, "Resource"], [6, 20, "Resource"], [6, 20, "Resource"], [24, 35, "Resource"], [24, 35, "Resource"], [24, 35, "Resource"], [24, 35, "Resource"], [24, 35, "Resource"]]}
{"id": 687, "text": "Monitors and ensures that AIPs are not corrupted during transfers.", "labels": [[26, 30, "Resource"], [56, 65, "Resource"]]}
{"id": 688, "text": "Conforms to NLM security policies and requirements to ensure the appropriate level of protection for the AIPs.", "labels": [[12, 50, "Resource"], [61, 82, "Resource"], [101, 109, "Resource"]]}
{"id": 689, "text": "Maintains the integrity of the Data Management database which contains both metadata and system information.", "labels": [[10, 55, "Resource"], [27, 55, "Actor"], [71, 107, "Resource"]]}
{"id": 690, "text": "Provides internal validation such as referential integrity of the contents of the database.", "labels": [[9, 28, "Resource"], [37, 90, "Resource"]]}
{"id": 691, "text": "Creates and maintains schema or table definitions required to support Data Management functions.", "labels": [[22, 49, "Resource"], [70, 95, "Resource"]]}
{"id": 692, "text": "Has capability to create, maintain, and access customized user views of the contents of this storage.", "labels": [[47, 100, "Resource"]]}
{"id": 693, "text": "Query requests are received from other functions (for example, Ingest, Access, and Administration).", "labels": [[0, 14, "Resource"], [33, 48, "Resource"], [33, 48, "Actor"], [63, 69, "Resource"], [71, 77, "Resource"], [83, 97, "Resource"]]}
{"id": 694, "text": "The query request may require data to be sourced from different storage locations.", "labels": [[0, 17, "Actor"], [0, 17, "Resource"], [30, 34, "Resource"], [54, 81, "Resource"], [54, 81, "Actor"]]}
{"id": 695, "text": "Generates a result set.", "labels": [[10, 22, "Resource"]]}
{"id": 696, "text": "Allows query requests against all metadata used to manage the repository.", "labels": [[7, 21, "Resource"], [7, 21, "Actor"], [30, 42, "Resource"], [58, 72, "Actor"], [58, 72, "Resource"]]}
{"id": 697, "text": "Receives updates from other NLM Digital Repository functions (for example, Ingest and Administration).", "labels": [[9, 16, "Resource"], [22, 60, "Resource"], [22, 60, "Actor"], [75, 81, "Resource"], [86, 100, "Resource"]]}
{"id": 698, "text": "Allows updates to be submitted in batches.", "labels": [[7, 14, "Resource"], [34, 41, "Resource"]]}
{"id": 699, "text": "Has capability to generate and provide management reports and statistics such as summaries of updates by category, user codes, etc.", "labels": [[39, 72, "Resource"], [81, 101, "Resource"], [105, 113, "Resource"], [115, 125, "Resource"]]}
{"id": 700, "text": "There may be a need to coordinate updates with metadata held in other systems.", "labels": [[34, 41, "Resource"], [47, 55, "Resource"], [64, 77, "Actor"]]}
{"id": 701, "text": "Audits submissions to ensure that they meet archive/repository standards.", "labels": [[7, 18, "Resource"], [44, 72, "Resource"]]}
{"id": 702, "text": "Maintains configuration management of the system hardware and software.", "labels": [[10, 34, "Resource"], [38, 70, "Actor"], [38, 70, "Resource"]]}
{"id": 703, "text": "Has capability to inventory, report on and migrate the contents of the repository.", "labels": [[18, 27, "Resource"], [51, 63, "Resource"], [67, 81, "Resource"]]}
{"id": 704, "text": "Ensures data integrity for version upgrades and format migration.", "labels": [[8, 22, "Resource"], [27, 43, "Resource"], [48, 64, "Resource"]]}
{"id": 705, "text": "Tracks negotiation status, written submission agreements and maintains schedules.", "labels": [[7, 25, "Resource"], [35, 56, "Resource"], [71, 80, "Resource"]]}
{"id": 706, "text": "Able to add and edit terms of agreement, based on access of level of user.", "labels": [[21, 39, "Resource"], [50, 73, "Resource"]]}
{"id": 707, "text": "Submission schedules may be set on a periodic or ad-hoc basis.", "labels": [[0, 20, "Resource"], [35, 61, "Resource"]]}
{"id": 708, "text": "Submission volumes and schedules are managed and monitored.", "labels": [[0, 32, "Resource"]]}
{"id": 709, "text": "Able to store terms of agreements, and use them to monitor/review/process submissions.", "labels": [[14, 33, "Resource"], [74, 85, "Resource"]]}
{"id": 710, "text": "Monitors functionality of the entire repository.", "labels": [[9, 22, "Resource"], [26, 47, "Resource"]]}
{"id": 711, "text": "Maintains integrity of system configuration.", "labels": [[10, 43, "Resource"]]}
{"id": 712, "text": "Audits system operations, performance and usage.", "labels": [[7, 24, "Resource"], [26, 37, "Resource"], [42, 47, "Resource"]]}
{"id": 713, "text": "Sends requests for system information to Data Management and receives reports.", "labels": [[6, 14, "Resource"], [19, 37, "Resource"], [41, 56, "Actor"], [41, 56, "Resource"], [70, 77, "Resource"]]}
{"id": 714, "text": "Receives operational statistics from Archival Storage.", "labels": [[9, 31, "Resource"], [37, 53, "Actor"], [37, 53, "Resource"]]}
{"id": 715, "text": "Summarizes reports and provides repository performance information and repository holdings inventory reports to Preservation Planning.", "labels": [[11, 18, "Resource"], [32, 66, "Resource"], [71, 100, "Actor"], [91, 108, "Resource"], [112, 133, "Actor"], [112, 133, "Resource"]]}
{"id": 716, "text": "Sends performance information to Establish Standards and Polices.", "labels": [[6, 29, "Resource"], [43, 64, "Resource"]]}
{"id": 717, "text": "Receives migration packages from Preservation Planning.", "labels": [[9, 27, "Resource"], [33, 54, "Actor"], [33, 54, "Resource"]]}
{"id": 718, "text": "Develops and implements plans for system evolution.", "labels": [[24, 29, "Resource"], [34, 50, "Resource"]]}
{"id": 719, "text": "Submits change requests, procedures and tools to Archive Information Update.", "labels": [[8, 23, "Resource"], [25, 35, "Resource"], [40, 45, "Resource"], [49, 75, "Actor"], [49, 75, "Resource"]]}
{"id": 720, "text": "Receives change requests, actions and tools from the Manage System Configuration function.", "labels": [[9, 24, "Resource"], [26, 33, "Resource"], [38, 43, "Resource"], [49, 89, "Actor"], [49, 89, "Resource"]]}
{"id": 721, "text": "Requests DIPs from the Access function.", "labels": [[9, 13, "Resource"], [19, 38, "Actor"], [19, 38, "Resource"]]}
{"id": 722, "text": "Updates contents of DIPs and resubmits them as SIPs to Ingest.", "labels": [[8, 16, "Resource"], [20, 24, "Resource"], [47, 51, "Resource"], [55, 61, "Actor"], [55, 61, "Resource"]]}
{"id": 723, "text": "Deletes AIPs from the repository. This may require the removal of the digital object’s files, and the retention of associated metadata, or the removal of both the files and metadata.", "labels": [[8, 12, "Resource"], [18, 32, "Resource"], [18, 32, "Actor"], [66, 92, "Resource"], [115, 134, "Resource"], [154, 181, "Resource"]]}
{"id": 724, "text": "Coordinates the removal of an AIP with the maintenance of metadata held in other systems.  Provides an alert that other systems need to be updated.", "labels": [[27, 33, "Resource"], [58, 66, "Resource"], [75, 88, "Actor"], [100, 108, "Resource"], [114, 127, "Actor"]]}
{"id": 725, "text": "Schedules and performs file migrations.", "labels": [[23, 38, "Resource"]]}
{"id": 726, "text": "The system must be able to capture and organize voice clips that can be used where appropriate.", "labels": [[0, 10, "Actor"], [48, 59, "Resource"]]}
{"id": 727, "text": "The system must be able to capture and manage files where appropriate.", "labels": [[0, 10, "Actor"], [46, 51, "Resource"]]}
{"id": 728, "text": "One of the fundamental tasks of the system is to allow actors to upload and manage files on certain pages of the system.", "labels": [[0, 28, "Resource"], [32, 42, "Actor"], [55, 61, "Actor"], [83, 105, "Resource"]]}
{"id": 729, "text": "An actor in the role of course administrator should be able to optionally upload multiple files where he or she finds.", "labels": [[0, 44, "Actor"], [81, 95, "Resource"]]}
{"id": 730, "text": "Actors in the capacity of course administrator or professor should be able to enable multiple file uploads on a page of his or her choosing.", "labels": [[0, 59, "Actor"], [85, 117, "Resource"]]}
{"id": 731, "text": "Actors in the role of professor or system administrator should be allowed to partition this space for actors in the roles of students.", "labels": [[0, 55, "Actor"], [87, 97, "Resource"], [102, 133, "Actor"]]}
{"id": 732, "text": "The actor should have the option to have the voice clip be archived after a preview has taken place.", "labels": [[0, 9, "Actor"], [22, 32, "Resource"], [41, 55, "Resource"], [74, 83, "Resource"]]}
{"id": 733, "text": "Voice clips should be downloadable for archival purposes or for the purpose of presenting them to other actors.", "labels": [[0, 11, "Resource"], [39, 56, "Resource"], [64, 75, "Resource"], [98, 110, "Actor"]]}
{"id": 734, "text": "This allows him or her to manage archived voice clips and to create a cohesive portfolio that actors in the role of professor can use to judge improvement over time.", "labels": [[42, 53, "Resource"], [68, 88, "Resource"], [94, 125, "Actor"], [143, 154, "Resource"]]}
{"id": 735, "text": "Actors in the role of course administrators should have the ability to determine which of these components have feeds and to whom these feeds should pertain.", "labels": [[0, 43, "Actor"], [90, 106, "Resource"]]}
{"id": 736, "text": "Actors in the course administrator role may not feel the need to provide web feeds for every page in their course.", "labels": [[0, 39, "Actor"], [73, 97, "Resource"]]}
{"id": 737, "text": "The system must be able to use search functionality as a way to navigate Moodle pages instead of using hierarchical links.", "labels": [[0, 10, "Actor"], [31, 51, "Resource"], [73, 85, "Resource"], [103, 121, "Resource"]]}
{"id": 738, "text": "Actors should be able to search for pages at the course level, since most actors will be searching for material in a given course.", "labels": [[0, 6, "Actor"], [36, 41, "Resource"], [45, 61, "Resource"], [69, 80, "Actor"], [103, 111, "Resource"], [115, 129, "Resource"]]}
{"id": 739, "text": "When the actor clicks a search result link, they should be taken to the page corresponding to the search result.", "labels": [[5, 14, "Actor"], [22, 42, "Resource"], [68, 111, "Resource"]]}
{"id": 740, "text": "The system must display a search box on every page after an actor has logged in.", "labels": [[0, 10, "Actor"], [24, 36, "Resource"], [40, 50, "Resource"], [57, 65, "Actor"]]}
{"id": 741, "text": "Actors should be able to search from any page.", "labels": [[0, 6, "Actor"], [37, 45, "Resource"]]}
{"id": 742, "text": "If the actor is hierarchically inside of a course, that course should be searched with an option to search all courses.", "labels": [[3, 12, "Actor"], [41, 49, "Resource"], [51, 62, "Resource"], [87, 96, "Resource"], [107, 118, "Resource"]]}
{"id": 743, "text": "The system must allow actors in the capacity of course administrator to post grades associated with assignments for a particular actor in the capacity of student.", "labels": [[0, 10, "Actor"], [22, 68, "Actor"], [77, 161, "Resource"], [116, 161, "Actor"]]}
{"id": 744, "text": "Actors in the role of professor may want to optionally grade assignments online since they are being submitted electronically by actors in the role of student.", "labels": [[0, 31, "Actor"], [61, 72, "Resource"], [129, 158, "Actor"]]}
{"id": 745, "text": "Course administrators should be able to post grades for an assignment based on the ratio of points earned to points possible.", "labels": [[0, 21, "Actor"], [45, 51, "Resource"], [56, 69, "Resource"], [79, 124, "Resource"]]}
{"id": 746, "text": "The course administrator should also be able to attach feedback in the form of text or an attachment (as described above).", "labels": [[0, 24, "Actor"], [55, 63, "Resource"], [67, 100, "Resource"]]}
{"id": 747, "text": "The system should display grade information to the appropriate actor.", "labels": [[0, 10, "Actor"], [26, 43, "Resource"], [47, 68, "Actor"]]}
{"id": 748, "text": "The system should display grade information such as the grade for each assignment, averages, and overall grade to the actor to whom the grades belong.", "labels": [[0, 10, "Actor"], [32, 43, "Resource"], [66, 81, "Resource"], [83, 91, "Resource"], [97, 110, "Resource"], [114, 149, "Actor"], [132, 142, "Resource"]]}
{"id": 749, "text": "The system should maintain a grade history.", "labels": [[0, 10, "Actor"], [27, 42, "Resource"]]}
{"id": 750, "text": "The system should maintain a history of grades for a particular assignment if the course administrator changes them.", "labels": [[0, 10, "Actor"], [27, 74, "Resource"], [78, 102, "Actor"]]}
{"id": 751, "text": "Course administrators can also track how they have changed a score over time using the timestamps associated with each change to the gradebook.", "labels": [[0, 21, "Actor"], [59, 66, "Resource"], [83, 97, "Resource"], [114, 142, "Resource"]]}
{"id": 752, "text": "The system must provide a wiki where actors can collaboratively create networks of documents.", "labels": [[0, 10, "Actor"], [24, 31, "Resource"], [37, 43, "Actor"], [71, 92, "Resource"]]}
{"id": 753, "text": "The system must provide a blog engine.", "labels": [[0, 10, "Actor"], [24, 37, "Resource"]]}
{"id": 754, "text": "the actor in the role of course administrator should be able to toggle whether notifications are turned on.", "labels": [[0, 45, "Actor"], [79, 92, "Resource"]]}
{"id": 755, "text": "Students should be able to select in their preferences whether notifications are sent to their mobile telephone (via SMS) or e-mail account.", "labels": [[0, 8, "Actor"], [37, 54, "Resource"], [63, 76, "Resource"], [89, 111, "Resource"], [117, 120, "Resource"], [125, 139, "Resource"]]}
{"id": 756, "text": "The system should be configurable from a single source at a central administrative position, and should provide a central, easy-to-use interface that will allow administrators to configure the user interface and features in a way that reduces page clutter.", "labels": [[0, 10, "Actor"], [39, 91, "Resource"], [112, 144, "Resource"], [161, 175, "Actor"], [189, 207, "Resource"], [243, 255, "Resource"]]}
{"id": 757, "text": "A system will be considered to meet this requirement if it has a single administrative interface rather than individual links for editing each page.", "labels": [[0, 8, "Actor"], [36, 52, "Resource"], [63, 96, "Resource"], [109, 125, "Resource"], [138, 147, "Resource"]]}
{"id": 758, "text": "Furthermore, this interface must allow administrators to easily change themes and other setting that affect page layout across the entire courseware system.", "labels": [[13, 27, "Actor"], [13, 27, "Resource"], [39, 53, "Actor"], [71, 155, "Resource"]]}
{"id": 759, "text": "The system must be backed up on a configurable schedule.", "labels": [[0, 10, "Actor"], [32, 55, "Resource"]]}
{"id": 760, "text": "The system should be backed up with a frequency that ensures system and course data is protected.", "labels": [[0, 10, "Actor"], [36, 47, "Resource"], [72, 83, "Resource"]]}
{"id": 761, "text": "The system must have the ability and capacity to restore back-up data within six hours so that the system is never offline for an inordinate period of time.", "labels": [[0, 10, "Actor"], [57, 69, "Resource"], [95, 105, "Actor"], [127, 155, "Resource"]]}
{"id": 762, "text": "System administrators must have access to comprehensive, searchable documentation.", "labels": [[0, 21, "Actor"], [42, 81, "Resource"]]}
{"id": 763, "text": "Users must have easy access to help while interacting with the system.", "labels": [[0, 5, "Actor"], [16, 27, "Resource"], [59, 69, "Actor"]]}
{"id": 764, "text": "The system will assist in the WUP review process.", "labels": [[0, 10, "Actor"], [26, 48, "Resource"]]}
{"id": 765, "text": "The system will be used to track and analyze long-term trends in permitted and actual water use and to assist in identifying underlying causes for these trends.", "labels": [[0, 10, "Actor"], [45, 95, "Resource"], [125, 159, "Resource"]]}
{"id": 766, "text": "The system will provide tools to assist in the quality control/quality assurance of WUP data.", "labels": [[0, 10, "Actor"], [24, 29, "Resource"], [43, 92, "Resource"]]}
{"id": 767, "text": "The system will provide information that can be used to assist in the calibration of ground water models.", "labels": [[0, 10, "Actor"], [24, 35, "Resource"], [66, 104, "Resource"]]}
{"id": 768, "text": "The system will also provide information on WUPs that can support the establishment and monitoring of Minimum Flows and Levels.", "labels": [[0, 10, "Actor"], [29, 48, "Resource"], [102, 126, "Resource"]]}
{"id": 769, "text": "The system will provide tools to assist in studies analyzing impacts of changing demographics and economic conditions on water use within the SWUCA.", "labels": [[0, 10, "Actor"], [24, 29, "Resource"], [81, 147, "Resource"], [138, 147, "Actor"]]}
{"id": 770, "text": "The system will provide standard reports that are published as hardcopy or web-accessible documents.", "labels": [[0, 10, "Actor"], [24, 40, "Resource"], [63, 99, "Resource"]]}
{"id": 771, "text": "This system is in line with the objectives of the CWM Information Technology initiative presented to the Governing Board in June 2002.", "labels": [[0, 11, "Actor"], [28, 133, "Resource"], [46, 76, "Actor"], [101, 120, "Actor"]]}
{"id": 772, "text": "The system will require a combination of permitting, geographic, and water resource data derived from the following sources.", "labels": [[0, 10, "Actor"], [24, 123, "Resource"]]}
{"id": 773, "text": "Create heat map indicating who was over-pumping, who was not over-pumping, or who was using their water credits.", "labels": [[7, 15, "Resource"], [92, 111, "Resource"]]}
{"id": 774, "text": "Track the movement of lapsed quantities in an area", "labels": [[6, 39, "Resource"], [43, 50, "Resource"]]}
{"id": 775, "text": "Track the relocation of active water use within the SWUCA.", "labels": [[6, 57, "Resource"], [48, 57, "Actor"]]}
{"id": 776, "text": "Report on the permits that have been relocated by a permit holder.", "labels": [[50, 65, "Resource"], [50, 65, "Actor"]]}
{"id": 777, "text": "Ability to track requested and permitted quantities.", "labels": [[17, 51, "Resource"]]}
{"id": 778, "text": "Identify when a standby permit is reactivated due to the loss of alternative quantities.", "labels": [[14, 30, "Resource"], [53, 87, "Resource"]]}
{"id": 779, "text": "Need to know how water use changes when land use changes.", "labels": [[17, 26, "Resource"], [40, 48, "Resource"]]}
{"id": 780, "text": "Provide the ability for applicants or District staff to compare the percentage a permit is over-pumping, based on use type, against the regional average for the same use type.", "labels": [[24, 52, "Actor"], [64, 103, "Resource"], [114, 122, "Resource"], [132, 174, "Resource"]]}
{"id": 781, "text": "The owner or operator of any Voluntary Black Start unit that desires a Black Start generating unit status with the CAISO Balancing Authority.", "labels": [[0, 55, "Actor"], [25, 55, "Resource"], [69, 105, "Resource"], [111, 140, "Actor"], [111, 140, "Resource"]]}
{"id": 782, "text": "Testing records shall include the dates of the tests, the duration of the tests, and an indication of whether the tests met the requirements of this Black Start Testing section.", "labels": [[0, 15, "Resource"], [30, 52, "Resource"], [54, 79, "Resource"], [85, 176, "Resource"]]}
{"id": 783, "text": "The Black Start unit must be equipped with governors that are capable of operating in an isochronous mode.", "labels": [[0, 20, "Actor"], [0, 20, "Resource"], [43, 52, "Actor"], [86, 105, "Resource"]]}
{"id": 784, "text": "The Black Start unit must be capable of starting and energizing the applicable transmission path without assistance from the electrical system.", "labels": [[0, 20, "Actor"], [0, 20, "Resource"], [64, 96, "Resource"], [121, 142, "Actor"]]}
{"id": 785, "text": "The Black Start Test should include key operating aids used in Black Starts such as telephone communications and SCADA, if applicable.", "labels": [[0, 20, "Actor"], [0, 20, "Resource"], [36, 75, "Resource"], [63, 118, "Actor"], [84, 108, "Resource"], [113, 118, "Resource"]]}
{"id": 786, "text": "The CAISO shall from time to time undertake performance tests, with or without prior notification.", "labels": [[0, 9, "Actor"], [0, 9, "Resource"], [44, 61, "Resource"], [79, 97, "Resource"]]}
{"id": 787, "text": "The CAISO shall have the sole right to determine when the operation of Black Start Generating Unit is required to respond to conditions on the CAISO Controlled Grid.", "labels": [[0, 9, "Actor"], [0, 9, "Resource"], [21, 35, "Resource"], [54, 98, "Resource"], [125, 164, "Resource"], [139, 164, "Actor"]]}
{"id": 788, "text": "The CAISO maintains a Black Start database that contains all Black Start generators designated for use during a system restoration.", "labels": [[0, 9, "Actor"], [0, 9, "Resource"], [20, 42, "Resource"], [57, 83, "Resource"], [110, 130, "Resource"]]}
{"id": 789, "text": "The Black Start database is reviewed and updated on at least an annual basis.", "labels": [[0, 24, "Actor"], [0, 24, "Resource"], [61, 76, "Resource"]]}
{"id": 790, "text": "The Black Start database includes the name, location, megawatt capacity, type of unit, latest date of test, and starting method.", "labels": [[0, 24, "Actor"], [0, 24, "Resource"], [34, 42, "Resource"], [44, 52, "Resource"], [54, 71, "Resource"], [73, 85, "Resource"], [87, 106, "Resource"], [112, 127, "Resource"]]}
{"id": 791, "text": "Developers: in order to be sure they are developing the right project that fulfills requirements provided in this document.", "labels": [[0, 10, "Actor"], [52, 69, "Resource"], [84, 122, "Resource"]]}
{"id": 792, "text": "Testers: in order to have an exact list of the features and functions that have to respond according to requirements and provided diagrams.", "labels": [[0, 7, "Actor"], [26, 69, "Resource"], [104, 138, "Resource"]]}
{"id": 793, "text": "Users: in order to get familiar with the idea of the project and suggest other features that would make it even more functional.", "labels": [[0, 5, "Actor"], [37, 60, "Resource"], [73, 87, "Resource"]]}
{"id": 794, "text": "Documentation writers: to know what features and in what way they have to explain. What security technologies are required, how the system will response in each user’s action etc.", "labels": [[0, 21, "Actor"], [36, 44, "Resource"], [88, 109, "Resource"], [156, 174, "Resource"]]}
{"id": 795, "text": "Advanced end users, end users/desktop and system administrators: in order to know exactly what they have to expect from the system, right inputs and outputs and response in error situations.", "labels": [[0, 63, "Actor"], [120, 130, "Actor"], [132, 189, "Resource"]]}
{"id": 796, "text": "User can create a new database locked by a Master Key.", "labels": [[0, 4, "Actor"], [16, 30, "Resource"], [41, 53, "Resource"]]}
{"id": 797, "text": "The user also can print all data in order to keep them with him even when a computer is not available.", "labels": [[0, 8, "Actor"], [24, 32, "Resource"], [74, 84, "Resource"]]}
{"id": 798, "text": "Also the user can search the database using key words through a search engine provided with the software.", "labels": [[5, 13, "Actor"], [25, 37, "Resource"], [44, 53, "Resource"], [62, 104, "Resource"], [92, 104, "Actor"]]}
{"id": 799, "text": "The user can select a sequence of keypresses that KeePass will be able to perform and send them to any window or browser.", "labels": [[0, 8, "Actor"], [20, 44, "Resource"], [50, 57, "Actor"], [99, 120, "Resource"]]}
{"id": 800, "text": "The user can pass a file path in the command line in order for KeePass to open this file at startup.", "labels": [[0, 9, "Actor"], [18, 29, "Resource"], [33, 49, "Resource"], [63, 70, "Actor"], [79, 88, "Resource"]]}
{"id": 801, "text": "Advanced end users: users that are familiar with programming and can personalize their database by creating auto-types, using command line options and generally can use features and maybe expand their use by adding more functions.", "labels": [[0, 18, "Actor"], [20, 25, "Actor"], [81, 95, "Resource"], [108, 118, "Resource"], [126, 146, "Resource"], [169, 177, "Resource"], [215, 229, "Resource"]]}
{"id": 802, "text": "End users/Desktop: users with no particular knowledge on computer programming. They just use the database for organizing their data and to keep them safe.", "labels": [[0, 17, "Actor"], [19, 24, "Actor"], [33, 53, "Resource"], [57, 77, "Resource"], [93, 105, "Resource"], [121, 131, "Resource"]]}
{"id": 803, "text": "System administrators: administrators working on computers that support a lot of accounts and personal data for other users.", "labels": [[0, 21, "Actor"], [23, 37, "Actor"], [49, 58, "Resource"], [81, 89, "Resource"], [94, 107, "Resource"], [112, 123, "Actor"]]}
{"id": 804, "text": "Using KeePass the administrator can save all data with no risk of leak to third persons.", "labels": [[6, 13, "Actor"], [14, 31, "Actor"], [41, 49, "Resource"], [66, 70, "Resource"]]}
{"id": 805, "text": "Science/Research Telecommunications: for organizing data that have to do with lots of people and applications", "labels": [[0, 35, "Actor"], [52, 56, "Resource"], [78, 109, "Resource"]]}
{"id": 806, "text": "Industry: for one-time passwords that can be used for testing controls or for expired entries to gain access in particular systems and programs.", "labels": [[0, 8, "Actor"], [14, 32, "Resource"], [54, 70, "Resource"], [78, 93, "Resource"], [102, 108, "Resource"], [112, 143, "Resource"]]}
{"id": 807, "text": "A Web server replicates content on-demand from the origin server and stores it for future use.", "labels": [[0, 12, "Resource"], [0, 12, "Actor"], [24, 31, "Resource"], [47, 64, "Resource"], [47, 64, "Actor"]]}
{"id": 808, "text": "Mediator generates service requirements as the basis for negotiated relationships.", "labels": [[0, 8, "Actor"], [19, 39, "Resource"], [57, 81, "Resource"]]}
{"id": 809, "text": "Mediator passes the service requirements to the PA.", "labels": [[0, 8, "Actor"], [16, 40, "Resource"], [44, 50, "Actor"]]}
{"id": 810, "text": "Mediator works in conjunction with its local PA to discover external resources and to negotiate with other CDNs.", "labels": [[0, 8, "Actor"], [35, 47, "Actor"], [35, 47, "Resource"], [60, 78, "Resource"], [101, 111, "Resource"], [101, 111, "Actor"]]}
{"id": 811, "text": "Service Registry encapsulates the resource and service information for each CDN.", "labels": [[0, 16, "Actor"], [30, 66, "Resource"], [71, 79, "Resource"], [71, 79, "Actor"]]}
{"id": 812, "text": "Service Registry helps in discovering local resources through enabling the Web servers of CDN providers to register and publish their resource, service and policy details.", "labels": [[0, 16, "Actor"], [38, 53, "Resource"], [71, 103, "Actor"], [71, 103, "Resource"], [128, 170, "Resource"]]}
{"id": 813, "text": "In the face of traffic surges, Service Registry supplies any necessary local resource information to the mediator.", "labels": [[15, 29, "Resource"], [31, 47, "Actor"], [57, 97, "Resource"], [101, 113, "Actor"]]}
{"id": 814, "text": "Policy Repository virtualizes all of the policies within a peering arrangement including PWS, PM, and PP, along with any delegated policies for resources as a result of the peering arrangement.", "labels": [[0, 17, "Actor"], [37, 49, "Resource"], [57, 104, "Resource"], [117, 139, "Resource"], [144, 153, "Resource"], [169, 192, "Resource"]]}
{"id": 815, "text": "Policy Repository provides a set of rules to the mediator to administer, manage, and control access to the resources in a peering arrangement.", "labels": [[0, 17, "Actor"], [27, 41, "Resource"], [45, 57, "Actor"], [103, 116, "Resource"]]}
{"id": 816, "text": "Policy Repository returns existing peering policies to the PA during the establishment of long-term peering arrangements.", "labels": [[0, 17, "Actor"], [26, 51, "Resource"], [55, 61, "Actor"], [90, 120, "Resource"]]}
{"id": 817, "text": "Peering Agent acts as a policy-driven resource discovery module for establishing negotiations.", "labels": [[0, 13, "Actor"], [22, 63, "Resource"], [81, 93, "Resource"]]}
{"id": 818, "text": "Peering Agent exchanges policy, resource information, and service requirements with external Peering Agent.", "labels": [[0, 13, "Actor"], [24, 30, "Resource"], [32, 52, "Resource"], [58, 78, "Resource"], [84, 106, "Actor"], [84, 106, "Resource"]]}
{"id": 819, "text": "Peering Agent is used as a conduit by the mediator to establish negotiations with Peering Agent of other peers and to acquire resources from them.", "labels": [[0, 13, "Actor"], [25, 34, "Resource"], [38, 50, "Actor"], [64, 76, "Resource"], [82, 110, "Actor"], [99, 110, "Resource"], [126, 135, "Resource"]]}
{"id": 820, "text": "Web server: Publishes its resource and service information to the Service Registry.", "labels": [[0, 10, "Actor"], [22, 34, "Resource"], [39, 58, "Resource"], [62, 82, "Actor"]]}
{"id": 821, "text": "Service Registry: Registers available local resources at the CDN provider and updates them.", "labels": [[0, 16, "Actor"], [28, 53, "Resource"], [57, 73, "Actor"], [57, 73, "Resource"]]}
{"id": 822, "text": "Mediator: Collects up-to-date resource information from Service Registry.", "labels": [[0, 8, "Actor"], [19, 50, "Resource"], [56, 72, "Actor"]]}
{"id": 823, "text": "Each CDN Web server publishes resource and service information.", "labels": [[0, 19, "Actor"], [30, 38, "Resource"], [43, 62, "Resource"]]}
{"id": 824, "text": "The interaction protocol between Web Server - Service Registry, Service Registry - mediator is defined.", "labels": [[0, 24, "Resource"], [33, 43, "Actor"], [46, 62, "Actor"], [64, 80, "Actor"], [83, 91, "Actor"]]}
{"id": 825, "text": "End users request for content from CDN Web server.", "labels": [[0, 9, "Actor"], [0, 17, "Resource"], [35, 49, "Resource"], [35, 49, "Actor"]]}
{"id": 826, "text": "Web server sends initialization request to the mediator to trigger peering.", "labels": [[0, 10, "Actor"], [17, 39, "Resource"], [43, 55, "Actor"], [67, 74, "Resource"]]}
{"id": 827, "text": "Hotspot is generated and provider is unable to handle excess load on its Web server.", "labels": [[0, 7, "Resource"], [0, 7, "Actor"], [25, 33, "Resource"], [25, 33, "Actor"], [54, 65, "Resource"], [69, 83, "Resource"], [73, 83, "Actor"]]}
{"id": 828, "text": "If the user requests can not be accepted according the provider policies, service requirements are not passed to the local Peering Agent.", "labels": [[3, 11, "Actor"], [3, 20, "Resource"], [3, 20, "Resource"], [3, 20, "Actor"], [51, 72, "Resource"], [51, 72, "Resource"], [74, 94, "Resource"], [74, 94, "Resource"], [113, 136, "Actor"], [113, 136, "Actor"]]}
{"id": 829, "text": "The mediator instance obtains resource and access information from the Service Registry and policy information from Policy Repository to establish negotiation.", "labels": [[0, 21, "Actor"], [30, 38, "Resource"], [43, 61, "Resource"], [67, 87, "Actor"], [92, 110, "Resource"], [116, 133, "Actor"], [147, 158, "Resource"]]}
{"id": 830, "text": "Mediator works in conjunction with the Peering Agent to establish negotiation.", "labels": [[0, 8, "Actor"], [18, 29, "Resource"], [35, 52, "Actor"], [66, 77, "Resource"]]}
{"id": 831, "text": "Local Peering Agent communicates with the Peering Agent of peers to discover external resources.", "labels": [[0, 19, "Actor"], [38, 64, "Actor"], [59, 64, "Resource"], [77, 95, "Resource"]]}
{"id": 832, "text": "Service requirements are received from the mediator.", "labels": [[0, 20, "Resource"], [39, 51, "Actor"]]}
{"id": 833, "text": "Local Peering Agent receives service requirements from the mediator.", "labels": [[0, 19, "Actor"], [29, 49, "Resource"], [55, 67, "Actor"]]}
{"id": 834, "text": "Local Peering Agent in conjunction with the mediator interacts with external Peering Agent through inter-Peering Agent communication protocol.", "labels": [[0, 19, "Actor"], [23, 34, "Resource"], [40, 52, "Actor"], [68, 90, "Actor"], [99, 141, "Resource"]]}
{"id": 835, "text": "Else, mediator re-evaluates service requirements and sends to the local Peering Agent to perform re-negotiation.", "labels": [[6, 14, "Actor"], [28, 48, "Resource"], [62, 85, "Actor"], [97, 111, "Resource"]]}
{"id": 836, "text": "Interaction protocols between Peering Agent are identified.", "labels": [[0, 21, "Resource"], [0, 43, "Actor"]]}
{"id": 837, "text": "Once policies are negotiated and a peering arrangement is established, Peering Agent interact each other in the execution of common goal(s).", "labels": [[5, 13, "Resource"], [33, 54, "Resource"], [71, 84, "Actor"], [125, 139, "Resource"]]}
{"id": 838, "text": "Peering Agent exchange content availability and load information to identify an optimal peer to handle user requests.", "labels": [[0, 13, "Actor"], [23, 30, "Resource"], [53, 64, "Resource"], [77, 92, "Resource"], [103, 116, "Resource"]]}
{"id": 839, "text": "Request is redirected to an optimal peer’s Web server.", "labels": [[0, 7, "Resource"], [25, 53, "Resource"], [25, 53, "Actor"]]}
{"id": 840, "text": "Peering Agent exchange accounting information to perform billing based on negotiated relationships.", "labels": [[0, 13, "Actor"], [23, 45, "Resource"], [57, 64, "Resource"], [74, 98, "Resource"]]}
{"id": 841, "text": "Primary CDN has already acquired sufficient external resources.", "labels": [[0, 11, "Actor"], [0, 11, "Resource"], [44, 62, "Resource"]]}
{"id": 842, "text": "If any of the termination condition holds, the local Peering Agent disbands or re-arranges the peering arrangement.", "labels": [[3, 35, "Resource"], [43, 66, "Actor"], [91, 114, "Resource"]]}
{"id": 843, "text": "The user should write his/her username, password and select in which domain he/she is.", "labels": [[0, 8, "Actor"], [22, 48, "Resource"], [69, 75, "Resource"]]}
{"id": 844, "text": "User can select customer, supplier, requests or items management section.", "labels": [[0, 4, "Actor"], [16, 72, "Resource"]]}
{"id": 845, "text": "User can click on [ Logout ] link, so that he/she logged out from the system.", "labels": [[0, 4, "Actor"], [18, 33, "Resource"], [66, 76, "Actor"]]}
{"id": 846, "text": "User can click on [ view detail ] for more information about a customer.", "labels": [[0, 4, "Actor"], [18, 33, "Resource"], [38, 71, "Resource"]]}
{"id": 847, "text": "User can click on [ view all customers ] link, he/she will directed to page will full customer list.", "labels": [[0, 4, "Actor"], [18, 45, "Resource"], [71, 99, "Resource"]]}
{"id": 848, "text": "User can click on [ add new customer ] link, to add a new customer to the system.", "labels": [[0, 4, "Actor"], [18, 43, "Resource"], [52, 66, "Resource"], [70, 80, "Actor"]]}
{"id": 849, "text": "The SCM system will use TCP/IP as the main communication protocol trough internet/network.", "labels": [[0, 14, "Actor"], [24, 30, "Resource"], [34, 65, "Resource"], [73, 89, "Actor"], [73, 89, "Resource"]]}
{"id": 850, "text": "Users should have an adequate computer, network connection, and webcam with microphone.", "labels": [[0, 5, "Actor"], [18, 38, "Resource"], [40, 58, "Resource"], [64, 86, "Resource"]]}
{"id": 851, "text": "Users will have access to common programs, such as media players for streaming.", "labels": [[0, 5, "Actor"], [26, 41, "Resource"], [51, 64, "Resource"]]}
{"id": 852, "text": "Streaming Audio and Video allows students and professor to make audio and/or video calls between each other.", "labels": [[0, 25, "Actor"], [0, 25, "Resource"], [33, 55, "Actor"], [64, 88, "Resource"], [97, 107, "Actor"]]}
{"id": 853, "text": "The professor will have the ability to hold a video lecture for the whole class or have one on one meeting with the students.", "labels": [[0, 13, "Actor"], [44, 59, "Resource"], [64, 79, "Actor"], [88, 106, "Resource"], [112, 124, "Actor"]]}
{"id": 854, "text": "Students will have the ability of attending an online class and be able to see the professor and colleagues and interact with each other.", "labels": [[0, 8, "Actor"], [44, 59, "Resource"], [79, 107, "Actor"], [126, 136, "Actor"]]}
{"id": 855, "text": "Professor will be able to ask questions to students and expect an answer immediately.", "labels": [[0, 9, "Actor"], [30, 39, "Resource"], [43, 51, "Actor"], [63, 72, "Resource"]]}
{"id": 856, "text": "Professor will be able to post the video lecture online and make it available for a later download.", "labels": [[0, 9, "Actor"], [31, 48, "Resource"], [82, 98, "Resource"]]}
{"id": 857, "text": "Users will also be able to choose their font as well as font color for their profile page.", "labels": [[0, 5, "Actor"], [34, 44, "Resource"], [56, 66, "Resource"], [71, 89, "Resource"]]}
{"id": 858, "text": "The students overall login should allow them access to the appropriate folder, and their account should only have Write privileges.", "labels": [[0, 12, "Actor"], [13, 26, "Resource"], [55, 77, "Resource"], [83, 96, "Resource"], [114, 130, "Resource"]]}
{"id": 859, "text": "The professor’s username should allow them access to the appropriate folder and have Read, Write, and Delete privileges.", "labels": [[0, 24, "Resource"], [53, 75, "Resource"], [85, 119, "Resource"]]}
{"id": 860, "text": "The students overall login should allow them access to the appropriate folder, and their account should only have Read, Write, and Delete privileges", "labels": [[0, 12, "Actor"], [0, 26, "Resource"], [55, 77, "Resource"], [83, 96, "Resource"], [114, 148, "Resource"]]}
{"id": 861, "text": "Users will be able to upload their documents, and eventually transfer them between other users/computers.", "labels": [[0, 5, "Actor"], [29, 44, "Resource"], [83, 104, "Resource"], [83, 104, "Actor"]]}
{"id": 862, "text": "Students will be able to download or view as live streaming videos/audios.", "labels": [[0, 8, "Actor"], [45, 73, "Resource"]]}
{"id": 863, "text": "The professor will be able to host a network projector and hold a lecture almost the same as in a real classroom, projecting power point slide and all students currently logged in will be able to follow what’s going on in the class.", "labels": [[0, 13, "Actor"], [35, 54, "Resource"], [64, 73, "Resource"], [96, 112, "Resource"], [125, 142, "Resource"], [147, 179, "Actor"]]}
{"id": 864, "text": "Professor will be able to distribute documents to students (example syllabus) with the ability to lock the editing tools, so unauthorized change to the document will be impossible.", "labels": [[0, 9, "Actor"], [37, 46, "Resource"], [50, 58, "Actor"], [107, 120, "Resource"], [125, 160, "Resource"]]}
{"id": 865, "text": "If professor makes a change or ads to the syllabus or any other document the change will be instantly distributed to all students that have those documents in their space.", "labels": [[3, 12, "Actor"], [19, 34, "Resource"], [38, 72, "Resource"], [117, 129, "Actor"], [140, 155, "Resource"], [159, 170, "Resource"]]}
{"id": 866, "text": "The professor will have the ability to write on the whiteboard and students will be able to follow the classes and professors writing with no problem.", "labels": [[0, 13, "Actor"], [48, 62, "Resource"], [67, 75, "Actor"], [99, 110, "Resource"], [115, 125, "Actor"]]}
{"id": 867, "text": "Students will be able to use this same feature when working on projects as teams, giving them the ability to all work on one document at the same time.", "labels": [[0, 8, "Actor"], [29, 46, "Resource"], [63, 71, "Resource"], [121, 133, "Resource"]]}
{"id": 868, "text": "All users are responsible for securing a backup of any uploaded data/content to the system in the event of an outage.", "labels": [[0, 9, "Actor"], [39, 76, "Resource"], [80, 90, "Actor"], [94, 116, "Resource"]]}
{"id": 869, "text": "The user should periodically change the password; currently the user policy requires a mandatory password change every three months.", "labels": [[0, 8, "Actor"], [36, 48, "Resource"], [60, 75, "Resource"], [85, 112, "Resource"]]}
{"id": 870, "text": "A Guest is a person that is not connected to the VUB-network nor logged into the PMS.", "labels": [[0, 7, "Actor"], [11, 19, "Actor"], [45, 60, "Actor"], [45, 60, "Resource"], [77, 84, "Actor"], [77, 84, "Resource"]]}
{"id": 871, "text": "A Guest can register an account on the PMS by ﬁlling in a form.", "labels": [[0, 7, "Actor"], [21, 31, "Resource"], [35, 42, "Actor"], [35, 42, "Resource"], [56, 62, "Resource"]]}
{"id": 872, "text": "A user can extend his Search by ﬁlling in an additional form, where they can specify one (or more) keyword(s) of the Publication and/or by specifying the Publications that refer to it.", "labels": [[0, 6, "Actor"], [18, 28, "Resource"], [42, 60, "Resource"], [85, 128, "Resource"], [150, 183, "Resource"]]}
{"id": 873, "text": "The user can search for a publication, by typing in certain keywords using logical expressions(eg. AND, OR, NOT,. . . ) and certain symbols (eg.”, ’ ,. . . ).", "labels": [[0, 8, "Actor"], [24, 37, "Resource"], [52, 68, "Resource"], [75, 119, "Resource"], [124, 157, "Resource"]]}
{"id": 874, "text": "The user can search for publications by the same author(s), publications that are mentioned in one of the results or publications by the same institute.", "labels": [[0, 8, "Actor"], [24, 58, "Resource"], [60, 113, "Resource"], [117, 151, "Resource"]]}
{"id": 875, "text": "The user can change his account information (eg. password, e-mail address,. . . ).", "labels": [[0, 8, "Actor"], [20, 81, "Resource"]]}
{"id": 876, "text": "This function allows the user to log oﬀ their account.", "labels": [[0, 13, "Actor"], [20, 29, "Actor"], [40, 53, "Resource"]]}
{"id": 877, "text": "If the user is connected to the VUB network, then he/she should be redirected to the search page when he logs oﬀ.", "labels": [[3, 11, "Actor"], [28, 43, "Actor"], [28, 43, "Resource"], [81, 96, "Resource"]]}
{"id": 878, "text": "The user has to have a valid account and has to be logged into his account.", "labels": [[0, 8, "Actor"], [21, 36, "Resource"], [63, 74, "Resource"]]}
{"id": 879, "text": "The user will only be able to edit the publication that he/she uploaded.", "labels": [[0, 8, "Actor"], [35, 71, "Resource"]]}
{"id": 880, "text": "A Moderator can decide to upgrade a Member (of his own department) to become a Publisher.", "labels": [[0, 11, "Actor"], [34, 42, "Actor"], [35, 66, "Resource"], [77, 88, "Resource"], [77, 88, "Actor"]]}
{"id": 881, "text": "A moderator can change the Group Permissions of any group that falls under his jurisdiction.", "labels": [[0, 11, "Actor"], [23, 91, "Resource"]]}
{"id": 882, "text": "A moderator can change or overwrite the bibliographical details of every publication owned by the department of group he/she is connected to.", "labels": [[0, 11, "Actor"], [36, 140, "Resource"]]}
{"id": 883, "text": "The user will have access to the Control Panel, from which he will be able to for example edit the user accounts (upgrade, downgrade or delete user accounts).", "labels": [[0, 8, "Actor"], [29, 46, "Resource"], [95, 112, "Resource"]]}
{"id": 884, "text": "An Administrator can change the User Level of every user into any other User Level.", "labels": [[0, 16, "Actor"], [28, 56, "Resource"], [62, 82, "Resource"]]}
{"id": 885, "text": "The users of the PMS are expected to be academic personnel and students with various technical backgrounds.", "labels": [[0, 20, "Actor"], [40, 106, "Actor"], [77, 106, "Resource"]]}
{"id": 886, "text": "the actor gets a screen where he will be able to login or where he/she can start a search immediately", "labels": [[0, 9, "Actor"], [15, 23, "Resource"]]}
{"id": 887, "text": "the actor can download all the publications in a search result by clicking on the Download button next to ”All” at the bottom of the screen.", "labels": [[0, 9, "Actor"], [23, 62, "Resource"], [78, 97, "Resource"], [106, 111, "Resource"], [115, 139, "Resource"]]}
{"id": 888, "text": "GOG must provide a way to be run from a command line or a shell script.", "labels": [[0, 3, "Actor"], [38, 52, "Resource"], [56, 70, "Resource"]]}
{"id": 889, "text": "Administrator: A member of the Construction Junction staff who can perform any of the Inventory Management functions.", "labels": [[0, 13, "Actor"], [15, 58, "Actor"], [75, 116, "Resource"]]}
{"id": 890, "text": "Director: A member of the Construction Junction staff who can perform the same Inventory Management functions as a Manager, plus view, create, modify and delete Inventory Management users.", "labels": [[0, 8, "Actor"], [10, 53, "Actor"], [70, 109, "Resource"], [113, 122, "Actor"], [161, 187, "Resource"]]}
{"id": 891, "text": "Manager: A member of the Construction Junction staff who can perform the same Inventory Management functions as a Receiving Associate, plus change item properties.", "labels": [[0, 7, "Actor"], [9, 52, "Actor"], [69, 108, "Resource"], [112, 133, "Resource"], [147, 162, "Resource"]]}
{"id": 892, "text": "Receiving Associate: A member of the Construction Junction staff who receives donated items at the receiving docks and performs their initial entry into the Inventory Management System and provides donors with their donation receipts.", "labels": [[0, 19, "Actor"], [21, 64, "Actor"], [78, 91, "Resource"], [95, 114, "Resource"], [128, 147, "Resource"], [153, 184, "Actor"], [153, 184, "Resource"], [189, 204, "Actor"], [210, 233, "Resource"]]}
{"id": 893, "text": "Customer Service Representative: A member of the Construction Junction staff who works in the customer service desk and performs specific tasks such as constituent and member database management, item returns processing, creating drop-off acquisitions, and others.", "labels": [[0, 31, "Actor"], [33, 76, "Actor"], [90, 115, "Resource"], [129, 143, "Resource"], [152, 194, "Resource"], [196, 219, "Resource"], [230, 251, "Resource"]]}
{"id": 894, "text": "Pickup Associate: A member of the Construction Junction staff who picks up donated items and brings them for processing at the receiving dock.", "labels": [[0, 16, "Actor"], [18, 61, "Actor"], [75, 88, "Resource"], [123, 141, "Resource"]]}
{"id": 895, "text": "Decon Associate: A member of the Construction Junction staff who executes a deconstruction and/or strip out job and brings the items for processing at the receiving dock.", "labels": [[0, 15, "Actor"], [17, 60, "Actor"], [74, 90, "Resource"], [108, 111, "Resource"], [123, 147, "Resource"], [151, 169, "Resource"]]}
{"id": 896, "text": "Sales Associate: A member of the Construction Junction staff who processes purchases by Construction Junction customers.", "labels": [[0, 15, "Actor"], [17, 60, "Actor"], [75, 84, "Resource"], [88, 119, "Actor"]]}
{"id": 897, "text": "Construction Junction Staff Member: Any of the Construction Junction user types: Administrator, Director, Manager, Receiving Associate, Pickup Associate, Decon Associate, Customer Service Representative or Sales Associate.", "labels": [[0, 34, "Actor"], [36, 73, "Actor"], [36, 79, "Resource"], [81, 94, "Actor"], [81, 221, "Resource"], [96, 104, "Actor"], [106, 113, "Actor"], [115, 134, "Actor"], [136, 152, "Actor"], [154, 169, "Actor"], [171, 202, "Actor"], [206, 221, "Actor"]]}
{"id": 898, "text": "Donor: An individual or organization who donates items to the Construction Junction inventory and receives a tax deduction for doing so.", "labels": [[0, 5, "Actor"], [7, 36, "Resource"], [7, 36, "Actor"], [49, 54, "Resource"], [58, 93, "Actor"], [107, 122, "Resource"]]}
{"id": 899, "text": "Buyer: A customer who purchases items from the Construction Junction inventory.", "labels": [[0, 5, "Actor"], [7, 17, "Actor"], [32, 37, "Resource"], [43, 78, "Actor"], [43, 78, "Resource"]]}
{"id": 900, "text": "Primary Contact: An individual who is the primary contact for a donation. The individual may be the actual donor or be acting on behalf of one.", "labels": [[0, 15, "Actor"], [17, 30, "Resource"], [17, 30, "Actor"], [62, 72, "Resource"], [74, 89, "Actor"], [96, 112, "Resource"], [96, 112, "Actor"]]}
{"id": 901, "text": "Vendor: An individual or organization who sells items to be added to Construction Junction‟s inventory", "labels": [[0, 6, "Actor"], [8, 37, "Actor"], [48, 53, "Resource"], [69, 102, "Actor"], [69, 102, "Resource"]]}
{"id": 902, "text": "Consigner: An individual who donates items to Construction Junction under consignment.", "labels": [[0, 9, "Actor"], [11, 24, "Actor"], [37, 42, "Resource"], [46, 67, "Actor"], [74, 85, "Resource"]]}
{"id": 903, "text": "The system should integrate with Construction Junction's website and allow, in addition to capacity outlined in later sections, the ability for customers to view and search CJ's inventory online.", "labels": [[0, 10, "Actor"], [33, 64, "Actor"], [33, 64, "Resource"], [112, 126, "Resource"], [144, 153, "Actor"], [173, 187, "Actor"], [173, 187, "Resource"]]}
{"id": 904, "text": "The user may perform a search for items by keyword (basic search) and other parameters such as price, date received and/or discount (advanced search).", "labels": [[0, 8, "Actor"], [21, 29, "Resource"], [34, 39, "Resource"], [43, 50, "Resource"], [70, 86, "Resource"], [95, 131, "Resource"]]}
{"id": 905, "text": "The system should allow Construction Junction staff to view a list of all items that are currently flagged as blastworthy that haven‟t yet been included in an e-Blast.", "labels": [[0, 10, "Actor"], [24, 51, "Actor"], [60, 79, "Resource"], [156, 166, "Resource"]]}
{"id": 906, "text": "The user can then select which flagged items should be included on the next e-Blast.", "labels": [[0, 8, "Actor"], [31, 44, "Resource"], [67, 83, "Resource"]]}
{"id": 907, "text": "The system should also provide an e-Blast preview screen that displays all items selected for that week‟s e-Blast, and also all items that have been flagged but not selected.", "labels": [[0, 10, "Actor"], [31, 56, "Resource"], [71, 113, "Resource"]]}
{"id": 908, "text": "The system should allow Construction Junction to reward customers for frequent donating by giving them in-store credit that can be used when purchasing items.", "labels": [[0, 10, "Actor"], [24, 45, "Actor"], [56, 65, "Actor"], [70, 87, "Resource"], [103, 118, "Resource"], [152, 157, "Resource"]]}
{"id": 909, "text": "The system should be able to print the donor‟s current credit amount on the donation receipt.", "labels": [[0, 10, "Actor"], [35, 68, "Resource"], [72, 92, "Resource"]]}
{"id": 910, "text": "Customer Wish List – Provide users with the ability to notify Construction Junction of items that they would like to purchase and be notified when/if those items become available.", "labels": [[0, 18, "Actor"], [0, 18, "Resource"], [29, 34, "Actor"], [62, 83, "Actor"], [87, 92, "Resource"], [150, 161, "Resource"]]}
{"id": 911, "text": "Users should be able to view their current wish line online and remove entries from it.", "labels": [[0, 5, "Actor"], [29, 52, "Resource"], [71, 78, "Resource"]]}
{"id": 912, "text": "Users should also be able to add to their wish lists the categories of items that have been sold over the past 15 days.", "labels": [[0, 5, "Actor"], [36, 52, "Resource"], [53, 76, "Resource"]]}
{"id": 913, "text": "The system must allow a threshold quantity to be set at any level (department or category) in the inventory.", "labels": [[0, 10, "Actor"], [22, 42, "Resource"], [56, 107, "Resource"]]}
{"id": 914, "text": "For unique items, user can accept the suggested price, enter a different one, or leave it blank", "labels": [[18, 22, "Actor"], [34, 53, "Resource"]]}
{"id": 915, "text": "Management Processes shall provide a development and training environment with the ability to migrate configurations to a production environment.", "labels": [[0, 20, "Actor"], [35, 73, "Resource"], [102, 116, "Resource"], [120, 144, "Resource"]]}
{"id": 916, "text": "The software developer shall provide complete data specifications for authority records, bibliographic records, order records, item records, hold/request records, and other records maintained or accessed by Management Processes.", "labels": [[0, 22, "Actor"], [37, 227, "Resource"], [207, 227, "Actor"]]}
{"id": 917, "text": "The software developer shall provide a thorough high-level description of major processes, including bibliographic record import and export, validation of bibliographic records against internal and external authority sources, and standard reports.", "labels": [[0, 22, "Actor"], [37, 89, "Resource"], [101, 139, "Resource"], [141, 224, "Resource"], [230, 246, "Resource"]]}
{"id": 918, "text": "The system shall provide an online, hierarchical, and cross-linked help system in HTML that describes and illustrates all system functions.", "labels": [[0, 10, "Actor"], [25, 138, "Resource"]]}
{"id": 919, "text": "The system shall provide thorough high-level error reporting and feedback and shall allow low-level query-specific feedback for Local and Global System Administrators from the front-end interface.", "labels": [[0, 10, "Actor"], [34, 73, "Resource"], [90, 123, "Resource"], [128, 166, "Actor"], [172, 195, "Actor"], [172, 195, "Resource"]]}
{"id": 920, "text": "Management Processes are part of an enterprise-level Library Automation System.", "labels": [[0, 20, "Resource"], [0, 20, "Actor"], [33, 78, "Actor"], [33, 78, "Resource"]]}
{"id": 921, "text": "Management Processes are consolidated at a central location, and accept input and provide services to multiple locations.", "labels": [[0, 20, "Actor"], [0, 20, "Resource"], [41, 59, "Resource"], [72, 98, "Resource"], [102, 120, "Resource"]]}
{"id": 922, "text": "Management Processes rely on the data structures and functionality of an enterprise-level Library Automation System, including Acquisitions and Cataloging modules.", "labels": [[0, 20, "Resource"], [0, 20, "Actor"], [29, 115, "Resource"], [70, 115, "Actor"], [127, 162, "Resource"], [127, 162, "Actor"]]}
{"id": 923, "text": "The system supports (but does not require) streamlined staff login methods, for example staff member swipes a card to log into a terminal or the staff member logs into a terminal by using his/her individual login and password.", "labels": [[0, 10, "Actor"], [43, 74, "Resource"], [88, 100, "Actor"], [108, 114, "Resource"], [127, 137, "Resource"], [141, 157, "Actor"], [168, 178, "Resource"], [188, 225, "Resource"]]}
{"id": 924, "text": "Ability to see where your report is in the queue of reports waiting to run.", "labels": [[21, 32, "Resource"], [39, 74, "Resource"]]}
{"id": 925, "text": "System provides a utility for transferring batches of items between branches, used for example to move books into a mobile library, an outreach program collection, or a \"just-in-time\" warehouse.", "labels": [[0, 6, "Actor"], [43, 59, "Resource"], [68, 76, "Resource"], [103, 108, "Resource"], [114, 130, "Resource"], [132, 162, "Resource"], [167, 193, "Resource"]]}
{"id": 926, "text": "The system provides a utility and reports for identifying item records to purge, based on customizable criteria such as: an item has been in status \"missing\" for more than X months.", "labels": [[0, 10, "Actor"], [58, 70, "Resource"], [90, 111, "Resource"], [121, 128, "Resource"], [141, 157, "Resource"]]}
{"id": 927, "text": "System Administration support the needs of a large, multiple-branch library system.", "labels": [[0, 21, "Actor"], [43, 82, "Resource"]]}
{"id": 928, "text": "System Administration Module shall use a fully relational database back-end.", "labels": [[0, 28, "Actor"], [0, 28, "Resource"], [39, 75, "Resource"]]}
{"id": 929, "text": "The software developer shall provide complete data specifications for authority records, bibliographic records, order records, item records, hold/request records, and other records maintained or accessed by the System Administration Module.", "labels": [[0, 22, "Actor"], [37, 65, "Resource"], [70, 180, "Resource"], [207, 239, "Actor"], [207, 239, "Resource"]]}
{"id": 930, "text": "The System Administration Module relies on the data structures and functionality of an enterprise-level Library Automation System, including Acquisitions and Cataloging modules.", "labels": [[0, 32, "Actor"], [0, 32, "Resource"], [43, 129, "Resource"], [84, 129, "Actor"], [141, 176, "Resource"], [141, 176, "Actor"]]}
{"id": 931, "text": "System upgrades and updates include written guidelines for updating servers and clients.", "labels": [[0, 6, "Actor"], [0, 27, "Resource"], [36, 54, "Resource"], [68, 87, "Resource"]]}
{"id": 932, "text": "System supports creation of custom dashboards that display current and historical data about system performance, record creation and modification, circulation transactions, etc.", "labels": [[0, 6, "Actor"], [16, 45, "Resource"], [59, 176, "Resource"]]}
{"id": 933, "text": "Administrators can create dashboards and give access to selected users and groups.", "labels": [[0, 14, "Actor"], [26, 36, "Resource"], [56, 81, "Resource"], [56, 81, "Actor"]]}
{"id": 934, "text": "Ability to set thresholds on the length of time records are locked and provide, for all record types, a list of records in sustained use/locked condition.", "labels": [[15, 25, "Resource"], [29, 55, "Resource"], [84, 100, "Resource"], [102, 119, "Resource"], [123, 153, "Resource"]]}
{"id": 935, "text": "System provides an administrative dashboard displaying", "labels": [[0, 6, "Actor"], [16, 43, "Resource"]]}
{"id": 936, "text": "System provides a management console displaying workstations running client software; workstation name and IP address; and utilities for managing and killing client sessions.", "labels": [[0, 6, "Actor"], [16, 36, "Resource"], [48, 60, "Resource"], [69, 84, "Resource"], [86, 117, "Resource"], [123, 173, "Resource"]]}
{"id": 937, "text": "System provides a single console with access to all configuration files.", "labels": [[0, 6, "Actor"], [16, 32, "Resource"], [48, 71, "Resource"]]}
{"id": 938, "text": "System allows creation and modification of requesting rules that determine whether a patron can place a hold on an item.", "labels": [[0, 6, "Actor"], [14, 59, "Resource"], [83, 91, "Resource"], [112, 119, "Resource"]]}
{"id": 939, "text": "System allows creation and modification of loan rules that allow or disallow check-out of items, calculate loan periods, and determine renewal limits.", "labels": [[0, 6, "Actor"], [14, 53, "Resource"], [77, 95, "Resource"], [107, 119, "Resource"], [135, 149, "Resource"]]}
{"id": 940, "text": "System provides a dedicated interface for creating new staff accounts.", "labels": [[0, 6, "Actor"], [16, 37, "Resource"], [51, 69, "Resource"]]}
{"id": 941, "text": "System supports scheduling of maintenance tasks, reports, and data exports.", "labels": [[0, 6, "Actor"], [30, 74, "Resource"]]}
{"id": 942, "text": "Staff can be given permission to schedule tasks, reports, and data exports.", "labels": [[0, 5, "Actor"], [19, 29, "Resource"], [42, 74, "Resource"]]}
{"id": 943, "text": "System supports administrator-programmable and user-programmable macros and/or keyboard shortcuts.", "labels": [[0, 6, "Actor"], [16, 97, "Resource"]]}
{"id": 944, "text": "Client software installation and updates must be centrally managed, using standard or proprietary network management tools, allowing streaming updates from server.", "labels": [[0, 40, "Actor"], [0, 40, "Resource"], [74, 122, "Resource"], [133, 150, "Resource"], [156, 162, "Resource"], [156, 162, "Actor"]]}
{"id": 945, "text": "Ability to fully customize layout and appearance of reports.", "labels": [[27, 59, "Resource"]]}
{"id": 946, "text": "System provides a user-friendly interface for designing queries against all record types.", "labels": [[0, 6, "Actor"], [16, 41, "Resource"], [56, 63, "Resource"], [72, 88, "Resource"]]}
{"id": 947, "text": "System administrators can create report templates that are available to front-line staff, and can be run as is or modified to the staff person's particular needs.", "labels": [[0, 21, "Actor"], [33, 49, "Resource"], [72, 88, "Actor"], [126, 161, "Resource"]]}
{"id": 948, "text": "System reports for each record type: current record number, current number of records, number deleted, and number purged.", "labels": [[0, 14, "Resource"], [19, 35, "Resource"], [37, 58, "Resource"], [60, 85, "Resource"], [87, 101, "Resource"], [107, 120, "Resource"]]}
{"id": 949, "text": "Ability to define and select four types of printers: receipt printer, standard printer, label printer, and forms printer.", "labels": [[29, 51, "Resource"], [43, 51, "Actor"], [53, 68, "Resource"], [53, 68, "Actor"], [70, 86, "Resource"], [70, 86, "Actor"], [88, 101, "Resource"], [88, 101, "Actor"], [107, 120, "Resource"], [107, 120, "Actor"]]}
{"id": 950, "text": "First, scientists and software engineers at NSAP, who will be using the system for setting up and maintaining operational model runs.", "labels": [[7, 48, "Actor"], [68, 78, "Actor"], [110, 127, "Resource"]]}
{"id": 951, "text": "A second group of users consists of scientists at RAL (and also outside of RAL), who will be using the system for running model jobs for research purposes.", "labels": [[0, 79, "Actor"], [99, 109, "Actor"], [122, 132, "Resource"]]}
{"id": 952, "text": "User can choose to receive email notification upon start, end and termination of the job.", "labels": [[0, 4, "Actor"], [27, 45, "Resource"]]}
{"id": 953, "text": "User can choose between predefined sigma-level configurations or supply own sigmalevel configuration", "labels": [[0, 4, "Actor"], [24, 61, "Resource"], [72, 100, "Resource"]]}
{"id": 954, "text": "User is given the option to run additional pre-processors for the IC/BC data, such as, LDAS or supply own custom pre-processor or skip this option.", "labels": [[0, 4, "Actor"], [32, 57, "Resource"], [62, 76, "Resource"], [87, 91, "Resource"], [102, 126, "Resource"], [135, 146, "Resource"]]}
{"id": 955, "text": "User chooses whether or not run additional processing on the model output.", "labels": [[0, 4, "Actor"], [32, 53, "Resource"], [57, 73, "Resource"]]}
{"id": 956, "text": "Users are allowed to manage the way of selection of the displayed in file manager interface objects(files and archives).", "labels": [[0, 5, "Actor"], [69, 119, "Resource"]]}
{"id": 957, "text": "Users are allowed to instantly access other main application interfaces(specifically create archive interface and extraction interface-these features are described in following chapters), as well as changing view mode for objects(archives and files) displayed in file manager interface.", "labels": [[0, 5, "Actor"], [44, 71, "Resource"], [92, 109, "Resource"], [114, 134, "Resource"], [135, 149, "Resource"], [208, 217, "Resource"], [222, 249, "Resource"], [263, 285, "Resource"]]}
{"id": 958, "text": "Users can access a group of file management tools, that are not strictly archivingrelated.", "labels": [[0, 5, "Actor"], [17, 49, "Resource"]]}
{"id": 959, "text": "Users are allowed to compress one or more objects (files or archives) in one or more compressed archive volumes (sizing less or equally to the original ones)in one of the offered for compression by PeaZip formats.", "labels": [[0, 5, "Actor"], [30, 69, "Resource"], [73, 111, "Resource"], [198, 212, "Resource"]]}
{"id": 960, "text": "Users can drag and drop objects (files or archives) between any computer system space and the application.", "labels": [[0, 5, "Actor"], [24, 51, "Resource"], [60, 105, "Resource"]]}
{"id": 961, "text": "PeaZip allows users to encrypt (“lock”) archives during creation or updating, by using password which is demanded by PeaZip (or other applications of the same use) and should be inserted.", "labels": [[0, 6, "Actor"], [14, 19, "Actor"], [40, 48, "Resource"], [117, 163, "Actor"], [117, 163, "Resource"]]}
{"id": 962, "text": "Users are allowed to make modifications over offered by PeaZip functions, so as to adapt them to their preference and cover their needs more adequately.", "labels": [[0, 5, "Actor"], [26, 39, "Resource"], [56, 72, "Actor"], [56, 72, "Resource"], [97, 113, "Resource"], [124, 135, "Resource"]]}
{"id": 963, "text": "A VCD will facilitate electronic Tendering by providing cross-border data and document solution that contains the necessary attestations and certificates typically required in eTendering.", "labels": [[0, 5, "Actor"], [0, 5, "Resource"], [56, 95, "Resource"], [110, 153, "Resource"], [176, 186, "Resource"]]}
{"id": 964, "text": "The user will give a search-term that will search through a database of compatible torrent websites that are added by the development team.", "labels": [[0, 8, "Actor"], [19, 32, "Resource"], [58, 99, "Resource"]]}
{"id": 965, "text": "User enters search term and starts search – system sends queries to the torrent websites in its database based on the search term.", "labels": [[0, 4, "Actor"], [12, 23, "Resource"], [35, 41, "Resource"], [44, 50, "Actor"], [57, 64, "Resource"], [68, 88, "Resource"], [68, 88, "Actor"], [92, 104, "Resource"], [114, 129, "Resource"]]}
{"id": 966, "text": "User sorts the search results by clicking once on a column header – system sorts all results by descending/ascending order.", "labels": [[0, 4, "Actor"], [11, 29, "Resource"], [50, 65, "Resource"], [68, 74, "Actor"], [81, 92, "Resource"], [96, 122, "Resource"]]}
{"id": 967, "text": "Torrent search will share the same search bar with the streaming search.", "labels": [[0, 14, "Actor"], [0, 14, "Resource"], [26, 45, "Resource"], [51, 71, "Resource"]]}
{"id": 968, "text": "There will be a tick box to allow the user to choose to include torrent searching in the search.", "labels": [[14, 24, "Resource"], [34, 43, "Actor"], [64, 81, "Resource"], [85, 95, "Resource"]]}
{"id": 969, "text": "The software will use hyperlinks to allow the user to open websites in their default web browser.", "labels": [[0, 12, "Actor"], [22, 32, "Resource"], [42, 50, "Actor"], [59, 67, "Resource"], [71, 96, "Resource"]]}
{"id": 970, "text": "The system we produce will stay within all the legal requirements on our behalf, as our software is only listing links for video streams and video download, and this is not illegal.", "labels": [[0, 10, "Actor"], [39, 65, "Resource"], [84, 96, "Actor"], [113, 155, "Resource"]]}
{"id": 971, "text": "The tools shall be able to process a set of multiple WARC ﬁles at the same time.", "labels": [[0, 9, "Actor"], [35, 62, "Resource"]]}
{"id": 972, "text": "The tools shall be able to scale to process large collections using distributed processing and data transport.", "labels": [[0, 9, "Actor"], [44, 61, "Resource"], [68, 109, "Resource"]]}
{"id": 973, "text": "The tools shall offer best possible performance to correctly process large collections (I/O bound)", "labels": [[0, 9, "Actor"], [22, 47, "Resource"], [69, 98, "Resource"]]}
{"id": 974, "text": "The tools shall be able to run on multiple machines but will not provide functionality for dealing with hardware failures (out of scope)", "labels": [[0, 9, "Actor"], [34, 51, "Resource"], [73, 86, "Resource"], [104, 121, "Resource"]]}
{"id": 975, "text": "The tools shall provide logging facilities, for example, to follow command progression, i.e. process duration, output levels, etc.", "labels": [[0, 9, "Actor"], [24, 42, "Resource"], [67, 86, "Resource"], [101, 129, "Resource"]]}
{"id": 976, "text": "The tools shall provide enhanced usability by providing easy to adapt shell script wrappers for the major commands", "labels": [[0, 9, "Actor"], [24, 42, "Resource"], [70, 91, "Resource"], [96, 114, "Resource"]]}
{"id": 977, "text": "The workﬂow system shall have a conﬁgurable management strategy for migration from ARCs to WARCs.", "labels": [[0, 18, "Actor"], [30, 63, "Resource"], [68, 77, "Resource"], [83, 87, "Actor"], [83, 87, "Resource"], [91, 96, "Actor"], [91, 96, "Resource"]]}
{"id": 978, "text": "The user shall be able to provide metadata related to the conversion that will be stored in the converted ﬁles (e.g., institution, context, crawler, collection name, ...)", "labels": [[0, 8, "Actor"], [34, 68, "Resource"], [92, 170, "Resource"]]}
{"id": 979, "text": "A conﬁguration must be provided explicitly, errors should be generated in the absence of a conﬁguration.", "labels": [[0, 14, "Resource"], [0, 14, "Actor"], [44, 50, "Resource"], [74, 103, "Resource"]]}
{"id": 980, "text": "The migration workﬂow shall be able to call external tools and services (e.g., database queries, shell commands, web service).", "labels": [[0, 21, "Actor"], [0, 21, "Resource"], [44, 125, "Resource"]]}
{"id": 981, "text": "System shall display the hyperlinks and descriptions for the user to perform the desired functions as specified in the related UIS.", "labels": [[0, 6, "Actor"], [21, 35, "Resource"], [40, 52, "Resource"], [57, 65, "Actor"], [77, 98, "Resource"], [115, 130, "Resource"]]}
{"id": 982, "text": "The user record shall inherit all specified role(s) settings in the template when the user record is created from the user template", "labels": [[0, 15, "Resource"], [0, 15, "Actor"], [30, 60, "Resource"], [82, 97, "Resource"], [114, 131, "Resource"]]}
{"id": 983, "text": "The Project Team must demonstrate mockups of UI changes to project stakeholders early in the development process.", "labels": [[0, 16, "Actor"], [34, 55, "Resource"], [59, 79, "Actor"], [89, 112, "Resource"]]}
{"id": 984, "text": "The Project Team must permit reasonable adjustment to the user interfaces of new functionality by project stakeholders when project schedule permits those adjustments.", "labels": [[0, 16, "Actor"], [29, 50, "Resource"], [54, 74, "Resource"], [77, 94, "Resource"], [98, 118, "Actor"], [124, 140, "Resource"], [149, 166, "Resource"]]}
{"id": 985, "text": "The system shall log errors, warnings, and informational messages to an external log file on the application server.", "labels": [[0, 10, "Actor"], [20, 65, "Resource"], [69, 89, "Resource"], [93, 115, "Actor"], [93, 115, "Resource"]]}
{"id": 986, "text": "The Technical Lead shall perform code reviews of every system change before those changes may be committed to source control.", "labels": [[0, 18, "Actor"], [33, 68, "Resource"], [76, 89, "Resource"], [110, 124, "Resource"]]}
{"id": 987, "text": "The system shall provide the capability to open a pop-up window displaying information about the specific page along with links to supporting help topics upon selecting each Help link.", "labels": [[0, 10, "Actor"], [48, 63, "Resource"], [75, 127, "Resource"], [147, 183, "Resource"]]}
{"id": 988, "text": "The system shall provide searching ability to the users to quickly find specific topic material through the online help tool.", "labels": [[0, 10, "Actor"], [72, 95, "Resource"], [104, 124, "Actor"], [104, 124, "Resource"]]}
{"id": 989, "text": "The ELSS must capture all data necessary for recording the fishing activities undertaken by a UK fishing vessel.", "labels": [[0, 8, "Actor"], [22, 40, "Resource"], [55, 111, "Resource"], [92, 111, "Actor"]]}
{"id": 990, "text": "The ELSS must output the data as an XML file for transmission to the UK fisheries administrations’ ERS system.", "labels": [[0, 8, "Actor"], [21, 29, "Resource"], [33, 44, "Resource"], [65, 109, "Actor"]]}
{"id": 991, "text": "The ELSS data must be validated against the UK XML/XSD before transmission from the fishing vessel.", "labels": [[0, 13, "Actor"], [40, 54, "Resource"], [80, 98, "Resource"], [80, 98, "Actor"]]}
{"id": 992, "text": "The ELSS data must be transmitted at the required times set out.", "labels": [[0, 13, "Actor"], [0, 13, "Resource"], [37, 55, "Resource"]]}
{"id": 993, "text": "Each ELSS data transmission will be acknowledged by a return message from the UK fisheries administrations’ ERS system.", "labels": [[0, 27, "Actor"], [0, 28, "Resource"], [52, 68, "Resource"], [74, 118, "Actor"]]}
{"id": 994, "text": "The ELSS must provide data capture screens for the entry of the logbook, transhipment and landing declaration data that is required to be transmitted to the UK fisheries administrations’ ERS system.", "labels": [[0, 8, "Actor"], [22, 42, "Resource"], [47, 71, "Resource"], [73, 114, "Resource"], [153, 197, "Actor"]]}
{"id": 995, "text": "The ELSS must provide the ability to print out the ELSS logbook data (including landing declarations) using an onboard printer.", "labels": [[0, 8, "Actor"], [47, 68, "Resource"], [80, 100, "Resource"], [108, 126, "Resource"], [108, 126, "Actor"]]}
{"id": 996, "text": "The ELSS must permit the Master of the vessel to generate formatted data for transmission to the UK fisheries administrations’ ERS system.", "labels": [[0, 8, "Actor"], [21, 45, "Resource"], [58, 72, "Resource"], [93, 137, "Actor"]]}
{"id": 997, "text": "The ELSS must provide facilities to capture and deliver for transmission corrections to previously successfully transmitted data.", "labels": [[0, 8, "Actor"], [22, 32, "Resource"], [60, 84, "Resource"], [88, 128, "Resource"]]}
{"id": 998, "text": "All corrections must be easily identifiable within the ELSS user interface.", "labels": [[0, 15, "Resource"], [0, 15, "Actor"], [51, 74, "Actor"], [51, 74, "Resource"]]}
{"id": 999, "text": "The ELSS must only permit correction messages to be generated and sent for reports sent during a current trip up to the submission of the End of Fishing report for that voyage", "labels": [[0, 8, "Actor"], [26, 45, "Resource"], [75, 82, "Resource"], [95, 109, "Resource"], [116, 175, "Resource"]]}
{"id": 1000, "text": "The ELSS must provide facilities to transmit deletions to previously transmitted data.", "labels": [[0, 8, "Actor"], [22, 32, "Resource"], [45, 54, "Resource"], [58, 85, "Resource"]]}
{"id": 1001, "text": "The ELSS must only permit deletion messages to be generated and sent for reports sent during a current trip up to the End of Fishing report for that voyage.", "labels": [[0, 8, "Actor"], [26, 43, "Resource"], [73, 80, "Resource"], [114, 155, "Resource"]]}
{"id": 1002, "text": "The ELSS must be able to receive acknowledgement (RET) messages transmitted from the UK fisheries administrations’ ERS system.", "labels": [[0, 8, "Actor"], [33, 63, "Resource"], [81, 125, "Actor"]]}
{"id": 1003, "text": "The ELSS must match each acknowledgement message with the appropriate transmitted data operation, deletion or correction report.", "labels": [[0, 8, "Actor"], [20, 48, "Resource"], [54, 127, "Resource"]]}
{"id": 1004, "text": "ELSS must retain all logbook reports and any corrections on the system at least until the end of each trip, i.e. on submission of the electronic landing declaration or of a transhipment report.", "labels": [[0, 4, "Actor"], [17, 36, "Resource"], [41, 70, "Resource"], [86, 106, "Resource"], [130, 164, "Resource"], [171, 192, "Resource"]]}
{"id": 1005, "text": "Any ELSS software updates must not impact upon the ELSS’s ability to meet the requirements set out in this document and other test documentation.", "labels": [[0, 25, "Resource"], [0, 25, "Actor"], [47, 65, "Resource"], [74, 90, "Resource"], [102, 115, "Resource"], [120, 144, "Resource"]]}
{"id": 1006, "text": "ELSS must only be supplied for use at sea and loaded onto an onboard system and is not to be provided for onshore use by agents or representatives.", "labels": [[0, 4, "Actor"], [58, 75, "Resource"], [58, 75, "Actor"], [121, 146, "Actor"]]}
{"id": 1007, "text": "A product supplier will be provided with the opportunity to publish details of their ELSS Approved product on the ELSS Approved Product Register on the UK Fisheries public website.", "labels": [[0, 18, "Actor"], [68, 106, "Resource"], [110, 144, "Actor"], [110, 144, "Resource"], [148, 179, "Actor"], [148, 179, "Resource"]]}
{"id": 1008, "text": "The general user shall be able to use the DH system capabilities to monitor and control the environment in his/her home.", "labels": [[0, 16, "Actor"], [38, 51, "Actor"], [38, 64, "Resource"], [88, 103, "Resource"]]}
{"id": 1009, "text": "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.", "labels": [[0, 10, "Actor"], [25, 57, "Resource"], [103, 139, "Resource"]]}
{"id": 1010, "text": "The system shall include digital programmable humidistats, which shall be used to monitor and regulate the humidity of an enclosed space.", "labels": [[0, 10, "Actor"], [25, 57, "Resource"], [102, 136, "Resource"]]}
{"id": 1011, "text": "The system shall include digital programmable power switches which shall be used to monitor the current state of an appliance (e.g., a coffee maker is off or on).", "labels": [[0, 10, "Actor"], [25, 60, "Resource"], [92, 125, "Resource"], [133, 147, "Resource"]]}
{"id": 1012, "text": "The system shall include magnetic alarm contact switches which shall be used to monitor entry through a door or window when the switch is active.", "labels": [[0, 10, "Actor"], [25, 56, "Resource"], [88, 118, "Resource"], [124, 134, "Resource"]]}
{"id": 1013, "text": "A DH user shall be able to read the temperature at a thermostat position.", "labels": [[0, 9, "Actor"], [32, 72, "Resource"]]}
{"id": 1014, "text": "The thermostats may be controlled individually or collectively, so that temperature can be controlled at different levels in different home spaces.", "labels": [[0, 15, "Resource"], [0, 15, "Actor"], [67, 83, "Resource"], [105, 121, "Resource"], [125, 146, "Resource"]]}
{"id": 1015, "text": "A thermostat unit shall communicate, through wireless signals, with the master control unit.", "labels": [[0, 17, "Resource"], [0, 17, "Actor"], [45, 61, "Resource"], [68, 91, "Actor"], [68, 91, "Resource"]]}
{"id": 1016, "text": "A DigitalHome system shall use wireless signals to communicate, through the master control unit, with the humidistats.", "labels": [[0, 20, "Actor"], [31, 47, "Resource"], [72, 95, "Actor"], [72, 95, "Resource"], [101, 117, "Resource"], [102, 117, "Actor"]]}
{"id": 1017, "text": "A user shall be able to override planned parameter values, through the DH website, or if available, through manual switches on household devices", "labels": [[0, 6, "Actor"], [33, 57, "Resource"], [67, 81, "Actor"], [108, 144, "Resource"], [108, 144, "Actor"]]}
{"id": 1018, "text": "The DH System will backup all system data (configuration, default parameter settings, planning, and usage data) on a daily basis, with the backup time set by the DH Technician at system set up.", "labels": [[0, 13, "Actor"], [26, 111, "Resource"], [135, 150, "Resource"], [158, 175, "Actor"]]}
{"id": 1019, "text": "The DigitalHome System shall provide users with online documentation about the DigitalHome system installed in their home.", "labels": [[0, 22, "Actor"], [37, 42, "Actor"], [48, 68, "Resource"], [75, 121, "Actor"], [111, 121, "Resource"]]}
{"id": 1020, "text": "Mashbot can not be released unless it satisﬁes these requirements.", "labels": [[0, 7, "Actor"], [0, 7, "Resource"], [47, 65, "Resource"]]}
{"id": 1021, "text": "These requirements are not expected to be fulﬁlled by the initial release of Mashbot, but should be implemented in the next major release.", "labels": [[0, 18, "Resource"], [54, 84, "Resource"], [115, 137, "Resource"]]}
{"id": 1022, "text": "Mashbot may be initially released without satisfying these requirements.", "labels": [[0, 7, "Actor"], [0, 7, "Resource"], [53, 71, "Resource"]]}
{"id": 1023, "text": "These requirements are outside the current scope of the project, but are included to exhibit how our software will improve in the future.", "labels": [[0, 18, "Resource"], [31, 63, "Resource"], [97, 109, "Actor"]]}
{"id": 1024, "text": "Publishers may schedule or immediately initiate actions put forth by contributors and those approved by approvers.", "labels": [[0, 10, "Actor"], [48, 55, "Resource"], [69, 81, "Actor"], [104, 113, "Actor"]]}
{"id": 1025, "text": "Mashbot will allow for the association of Mashbot accounts with external service accounts.", "labels": [[0, 7, "Actor"], [0, 7, "Resource"], [23, 89, "Resource"]]}
{"id": 1026, "text": "Mashbot will provide an interface for authenticating a user account to an external service account", "labels": [[0, 7, "Actor"], [0, 7, "Resource"], [21, 98, "Resource"]]}
{"id": 1027, "text": "The system allows for the backup of the data system to local or remote non-volatile storage systems.", "labels": [[0, 10, "Actor"], [22, 51, "Resource"], [55, 99, "Resource"], [55, 99, "Actor"]]}
{"id": 1028, "text": "The system encrypts data over a direct connection between the web client and the server.", "labels": [[0, 10, "Actor"], [20, 24, "Resource"], [30, 87, "Resource"], [58, 72, "Actor"], [77, 87, "Actor"]]}
{"id": 1029, "text": "The system is conﬁgurable to e-mail warnings about multiple failed login attempts from the same user.", "labels": [[0, 10, "Actor"], [51, 100, "Resource"], [87, 100, "Actor"]]}
{"id": 1030, "text": "A member should be able to monitor trending topics regarding their campaign", "labels": [[0, 8, "Actor"], [35, 75, "Resource"]]}
{"id": 1031, "text": "The user can divide a pdf document into parts, following some options for how to split the document.", "labels": [[0, 8, "Actor"], [20, 34, "Resource"], [40, 45, "Resource"], [57, 69, "Resource"], [87, 99, "Resource"]]}
{"id": 1032, "text": "The user selects the document he wants to split from a directory.", "labels": [[0, 8, "Actor"], [17, 47, "Resource"], [53, 64, "Resource"]]}
{"id": 1033, "text": "Here the user can define a pattern that will generate filenames for the output files.", "labels": [[5, 13, "Actor"], [25, 34, "Resource"], [54, 63, "Resource"], [68, 84, "Resource"]]}
{"id": 1034, "text": "Users may want to combine documents together by taking pages alternatively from two existing pdf documents (e.g. for documents coming from one-sided scanners).", "labels": [[0, 5, "Actor"], [26, 35, "Resource"], [55, 60, "Resource"], [80, 158, "Resource"]]}
{"id": 1035, "text": "The users have the ability to bulk rotate pages in different documents.", "labels": [[0, 9, "Actor"], [42, 70, "Resource"]]}
{"id": 1036, "text": "The users select the document that they want to manipulate from a directory.", "labels": [[0, 9, "Actor"], [17, 58, "Resource"], [64, 75, "Resource"]]}
{"id": 1037, "text": "Users can combine multiple pdf documents in a single pdf document through a user friendly graphical interface with simple utilities.", "labels": [[0, 5, "Actor"], [18, 40, "Resource"], [44, 65, "Resource"], [74, 131, "Resource"], [74, 131, "Actor"]]}
{"id": 1038, "text": "Users have the ability to save the working environment with all the status of every part of the application, so they don’t have to set the options of each plugin every time they open the application.", "labels": [[0, 5, "Actor"], [31, 54, "Resource"], [60, 107, "Resource"], [135, 161, "Resource"], [183, 198, "Resource"]]}
{"id": 1039, "text": "Users can understand how PDFsam responds to their actions by viewing the log messages in the log panel.", "labels": [[0, 5, "Actor"], [25, 31, "Actor"], [25, 31, "Resource"], [44, 57, "Resource"], [77, 85, "Resource"], [89, 102, "Resource"]]}
{"id": 1040, "text": "Users are allowed to make modifications on PDFsam’s working environment, in order to adapt to their preferences and cover their needs more sufficiently.", "labels": [[0, 5, "Actor"], [26, 39, "Resource"], [43, 71, "Resource"], [94, 111, "Resource"], [122, 133, "Resource"]]}
{"id": 1041, "text": "The user has to select Settings below the plugins tree and the Settings main panel appears with all the available choices that the user can do.", "labels": [[0, 8, "Actor"], [23, 54, "Resource"], [59, 82, "Actor"], [59, 82, "Resource"], [96, 121, "Resource"], [127, 135, "Actor"]]}
{"id": 1042, "text": "PDFsam is an application that needs a few system resources to work.", "labels": [[0, 6, "Actor"], [0, 6, "Resource"], [10, 24, "Resource"], [10, 24, "Actor"], [36, 58, "Resource"]]}
{"id": 1043, "text": "The Technology Architecture describes the logical software and hardware capabilities that are required to support the deployment of business, data, and application services.", "labels": [[0, 27, "Actor"], [0, 27, "Resource"], [38, 84, "Resource"], [114, 172, "Resource"]]}
{"id": 1044, "text": "The Application Architecture provides a blueprint for the individual application systems to be deployed, their interactions, and their relationships to the core business processes of the organization.", "labels": [[0, 28, "Actor"], [0, 28, "Resource"], [38, 103, "Resource"], [105, 123, "Resource"], [129, 148, "Resource"]]}
{"id": 1045, "text": "Architecture Vision defines overall architecture guiding principles, goals and objectives and desired traits.", "labels": [[0, 19, "Actor"], [0, 19, "Resource"], [28, 108, "Resource"]]}
{"id": 1046, "text": "The Business Architecture defines the business strategy, governance, organization, and key business processes.", "labels": [[0, 25, "Actor"], [0, 25, "Resource"], [34, 109, "Resource"]]}
{"id": 1047, "text": "The Data Architecture describes the structure of an organization's logical and physical data assets and data management resources.", "labels": [[0, 21, "Actor"], [0, 21, "Resource"], [32, 129, "Resource"]]}
{"id": 1048, "text": "Systems supporting OM should have the ability to produce pre-formatted queries and reports to allow faster and more accurate reporting, while still allowing the flexibility of ad-hoc reporting.", "labels": [[157, 192, "Resource"], [57, 90, "Resource"], [100, 134, "Resource"]]}
{"id": 1049, "text": "A designated constable from each police station constantly interfaces with the courts.", "labels": [[0, 22, "Actor"], [33, 47, "Actor"], [75, 85, "Actor"]]}
{"id": 1050, "text": "The police in turn can use it to respond to citizens with very little turnaround time.", "labels": [[0, 10, "Actor"], [44, 52, "Actor"]]}
{"id": 1051, "text": "It improves overall productivity by helping citizens and police to cut short the drudgery of large amounts of paperwork.", "labels": [[44, 52, "Actor"], [57, 63, "Actor"]]}
{"id": 1052, "text": "The System must allow a user to be a member of more than one group.", "labels": [[0, 10, "Actor"], [24, 28, "Actor"], [35, 66, "Actor"]]}
{"id": 1053, "text": "System Administrator: Is generally the owner that takes care of maintenance for the Web Store system.", "labels": [[0, 20, "Actor"], [80, 100, "Actor"]]}
{"id": 1054, "text": "The MultiMahjongServer will allow players on MultiMahjongClient programs to chat with each other in real time.", "labels": [[0, 22, "Actor"], [34, 72, "Actor"]]}
{"id": 1055, "text": "Users who create a new game will be able to change the ability level of any CO involved in the game.", "labels": [[0, 5, "Actor"]]}
{"id": 1056, "text": "User's will be able to chat with each other in real time.", "labels": [[0, 6, "Actor"], [33, 43, "Actor"]]}
{"id": 1057, "text": "The user will be able to end the game at any stage of the game.", "labels": [[0, 8, "Actor"]]}
{"id": 1058, "text": "The user will then be able to quit the program or begin/join a new game.", "labels": [[0, 8, "Actor"]]}
{"id": 1059, "text": "The MultiMahjongServer will inform all MultiMahjongClients connected to the game that the game has ended.", "labels": [[0, 22, "Actor"], [35, 80, "Actor"]]}
{"id": 1060, "text": "Users of any MultiMahjongClient previously connected to the game will have the choice to quit the program or to begin/join a new game.", "labels": [[0, 64, "Actor"]]}
{"id": 1061, "text": "If a user leaves the game prematurely, a new CO is created on another user's machine to fill their place.", "labels": [[3, 9, "Actor"], [39, 47, "Actor"]]}
{"id": 1062, "text": "The user who created the game will decide at what level the CO will play at.", "labels": [[0, 29, "Actor"]]}
{"id": 1063, "text": "The TCS shall restrict operator access to this capability via password protection.", "labels": [[0, 7, "Actor"], [23, 31, "Actor"]]}
{"id": 1064, "text": "The APAF system web server shall be password protected where appropriate to allow only pertinent ASPERA-3 team members access.", "labels": [[0, 26, "Actor"], [82, 118, "Actor"]]}
{"id": 1065, "text": "SwRI shall provide APAF system maintenance.", "labels": [[0, 4, "Actor"]]}
{"id": 1066, "text": "The HATS-GUI shall prompt the user to confirm deletion prior to completing this action.", "labels": [[0, 12, "Actor"], [26, 34, "Actor"]]}
{"id": 1067, "text": "The HATS-GUI shall allow the user to specify the number of levels of nodes to expand during SDT viewing.", "labels": [[0, 12, "Actor"], [25, 33, "Actor"]]}
{"id": 1068, "text": "A few authorized individuals may be allowed access to parts of the system that are usually considered restricted.", "labels": [[0, 28, "Actor"], [54, 112, "Actor"]]}
{"id": 1069, "text": "A system administrator shall have unrestricted access to all aspects of the system.", "labels": [[0, 22, "Actor"], [57, 82, "Actor"]]}
{"id": 1070, "text": "The administrator shall have the ability to block all access to the system for all users or selectively by user.", "labels": [[0, 17, "Actor"], [79, 111, "Actor"]]}
{"id": 1071, "text": "Allow agents to choose among unicast, multicast and broadcast communication.", "labels": [[6, 12, "Actor"]]}
{"id": 1072, "text": "Allow agents to join and leave multicast group.", "labels": [[6, 12, "Actor"], [31, 46, "Actor"]]}
{"id": 1073, "text": "The user must undo and redo its last thousand actions.", "labels": [[0, 8, "Actor"]]}
{"id": 1074, "text": "The product must record the score (time and number of counts) of a play associated with the name of a user.", "labels": [[0, 11, "Actor"]]}
{"id": 1075, "text": "The product must count and display the number of the user's action.", "labels": [[0, 11, "Actor"]]}
{"id": 1076, "text": "The product must count and display the time that the user uses to play.", "labels": [[0, 11, "Actor"], [49, 57, "Actor"]]}
{"id": 1077, "text": "The product must display a window with all the player's scores.", "labels": [[0, 11, "Actor"]]}
{"id": 1078, "text": "The user can redo a movement that has been canceled.", "labels": [[0, 8, "Actor"]]}
{"id": 1079, "text": "Administrative users can give other users administrative access up to their own access level only.", "labels": [[0, 20, "Actor"], [30, 41, "Actor"]]}
{"id": 1080, "text": "Filing Agency, Law Enforcement Agency investigating and presenting charges to District Attorney against Defendant.", "labels": [[0, 13, "Actor"], [78, 95, "Actor"], [104, 113, "Actor"]]}
{"id": 1081, "text": "Office of Attorney Appointments, Person responsible for managing the Indigent Defense appointment process.", "labels": [[0, 31, "Actor"]]}
{"id": 1082, "text": "Defense Attorney contacts Defendant within one working day of appointment.", "labels": [[0, 16, "Actor"], [26, 35, "Actor"]]}
{"id": 1083, "text": "Ability to create user groups such as NCSU TPP.org, GT TPP.org", "labels": []}
{"id": 1084, "text": "Ability to create project managers, analysts and guests", "labels": []}
{"id": 1085, "text": "Ability to disable access for old project managers, analysts and guests.", "labels": []}
{"id": 1086, "text": "Ability to assign analysts to user groups created by the administrator", "labels": [[30, 41, "Actor"], [53, 70, "Actor"]]}
{"id": 1087, "text": "Ability to assign usergroups and individual analysts to projects", "labels": []}
{"id": 1088, "text": "If the patient is not cured then the doctor will refer the patient to some other Hospitals the hospital may be another VSP or any other.", "labels": [[3, 14, "Actor"], [33, 43, "Actor"], [55, 66, "Actor"], [70, 90, "Actor"], [91, 103, "Actor"], [119, 122, "Actor"]]}
{"id": 1089, "text": "Allows online updates to individual records by authorized staff.", "labels": [[47, 63, "Actor"]]}
{"id": 1090, "text": "Staff is willing to accept, learn, and utilize the new system.", "labels": [[0, 5, "Actor"], [47, 61, "Actor"]]}
